{
  "meta": {
    "year": 2026,
    "total_articles": 38,
    "last_updated": "2026-02-28T09:33:58.476141Z",
    "new_this_run": 0
  },
  "articles": [
    {
      "title": "Neil Sedaka, “Breaking Up Is Hard to Do” and “Laughter in the Rain” Singer-Songwriter, Dies at 86",
      "url": "https://www.hollywoodreporter.com/music/music-news/neil-sedaka-dead-breaking-up-hard-to-do-laughter-in-rain-1236517870/",
      "date_collected": "2026-02-28 07:16:57",
      "publication_date": "2026-02-27T21:55:28",
      "source": "Hollywood Reporter",
      "full_text": "Skip to main content By Chris Koseluk Plus Icon Chris Koseluk View All February 27, 2026 1:55pm Neil Sedaka Brad Barket/Getty Images Neil Sedaka, the buoyant singer-songwriter and pianist who had No. 1 hits with “Laughter in the Rain,” “Breaking Up Is Hard to Do,” “Bad Blood” and, for Captain & Tennille, “Love Will Keep Us Together,” died Friday in Los Angeles. He was 86. “Our family is devastated by the sudden passing of our beloved husband, father and grandfather,” his family said in a statement. “A true rock and roll legend, an inspiration to millions, but most importantly, at least to those of us who were lucky enough to know him, an incredible human being who will be deeply missed.” Related Stories TV Bobby J. Brown, Actor on 'The Wire,' Dies at 62 in a Fire General News Elizabeth Snead, Former Hollywood Reporter Contributor, Dies at 74 First teaming with lyricist Howard Greenfield — a neighbor in his Brooklyn apartment building — while still in his teens, Sedaka scored his first hit as a songwriter in 1958 when Connie Francis recorded the duo’s “Stupid Cupid,” a peppy single that rose to No. 17 on the Billboard Hot 100. They wrote several other hits for Francis, including 1958’s “Fallin'” and “Where the Boys Are,” the theme to the popular 1960 MGM comedy; the latter reached No. 4 in the U.S. and became her signature song. The clean-cut Sedaka quickly cemented his pop stardom with a string of popular tunes that included “Oh! Carol” (No. 9), “Stairway to Heaven” (No. 9), “Run Samson Run” (No. 28), “Calendar Girl” (No. 4), “Little Devil” (No. 11), “Happy Birthday, Sweet Sixteen” (No. 6) and “Next Door to an Angel” (No. 5). Sedaka and Greenfield’s “Breaking Up Is Hard to Do,” with a carefree, nonsensical opening — “Do do do, Down dooby doo down down, Comma, comma, down dooby doo down down, Comma, comma, down dooby doo down down” — proved irresistible to teens, enjoying a 14-week run on the singles chart and in the summer of 1962 becoming Sedaka’s first No. 1 hit. “I was the king of the tra-la-las and doo-be-do’s in the ’50s and ’60s,” he told Reuters in 2010. “It had to have a very catchy tune, with a catchy beat that you can dance to.” Between 1958-62, Sedaka and Greenfield would sell 25 million records, with 10 big hits in a row. “First, his songs have clever lyrics and wonderfully infectious tunes,” The New York Times wrote in 1976. “Second, his melodies have just enough soft‐rock and rhythm and blues underpinnings to avoid bonelessness. Third, he leavens the cheeriness with sentimentality more innocent than crass. Fourth, he has remarkable voice — a sweetly mellow, evocative high tenor that shades imperceptibly into falsetto.” Despite all that, Sedaka’s popularity and that of other American pop stars began to wane in the mid-’60s amid the British music invasion. He didn’t release an album for six years as singles including “Sunny,” “The World Through a Tear” and “The Answer to My Prayer” barely made a ripple. When his label opted not to renew his contract in 1966, Sedaka took a break from singing and focused on songwriting. Over the next several years, he teamed with Carole Bayer to write “When Love Comes Knockin’ (at Your Door)” and “The Girl I Left Behind Me,” hits for The Monkees. He and Greenfield also penned tunes for The Cyrkle (“We Had a Good Thing Goin'”) and Davy Jones (“Rainy Jane”). The 5th Dimension landed in the top 20 with “Workin’ on a Groovy Thing,” a tune he wrote with Roger Atkins. The Carpenters, Andy Williams and Shirley Bassey enjoyed success with “Solitaire,” a song Sedaka recorded and wrote with lyricist Phil Cody. When his album releases in 1969 ( Workin’ on a Groovy Thing ) and 1971 ( Emergence ) didn’t generate much excitement, Sedaka moved to England in 1970 to change things up. After a chance meeting with Elton John in 1973, he signed with John’s fledgling label, The Rocket Record Co. The move led to one of the most successful periods in Sedaka’s career. In 1974, Polydor Records released Sedaka’s Back , a collection of songs — some recorded with future members of 10cc — from three albums that had only been released in the U.K. It peaked at No. 23 on the Billboard 200 album chart and gave Sedaka his second No. 1 song when the lilting “Laughter in the Rain,” co-written with Cody, became a stateside sensation. The following year, Sedaka scored again with the Rocket Records release The Hungry Years . It went gold in the U.S. and gave him another No. 1 with “Bad Blood,” featuring John on backing vocals. The LP also featured a new version of “Breaking Up Is Hard to Do”; rearranging it as a ballad, he breathed new life into the song and turned it into another top 10 hit and a Song of the Year nominee. In 1975, Captain & Tennille recorded his “Love Will Keep Us Together” and featured it as the title tune on their debut album. The jubilant tune became the year’s best-selling single and was named Record of the Year at the Grammys. (Toni Tennille gave him nod by ad-libbing “Sedaka is back” in the song’s closing frame.) “The crowning touch was winning the BMI award for Most Performed Song of the Year [for ‘Love Will Keep Us Together’],” Sedaka said in Bruce Pollock’s 1979 book, When Rock Was Young . “It was the dream of a lifetime. I mean, I’d been going to that BMI dinner since I was a kid. I got six awards in one year, including the Most Performed Song of 1975, beating out ‘Rhinestone Cowboy.'” Neil Sedaka during his 1976 NBC special, Neil Sedaka Steppin’ Out . Courtesy Everett Collection Sedaka was born in Brooklyn on March 13, 1939, and raised in the Brighton Beach section of the borough. His father, Mordechai, drove a taxi for 30 years. His mother, Eleanor, took on part-time work in an Abraham & Straus department store to pay for his first piano when he was 9. “My parents told me that when I was an infant, I wouldn’t eat until the radio was playing music,” he said in the 2014 BBC documentary Neil Sedaka: King of Song . In 1947, Sedaka landed a scholarship to Juilliard’s School of Music’s Preparatory Division for Children. “Without blowing my own horn, I have the musical training. I studied many, many years,” Sedaka said in a 2019 interview with The Morning Call newspaper. “Matter of fact, in 1956, Arthur Rubinstein, the great pianist, chose me [to be] on a radio program, and I won as the best New York City high school pianist. I was 16 years old.” Sedaka’s mom wanted him to pursue a career as a classical pianist, but Greenfield, a budding poet, convinced him that they should write pop tunes together. They began working together in October 1952 when Sedaka was 13, and one point, they had written at least one song a day for 500 straight days. In 1956, the pair approached Jerry Wexler at Atlantic Records, and soon, their songs were being recorded by the likes of The Clovers (“Bring Me Love”), The Cookies (“Passing Time”), LaVern Baker (“I Waited Too Long”) and Clyde McPhatter (“Since You’ve Been Gone”). Meanwhile, Sedaka tried his hand at singing, joining forces with three Lincoln High School classmates to form the Linc-Tones. He went solo in 1957, but not before the group enjoyed some success with “While I Dream,” “I Love My Baby,” “Come Back, Joe” and “Don’t Go Away,” all Sedaka-Greenfield compositions. (The Linc-Tones would evolve into The Tokens, who hit pay dirt in 1961 with “The Lion Sleeps Tonight.”) Over the next year, Sedaka released “Laura Lee,” “Ring a Rockin'” and “Oh Delilah,” all written with Greenfield. He didn’t cause much of a stir as a singer, though he performed “Ring a Rockin'” on American Bandstand . The songwriting team fared better, however, and landed a contract with Al Nevins and Don Kirshner at Aldon Music in the Brill Building. Through Aldon, they arrived at the home of Francis, who was in search of a follow-up to “Who’s Sorry Now,” and presented her with a selection of ballads. “They played and they played and they played, and I was really falling asleep,” she said in King of Song . “I said, ‘Fellas, I don’t know how to tell you this, your music is beautiful, but it’s too educated, the kids don’t dig this kind of stuff anymore.'” On a lark, Sedaka played “Stupid Cupid,” which he and Greenfield had written for another act. Francis told them on the spot she wanted it for her next record, and its success put the songwriters on the map. As he and Greenfield continued working with the singer, Sedaka observed her writing in a journal. He wanted a look inside, but she refused, and that inspired him to write “The Diary.” Little Anthony and the Imperials recorded a version, but Sedaka’s take (he also played piano on it) got him a recording contract with Aldon. Sedaka wrote “Oh! Carol” in 1958, drawing the idea for the title from Carole Klein, a girl he had dated at Lincoln. He encouraged her to join him at the Brill Building in Manhattan, the mecca for songwriters, and she did. There, Klein joined forces with her future husband, Gerry Goffin, and as Carole King, she became one of the most influential singer-songwriters of her generation. (“Oh! Carol,” meanwhile, sold 3.5 million records, and he said his life changed when he received his first royalty check from that song, for $42,000.) The year 1959 saw the release of Rock With Sedaka , his first solo album as a recording artist. “The Diary,” its debut single, charted, as did the second release, “I Go Ape.” It also contained Sedaka’s takes on “Fallin’,” “Stupid Cupid” and “Another Sleepless Night,” which Jimmy Clanton turned into a hit the following year. “Howard Greenfield and I mastered the art of the 2 1/2-minute single,” he said. “We could tell a whole story from beginning to end [in that time].” He eventually split with Greenfield and partnered with Cody, and “Laughter in the Rain” marked his big comeback, landing at No. 1 in 1975 in its 16th week on the Billboard Hot 100. “I went from making $30,000 a year to $6 million a year with [that] song,” he said. A five-time Grammy nominee and member of the Songwriters Hall of Fame, Sedaka would write or co-write 700-plus songs and release more than two dozen studio albums during his career. In 2005, Erik Jackson and Ben H. Winters conceived Breaking Up Is Hard to Do , a stage musical celebrating the songs of Sedaka, Greenfield and Cody. It has been performed in the U.K. and throughout the U.S. Around that time, “(Is This the Way to) Amarillo,” a song he wrote with Greenfield that was first recorded by Tony Christie in the ’70s, became another huge hit for him when it was rereleased. Survivors include his wife, Leba, whom he married in 1962; his children, Dara, a recording artist and vocalist for commercials, and Marc, a TV writer and film editor; and three grandchildren. “I think the reason that my music is so special is it was a combination of show music, pop music, evergreen standards and rock. It’s like me and Phil Cody and Carole Sager and Howie Greenfield — we had a combination of all of those styles,” Sedaka said in his Morning Call chat. “I saw Stevie Wonder not long ago on television and he was asked, ‘Who is your inspiration?’ And he said, ‘Neil Sedaka. They used to call me ‘Whitey’ in Detroit because I liked and played Neil Sedaka records.'” THR"
    },
    {
      "title": "Neve Campbell Makes Her Return for ‘Scream 7,’ ‘Hoppers’ Hits Hollywood and This Week’s Best Events",
      "url": "https://www.hollywoodreporter.com/gallery/scream-7-hoppers-red-carpet-events-1236512682/",
      "date_collected": "2026-02-28 07:16:55",
      "publication_date": "2026-02-27T22:13:25",
      "source": "Hollywood Reporter",
      "full_text": "× ‘Scrubs’ Premiere Image Credit: Photo Credit: Monica Schipper/Getty Images Zach Braff, Donald Faison, John C. McGinley, Sarah Chalke and Judy Reyes premiered the Scrubs revival in L.A. on Monday. ‘Hoppers’ Premiere Image Credit: Photo Credit: Rodin Eckenroth/Getty Images for Disney Jon Hamm, Piper Curda, Bobby Moynihan and Dave Franco brought Disney and Pixar’s Hoppers to Hollywood on Monday. ‘DTF St. Louis’ Premiere Image Credit: Photo Credit: JC Olivera/GA/The Hollywood Reporter via Getty Images Jason Bateman, Linda Cardellini and David Harbour debuted their new HBO series DTF St. Louis in L.A. on Tuesday. ‘Marshals’ Premiere Image Credit: Photo Credit: Jon Kopaloff/Getty Images for CBS Arielle Kebbel and Luke Grimes paired up at the L.A. premiere of CBS’s Marshals on Tuesday. ‘Scream 7’ Premiere Image Credit: Photo Credit: Phillip Faraone/Getty Images for Paramount Pictures Courteney Cox, Skeet Ulrich, Neve Campbell, David Arquette and Matthew Lillard united to debut Scream 7 in L.A. on Wednesday. ‘The Dreadful’ Special Screening Image Credit: Photo Credit: Lionsgate and Olivia Wong Marcia Gay Harden joined Lionsgate for a special screening of The Dreadful in Santa Monica on Feb. 20. Blocking Brilliance: Honoring Trailblazing Women of Color Directors Image Credit: Photo Credit: Jairus Williams / Greener Pastures Media Regina King sat down with director Neema Barnette at the Black Directors Alliance’s Blocking Brilliance event in L.A. on Feb. 20. Taurus World Stunt Awards Image Credit: Photo Credit: Presley Ann/Getty Images for Taurus World Stunt Awards Arnold Schwarzenegger was presented with a special honor at the Taurus World Stunt Awards in L.A. on Saturday. ‘Under the Rainbow’ Premiere Image Credit: Photo Credit: Todd Williamson/January Images Co-directors Seth Gordon and Nikki Calabrese attended the premiere of Under the Rainbow at L.A.’s Slamdance Film Festival on Saturday. Annie Awards Image Credit: Photo Credit: Eric Charbonneau KPop Demon Hunters ‘ May Hong, Arden Cho, Ji-young Yoo, Michelle Wong, Maggie Kang and Chris Appelhans celebrated their wins at the Annie Awards on Saturday. ‘Operation Taco Gary’s’ at Smorgasburg LA Image Credit: Photo Credit: Michelle Felix Simon Rex made an appearance at Smorgasburg LA on Sunday to promote his new comedy Operation Taco Gary’s . ‘Sentimental Value’ Special Screening Image Credit: Photo Credit: Todd Williamson/January Images Eva Victor joined Elle Fanning for a screening of Sentimental Value at Vidiots on Sunday. Frieze Week Kickoff Image Credit: Photo Credit: Jenna Burke/BFA.com Caroline Belhumeur and Sharon Stone were in attendance as Vince, Autre Magazine and Jeffrey Deitch Gallery teamed up for a Frieze Week kickoff dinner on Monday. The Ambies Image Credit: Photo Credit: Stephen Lovekin / Shutterstock for The Podcast Academy The Podcast Academy hosted the 6th annual awards for Excellence in Audio, known as The Ambies, in NYC on Tuesday, with Pablo Torres among the winners. ‘Operation Taco Gary’s’ Premiere Image Credit: Photo Credit: Olivia Wong Arturo Castro, Brenda Song, Simon Rex and Jason Biggs walked the carpet at the L.A. premiere of Operation Taco Gary’s on Tuesday. ‘Survivor 50’ Premiere Image Credit: Photo Credit: Roy Rochlin/Getty Images for CBS Broadcasting Inc. Jeff Probst celebrated the kick-off of the historic Survivor 50 season in NYC on Tuesday. ‘Frankenstein’ Reception Image Credit: Photo Credit: Courtesy Netflix Adrien Brody joined Jacob Elordi at a reception for Frankenstein in NYC on Tuesday. ‘EPiC’ Screening Image Credit: Photo Credit: Kristina B Photography Georgina Chapman and Adrien Brody then joined Baz Luhrmann for a special screening of EPiC: Elvis Presley in Concert in NYC on Tuesday. CAA’s Black History Month Event Image Credit: Photo Credit: Courtesy CAA In celebration of Black History Month, CAA hosted a roundtable discussion on Tuesday with TV personality Scott Evans, NAACP president and CEO Derrick Johnson, CAA’s Lisa Joseph Metelus and Travis Merriweather, and creator Juju Green. The Old Bags Luncheon Image Credit: Photo Credit: BFA / Diana Zapata Priscilla Presley joined the Center for Family Services Palm Beach County for its annual The Old Bags Luncheon fundraiser, benefitting mental health services, at the iconic Breakers Palm Beach. AD Design Event Image Credit: Photo Credit: Phillip Faraone/Getty Images for AD Architectural Digest ‘s Amy Astley joined Kristen Stewart and Scout Willis as AD celebrated “Design Making a Difference” at The West Hollywood Edition on Tuesday. ‘The Story of You: A Life Rewritten’ Launch Party Image Credit: Photo Credit: Wil Roberts Blake Cooper Griffin celebrated his debut book The Story of You: A Life Rewritten in West Hollywood on Tuesday, along with support from Anthony Carrigan. ‘American Classic’ Premiere Image Credit: Photo Credit: Jason Crowley/BFA.com Jon Tenney, Laura Linney and Kevin Kline attended the NYC premiere of MGM+ series American Classic on Wednesday. ‘Zootopia 2’ Celebration Image Credit: Photo Credit: Disney/Julian Guevara Patrick Warburton, Bryon Howard, Yvett Merino, Ke Huy Quan, Ginnifer Goodwin, Yvette Nicole Brown and Jared Bush gathered to celebrate Zootopia 2 ‘s home entertainment release in L.A. on Wednesday. ‘Chris Fleming: Live at the Palace’ Premiere Image Credit: Photo Credit: Marion Curtis / StarPix for HBO Chris Fleming debuted his HBO comedy special Chris Fleming: Live at the Palace in NYC on Wednesday. ‘Train Dreams: The Visual Journey’ Image Credit: Photo Credit: Gonzalo Marroquin/Getty Images for Netflix Wagner Moura, Adolpho Veloso and Clint Bentley made an appearance at Netflix’s Train Dreams pop-up gallery in L.A. on Wednesday. ‘Protector’ Premiere Image Credit: Photo Credit: Stewart Cook/Magenta Light Studios via Getty Images Milla Jovovich walked the carpet at the L.A. premiere of action film Protector on Wednesday. Target x Roller Rabbit Launch Event Image Credit: Photo Credit: Darian DiCianno/BFA.com Target hosted an event in NYC on Wednesday to celebrate the upcoming launch of its Roller Rabbit x Target collection, alongside Summer House ‘s Lindsay Hubbard and Amanda Batula. John Davis Hand and Footprint Ceremony Image Credit: Photo Credit: Kevin Winter/Getty Images Samuel L. Jackson and Kate Hudson supported John Davis at the producer’s hand and footprint ceremony at the TCL Chinese Theatre on Thursday. ‘One Piece’ Fan Screening Image Credit: Photo Credit: Roger Kisby/Getty Images for Netflix Taz Skylar, Emily Rudd, Iñaki Godoy, Mackenyu, Jacob Romero and Charithra Chandran premiered the second season of Netflix’s One Piece at a L.A. fan screening on Thursday. 21 Laps New York Launch Party Image Credit: Photo Credit: Marion Curtis / StarPix for 21 Laps Jimmy Fallon supported Shawn Levy as he celebrated the New York expansion of his production company, 21 Laps, at the Corner Store on Thursday. G’Day USA Arts Gala Image Credit: Photo Credit: Chris Schmitt Photography for G’DAY USA Arts Gala Vince Vaughn was on hand to honor Yvonne Strahovski at the 23rd annual G’Day USA Arts Gala, recognizing Australian talent, in L.A. on Thursday. Meiomi Club Noir Image Credit: Photo Credit: Andrea Sabugo Gwyneth Paltrow made an appearance in Vail, Colorado to celebrate the first-ever Meiomi Club Noir. NAACP Image Awards Creative Honors Image Credit: Photo Credit: Leon Bennett/Getty Images for NAACP Wunmi Mosaku was among the winners at the NAACP Image Awards Creative Honors in downtown L.A. on Thursday. Citizens of Humanity Dinner Image Credit: Photo Credit: Citizens of Humanity Artist Lauren Halsey (alongside Chris Rock) teamed with Citizens of Humanity for an evening of arts and culture in L.A. on Thursday. MAC x Sephora Launch Party Image Credit: Photo Credit: Jason Crowley & Brendon Cook/BFA.com MAC Cosmetics celebrated the arrival of MAC at Sephora U.S. with a launch event in NYC on Thursday, and Julia Fox among the attendees. Samsung Solve for Tomorrow: AI in Action Lab Image Credit: Photo Credit: Jason Mendez/Getty Images for Samsung Electronics America Emma Grede, Mark Cuban and Samsung’s Allison Stransky took part in the Samsung Solve for Tomorrow: AI in Action Lab event on Thursday in NYC. Children’s Hospital Los Angeles’ Make March Matter Kick-Off Image Credit: Photo Credit: Araya Doheny/Getty Images for Children's Hospital Los Angeles John Stamos helped Children’s Hospital Los Angeles kick off its Make March Matter campaign in L.A. on Thursday. Casting Society’s Artios Awards Image Credit: Photo Credit: Courtesy CSA Supriya Ganesh and Francois Arnaud appeared as presenters at the Casting Society’s 41th annual Artios Awards on Thursday. An Evening With Chloé Zhao Image Credit: Photo Credit: Amanda Edwards/Getty Images for Film Independent Regina King sat down with the Hamnet filmmaker for Film Independent’s “An Evening With…Chloé Zhao” event on Thursday. ‘Prodigal Daughter’ Premiere Image Credit: Photo Credit: Elizabeth Viggiano Taylor Tomlinson celebrated her new Netflix special Prodigal Daughter with some help from non-alcoholic spirit Seedlip. ‘The Madison’ Tastemaker Event Image Credit: Photo Credit: Todd Williamson/JanuaryImages for Paramount+ Elle Fanning, Cindy Holland and Michelle Pfeiffer attended a L.A. Tastemaker event for The Madison on Friday."
    },
    {
      "title": "What Sparked Paramount’s Investigation of Jeff Shell",
      "url": "https://www.hollywoodreporter.com/business/business-news/paramount-investigation-jeff-shell-1236517859/",
      "date_collected": "2026-02-28 07:16:54",
      "publication_date": "2026-02-27T22:35:30",
      "source": "Hollywood Reporter",
      "full_text": "× Skip to main content By Gary Baum Plus Icon Gary Baum Senior Writer garymbaum Follow Sign Up View All February 27, 2026 2:35pm Jeff Shell in 2022 at the Allen & Company Sun Valley Conference. Getty Images The high-stakes gambler who sparked an internal investigation and filed a whistleblower complaint against Jeff Shell had previously discussed a music reality show with him. R.J. Cipriani co-created and exec produced Roku’s Spanish-language series Serenata De Las Estrellas , in which Latin acts like Ozomatli and Los Lobos perform surprise mini-concerts for fans who’ve gone through tough times. He’d been introduced to Shell via their mutual attorney Patty Glaser, and he’d recently pitched the studio boss on picking up the English-language format of Serenata . Related Stories Business It's a Deal: Paramount and Warner Bros. Discovery Unveil $111 Billion Megamerger Business Paramount Stock Spikes on Warner Bros. Takeover as Wall Street Games Out Scenarios After the discussion soured, Cipriani brought claims to the attention of Paramount about Shell. As THR previously revealed , the entertainment mogul is alleged to have improperly disclosed details about the timing, cost and structure of his public company’s $7.7 billion media rights deal with the Ultimate Fighting Championship, whose parent TKO Group Holdings jumped 10 percent following news of the pact. Notably, Glaser has been both Shell’s attorney as well as counsel representing Cipriani in business pertaining to Serenata , whose English-language version has been shopped as Star Serenade . In the current conflict, Cipriani’s counsel is Steve Aaronoff, who previously worked for Glaser. Glaser is a prominent Hollywood litigator with a formidable reputation. Kim Basinger referred to her as “Ms. Glacier” during the 1990s legal feud over the film Boxing Helena . “I sort of took it as a compliment,” Glaser later recalled . Cipriani and Shell declined to comment. Glaser didn’t respond to an inquiry about her involvement with both parties. The Shell saga has surfaced as Paramount owner David Ellison appears to have succeeded with his $111 billion bid to take outmaneuver Netflix and win control of Warner Bros. Discovery, pending regulatory review. Shell landed atop Paramount after his termination from his last top post as NBC Universal’s CEO over allegations of sexual misconduct with a CNBC correspondent. Ellison has repeatedly been willing to look past reported alleged transgressions in big hires, bringing on John Lasseter to run Skydance Animation and, as THR reported Feb. 27, screenwriter Max Landis to work on a feature for its rebooted G.I. Joe franchise. Both men have made public acknowledgments in response to accusations of sexual misconduct. Cipriani is a larger-than-life character known within and beyond the entertainment business for his exploits as a gambler, connector, instigator and whistleblower. Last year, he took issue with the accuracy and framing of a Mark Wahlberg-produced Amazon docuseries about his fraught entanglement with an international drug kingpin. THR"
    },
    {
      "title": "TV Ratings: ‘Survivor 50’ and ‘Scrubs’ Revival Post Solid Starts",
      "url": "https://www.hollywoodreporter.com/tv/tv-news/survivor-50-scrubs-premiere-ratings-1236517931/",
      "date_collected": "2026-02-28 07:16:53",
      "publication_date": "2026-02-27T23:08:53",
      "source": "Hollywood Reporter",
      "full_text": "Skip to main content By Rick Porter Plus Icon Rick Porter Television Business Editor rickporter Follow Sign Up View All February 27, 2026 3:08pm 'Survivor' in Fiji for the monumental 50th season, with the chance to win $1 million. Robert Voets/CBS ©2025 CBS Broadcasting, Inc. All Rights Reserved. Logo text The milestone 50th edition of Survivor pulled in solid ratings numbers Wednesday night — as did another show that debuted in the early 2000s, ABC’s revival of Scrubs . The supersized Survivor 50 premiere averaged 5.06 million viewers over its three hours. That’s the biggest same-day audience for Survivor episode since the penultimate episode of season 45 in December 2023. The show also delivered CBS’ best Wednesday night performance since May 2022’s season 42 finale of Survivor . The premiere also posted a 0.95 rating among adults 18-49 (equivalent to about 1.29 million people in that age range) — the best night one showing for Survivor since November 2021 — and a 1.22 rating among adults 25-54 (about 1.53 million viewers in that demo). Both figures led primetime on Wednesday. Related Stories TV 'Survivor 50' Star Kyle Fraser Opens Up About His Painful Injury and Exit From the Game: \"Tough Pill to Swallow\" TV Streaming Ratings: 'Bridgerton' Returns Higher With Season 4 Debut Scrubs premiered with two episodes on ABC Wednesday, with the revived series airing its first episodes since 2010 . The debut episode pulled in 4.41 million viewers and a 0.66 rating in the 18-49 demographic; the latter is the best same-day mark for any network comedy in its regular time period so far this season (i.e., excluding post-NFL premieres for NBC’s The Fall and Rise of Reggie Dinkins and Fox’s Animal Control ). The second episode averaged 3.52 million viewers and a 0.55 rating among adults 18-49. ABC reran the two episodes in the 10 p.m. hour, where they averaged 1.32 million viewers. Following Scrubs , ABC premiered the Nate Bargatze-hosted game show The Greatest Average American . It drew 2.38 million viewers and a 0.27 rating in the 18-49 demo, improving on The Golden Bachelor’ s averages in the same spot last fall. THR"
    },
    {
      "title": "Deep Frieze: The Art Festival’s Greatest Works May Just Be the Outfits",
      "url": "https://www.hollywoodreporter.com/gallery/frieze-la-festival-fashion-photos-1236517772/",
      "date_collected": "2026-02-28 07:16:52",
      "publication_date": "2026-02-27T23:30:19",
      "source": "Hollywood Reporter",
      "full_text": "× Skip to main content By Merle Ginsberg , Laura Tucker February 27, 2026 3:30pm Published on February 27, 2026 Fashion brand Stone Island created these Frieze t shirts as a perennial sponsor of the art fest Thomas Drotar You just didn’t know where to look first at the Frieze festival’s Feb. 26 opening — but it wasn’t always at the artwork on the walls. The event, now in its seventh year, sprawled across a circus-style big-top tented megalopolis at the Santa Monica Airport — a far cry from its 2019 debut on the Paramount lot but every bit as spectacular. With work from 100 galleries representing artists from around the world, hordes of aficionados poured through the space during the opening of the four-day festival. There was, as usual, a heavy celebrity quotient; this year’s included Timothy Olyphant, Emma Watson, Christoph Waltz, WME’s Ari Emanuel and wife Sarah Staudinger (of L.A. fashion brand Staud), Red Hot Chili Peppers’ Anthony Kiedis, Fiona Shaw and Lisa Edelstein, plus artists Doug Aitken, Adam Alessi and Andrea. But the real stars of Frieze aren’t always the bold-faced names — they’re the boldly dressed ones. Among the thousands who turned out for day one, a remarkable number seemed to have treated their outfits as entries in the show itself: an edgy parade of avant-garde eyewear, sculptural footwear and statement headwear competing gamely with the art on the walls. As one attendee put it: “You can see art — or you can be it. I choose to be it.” Steve Wilson Image Credit: Photo Credit: Thomas Drotar The Midwest hotelier and gallerist wore a canary-yellow suit designed by Kentucky artist Bri Bowers. “It’s wearable art,” he says. “Why shouldn’t an art collector like me be a walking world of art.” The red sunglasses, he notes “are my signature.” Lindsay Hawkins Image Credit: Photo Credit: Thomas Drotar The artist-slash-filmmaker donned an avant-garde skirt by London based folklore label Chopova Lowena. “I’m drawn to things that stick out, but are still comfortable,” she says. Aliona Kononova Image Credit: Photo Credit: Thomas Drotar The L.A. designer wore her own work: red bubble dress, separate white silk cape, white round cuffs and a black wood handbag. “These ivory glasses,” she says, “are by London’s Adele Mildred, inspired by Peggy Guggenheim.” Brenna Pierose and Jessica Trent Image Credit: Photo Credit: Thomas Drotar Pierose, a marketing exec, matched her two-piece Alexis dress with vintage Prada loafers. Trent, an art consultant, went with a vintage mismatched look. “I threw it all together based on a picture I recently saw by the late artist Steven Arnold.” RF Jefferies Image Credit: Photo Credit: Thomas Drotar The San Diego based art collector wears only black and only from Demma’s Balenciaga, saying, “I believe greatly in the power of clothes and the ritual of dressing. Life is too short not to surround yourself with beauty.” Kya Lou Image Credit: Photo Credit: Thomas Drotar The filmmaker and artist dons a leather hat by Lou Badger of Mexico City. Stone Island Image Credit: Photo Credit: Thomas Drotar The fashion brand, a perennial sponsor of the festival, created these Frieze tees for this year’s event. THR"
    },
    {
      "title": "‘Love Story’ Episode 5: The Insider’s Recap — “I Assure You, John Was Not a ‘P***y’”",
      "url": "https://www.hollywoodreporter.com/tv/tv-features/love-story-episode-5-the-insiders-recap-1236517905/",
      "date_collected": "2026-02-28 07:16:51",
      "publication_date": "2026-02-27T23:41:43",
      "source": "Hollywood Reporter",
      "full_text": "Skip to main content By Lisa DePaulo Plus Icon Lisa DePaulo View All February 27, 2026 3:41pm Sarah Pidgeon as Carolyn Bessette, Paul Anthony Kelly as John F. Kennedy Jr. in 'Love Story' episode five. FX Logo text Lisa DePaulo was a feature writer for John F. Kennedy Jr.’s magazine George and has shared her opinion of the FX series Love Story for THR . She will be recapping episodes through the end of the season, beginning with episode five, titled “Battery Park,” below. *** So this one’s called “Battery Park,” due to the alleged site of the infamous knock-down ring-pulling fight between John and Carolyn that in real life was most unfortunately captured by a paparazzo in the bushes. So now there is much online consternation over whether it actually did happen in Battery Park or Washington Square Park. Oh, who bloody cares? It happened. (And I can see why Battery Park sounded better to Ryan Murphy . Battery , get it? You’re so subtle, Ryan.) Related Stories TV 'Love Story' Star Sarah Pidgeon on Recreating JFK Jr. and Carolyn Bessette's Infamous Battery Park Fight Guest Column I Knew JFK Jr. I Thought I Would Sob Through 'Love Story.' Instead, I Laughed Out Loud. And did he really pull her ring off? (Yes.) And — this one’s nuts — did the ring really break in half? Break in half? It was Jacqueline Kennedy Onassis’s diamond and sapphire ring (that in a previous episode, John sneakily steals from the stash that his sister is selling at Sotheby’s). It most assuredly did not break in half. And none of this is true anyway. John did not propose to Carolyn with Jackie’s ring. And does anyone really think John Kennedy stole one of his mother’s rings? Are you kidding me? He proposed with a gorgeous and simple band of diamonds and sapphires that he designed himself and was influenced by one of Jackie’s rings, her “swimming ring.” Wait, you don’t have a swimming ring? And now do you see the kind of bullshit John and Carolyn dealt with on a daily basis? The constant dissection of their every move, every detail? I often thank the lord or the lucky stars or whoever it is you thank that John and Carolyn missed (by about a year) social media. Can you imagine ? It was already bad enough. The first day I met John, he had a stack of tabloids on his desk. The National Enquirer was on top. Yes, he read them. And at one point he said, “You know, I’m not really here,” picking up the Enquirer and laughing. “I’m on an island with Daryl Hannah .” That was John. Mercifully, John never brought the real drama into the office. And “Battery Park,” particularly the Battery Park part, made me extremely grateful for that. I know some of my colleagues saw mood changes — and I suppose you could track those to what was on the front page of the New York Post that day — but even that’s a stretch. He was always the consummate professional in the office, while still being John — funny, witty, laidback John. And speaking of the front page of the New York Post, why on earth didn’t they use the real headlines? They were so much better than the dreck they’re coming up with. Most ridiculously, episode four’s “Bum-shell!” With a photo of Carolyn’s ass on a boat. But my biggest beef with this episode, besides the abysmal dialogue (“I want this weekend to be perfect”… what happened to the witty repartee that made the previous episodes tolerable?) is the whimpering, almost-effeminate mess they’ve turned John into. The episode really should have been called “Pussy.” Which, actually, Sarah Pigeon’s Carolyn calls him at one point. Only it’s “fucking pussy.” And that is how John is portrayed throughout. That pisses me off. I can assure you, John was not a pussy. But here they have him, like a big baby, unable to commit to the long grueling hours it takes to put a magazine out (pure fiction). There he is, lip quivering, whining to his sister that he proposed to Carolyn and “she says she has to think about it.” To which Grace Gummer’s Caroline Kennedy says, “I think I might be starting to like her.” OK, that was a good line. Because for the most part, Caroline comes off as a rigid uptight shrew. (She most certainly is not.) And there he is, like a priss, instructing his beloved, “Don’t call her Ethel. Call her Mrs. Kennedy.” And then, like a smacked-ass, obeying Ethel’s orders to say Grace, with the obedience of an altar boy if an altar boy was a puppy. And oh, Ethel!!! It’s probably good that she didn’t live to see this. I prefer the other Ethel, the hot mess who raised a bunch of hoodlums at Hickory Hill, with a zoo of animals in the yard, not to mention the pets. This version sucks. From the moment she enters the dining room for dinner (what’s with Kennedy women doing weird things in dining rooms, Ryan?) and all the guests, which is to say her own kids and nieces and nephews, stand at attention. Apologizing in advance for “the bourbon brioche bread pudding dessert” that the chef “butchered spectacularly.” Then, making everyone at the table express their opinions about Cuba and Vietnam. (OK, I read that that used to happen.) And poor Carolyn — having her pashmina ridiculed at the dinner table (with her pussy boyfriend motioning for her to take it off), being forced to sleep in a separate bed from John (which PB explains away), and in the morning, being declined a cup of coffee, a cup of coffee , because she failed to “sign up” for breakfast. Because…yes, Pussy Boyfriend forgot to tell her. And by the way, what’s with casting Bobby, Jr. as normal ? Has Ryan Murphy become a secret Trumper or something? Once again, Paul Anthony Kelly plays John with a lisp. And once again, John Kennedy did not have a lisp . A barely detectable sibilance maybe, but not a lisp. Though in this episode, it fits. Fortunately, and to Murphy’s credit, there are enough moments when Pussy evolves into Pussy-whipped, which is infinitely more tolerable. And possibly even accurate. Until he assures Pigeon’s Carolyn that, don’t worry, honey, he won’t want to run for president someday. Ha! As if. THR"
    },
    {
      "title": "All of ‘The Beauty’ Cast & Characters: Ashton Kutcher, Evan Peters, Bella Hadid and More in Ryan Murphy’s Body Horror Series",
      "url": "https://www.hollywoodreporter.com/lists/the-beauty-cast-ashton-kutcher-evan-peters-bella-hadid/",
      "date_collected": "2026-02-28 07:16:50",
      "publication_date": "2026-02-28T00:35:04",
      "source": "Hollywood Reporter",
      "full_text": "Skip to main content By Lexi Carson Plus Icon Lexi Carson Associate Editor View All February 27, 2026 4:35pm Published on February 27, 2026 Ashton Kutcher, Evan Peters and Bella Hadid in 'The Beauty.' Phillippe Antonello/FX (3) Logo text [This story contains major spoilers from The Beauty .] “One shot makes you hot,” reads the tagline of The Beauty , FX’s new dark comedy series laced in body horror. In what The Hollywood Reporter ’s chief TV critic Daniel Feinberg calls an “occasionally provocative blend of Nip/Tuck and various American Horror Story iterations,” Ryan Murphy’s The Beauty — written and co-created by Matt Hodgson — centers on a mysterious drug that promises unimaginable physical attractiveness. Also sexually transmissible, “The Beauty” can transform its users into what society deems perfection, though not without the risk of devastating side effects. The show asks: How much are you willing to sacrifice for eternal youth? A star-studded cast joins the ride, including Murphy regulars Evan Peters and Jeremy Pope, alongside first-time Murphy-verse additions like Ashton Kutcher, plus a slate of notable guest stars. First premiering with a three episode launch on Wednesday, Jan. 21 (at 9 p.m. ET on FX), the remaining episodes roll out weekly across the 11-episode season, with two episodes released in each of the final two weeks. Since each episode brings more familiar faces into the show, The Hollywood Reporter is keeping track of all of the stars appearing in The Beauty with explainers on the characters they play. This list originally posted Jan. 21 and will be updated weekly as new characters are revealed. Check back for spoilers! Bella Hadid as Ruby Image Credit: Philippe Antonello/FX Logo text Supermodel Bella Hadid plays a supermodel in the show — but with a twist. She steps off the runway and onto a vicious rampage, before she later explodes and dies. Though best known for modeling, Hadid told THR at the New York City premiere that she hopes to continue acting after the series. “This is a dream of mine,” she said. Evan Peters as Cooper Madsen Image Credit: Eric Liebowitz/FX Logo text Evan Peters is finally playing the good guy. The Ryan Murphy series veteran and Emmy winner plays Cooper Madsen, an FBI agent assigned to investigate Ruby’s (Hadid) incident at a fashion show in Paris. Peters also serves as an executive producer. Rebecca Hall as Jordan Bennett Image Credit: FX Logo text Rebecca Hall plays Cooper’s FBI agent partner Jordan Bennett, as they try to figure out what is happening to the supermodels. The two are also in a situationship. In episode two, Jordan unknowingly contracts “The Beauty” and undergoes a gory transformation, turning into actress Jessica Alexander. Hall told THR she knew her character’s shocking twist from the start. “I was told I was going to be a very deliberate bait and switch, sort of like a Janet Leigh in Psycho situation that there would be all this expectation I would be there for the whole thing and then — whoop — gone!” she said. Jeremy Pope as Jeremy Image Credit: FX Logo text Hollywood star Jeremy Pope returns to the Ryan Murphy–verse to play an insecure man longing to find a new direction. In the first episode, his character transforms into a new version of himself after contracting “The Beauty.” Pope also serves as an executive producer. Chanel Stewart as Claire Image Credit: Theo Wargo/Getty Images Logo text The Barbie actress and Miss Universe Australia winner appears as Claire, who carries “The Beauty” and passes it to Jeremy, leading to his transformation into Pope. Ashton Kutcher as The Corporation Image Credit: Eric Liebowitz/FX Logo text Ashton Kutcher portrays the villain known as The Corporation, who has built a trillion-dollar empire through “The Beauty” super drug. The role also marks his return to acting after three years, as well as his first collaboration with Ryan Murphy. Kutcher told THR he was drawn to the project after having an intriguing conversation with Murphy, who wrote his role in the series with the actor in mind. “He’s one of the greatest writers on the planet,” Kutcher said. Anthony Ramos as The Assassin Image Credit: FX Logo text The In the Heights star plays an assassin with an eye patch hired by The Corporation to protect his trillion-dollar empire. Ramos also executive produces. Isabella Rossellini as Franny Forst Image Credit: Philippe Antonello/FX Logo text Isabella Rossellini takes on the role of Franny Forst, the wife of the man behind Kutcher’s The Corporation, who despises his motives and is the mother of their two sons. The character is likely a nod to Rossellini’s role in the body-horror comedy Death Becomes Her (1992), which also explores vanity, aging and the desire for youth. Jessica Alexander as Jordan (Part 2) Image Credit: Eric Liebowitz/FX Logo text Jessica Alexander takes over the role of Jordan from Rebecca Hall after Hall unknowingly contracts “The Beauty” and transforms into the actress. Amelia Gray Hamlin as Harper Image Credit: Gilbert Flores/2026GG/Penske Media/Getty Images Logo text Model Amelia Gray Hamlin is making her acting debut in the FX series. Her character, Harper, enters the Condé Nast office with a fever after taking “The Beauty” and reacts similarly to Ruby (Hadid), going on a violent spree and attacking her colleagues — killing Brittany (Meghan Trainor). Harper ultimately explodes and dies. Meghan Trainor as Brittany Image Credit: Gilbert Flores/Variety/Getty Images Logo text Also making her acting debut is “All About That Bass” singer as Brittany, who is killed when Harper (Hamlin) hurls her out of a Condé Nast cafeteria window amid an explosive outburst. Ben Platt as Manny Image Credit: Eric Liebowitz/FX Logo text The Dear Evan Hansen star and Tony winner appears as Vogue staffer Manny, who’s having lunch in the Condé Nast cafeteria with Brittany (Trainor) when their colleague Harper (Hamlin) explodes — exposing them to “The Beauty.” In episode four, Platt has a fight sequence with Cooper (Peters) and transforms into a model played by Isaac Powell. Isaac Powell as Manny (Part 2) Image Credit: Emma McIntyre/Getty Images Logo text Isaac Powell portrays Manny after he transforms in episode four, “Beautiful Chimp Face,” from being infected by “The Beauty.” John Carroll Lynch as Meyer Image Credit: Theo Wargo/Getty Images Logo text John Carroll Lynch plays FBI chief and boss of agents Cooper and Jordan, Meyer. Rob Yang as Ray Image Credit: Eric Liebowitz/FX Logo text Rob Yang plays Ray, the scientist behind the superdrug, who is also responsible for introducing it to Kutcher’s character. Vincent D’Onofrio as Byron Forst Image Credit: FX Logo text Episode five revealed that Kutcher’s “The Corporation” is actually Byron Forst, a billionaire played by Vincent D’Onofrio, who only transforms into Kutcher after taking “The Beauty.” Peter Gallagher as Axel Zufo Image Credit: Jamie McCarthy/Getty Images Logo text The O.C. star portrays a fossil fuels billionaire, Axel Zufo, who ends up taking “The Beauty” with Byron and a group of billionaires. Billy Eichner as Waylen Lemming Image Credit: Dimitrios Kambouris/Getty Images Logo text The Billy on the Street host plays Waylen Lemming, a crypto billionaire who takes the superdrug. Julie Halston as Kitty Munson Image Credit: John Nacion/Variety via Getty Images Logo text Sex and the City actress Julie Halston appears as another billionaire, Kitty Munson, in episode five, who transforms from taking the superdrug and is then killed by Byron. David Pittu as Ronan Wylde Image Credit: Jason Mendez/Getty Images Logo text David Pittu plays banking billionaire Ronan Wylde, who also takes “The Beauty” and is murdered among the rest of the billionaires by Bryon. Eddie Kaye Thomas as Mike Image Credit: Kristina Bumphrey/Variety via Getty Images Logo text The American Pie star plays Mike, a timid lab worker at Byron’s corporate headquarters in episode six, “Beautiful Patient Zero,” who works closely with Rev Yolanda’s Clara (listed below). Mike transforms from taking “The Beauty” at the end of the episode. Joey Pollari as Mike (Part 2) Image Credit: Santiago Felipe/Getty Images Logo text Monster alum Joey Pollari plays Mike after his transformation from taking “The Beauty.” Rev Yolanda as Clara Image Credit: FX Logo text Clara (Rev Yolanda) is a trans woman who works at Byron’s headquarters and ends up taking “The Beauty” after confiding in co-worker Mike about how frustrating it is for her that her outside isn’t matching her inside and she’s been taking hormones. Lux Pascal as Clara (Part 2) Image Credit: FX Logo text Actress and sister of Pedro Pascal, Lux Pascal, portrays Clara post “The Beauty.” Lux is a proud member of the LGBTQIA+ community and came out as a trans woman in 2021. Kelli O’Hara as Juliana Williams Image Credit: Eric Liebowitz/FX Logo text Tony winner and The Gilded Age actress appears in episode seven, “Beautiful Living Rooms” as Juliana Williams, a former editor for Elle magazine and wife to FBI Agent, Meyer (John Carroll Lynch), who are convinced to take “The Beauty” when Byron shows up at their home. THR"
    },
    {
      "title": "Singer Erin LeCount on ‘Pareidolia,’ Giving Teens A Space to be “Hysterical” and Those ‘Heated Rivalry’ Edits",
      "url": "https://www.hollywoodreporter.com/music/music-features/erin-lecount-next-big-thing-interview-1236517805/",
      "date_collected": "2026-02-28 07:16:49",
      "publication_date": "2026-02-28T01:10:05",
      "source": "Hollywood Reporter",
      "full_text": "× Skip to main content Erin LeCount Photograph by Furmaan Ahmed Rising pop singer Erin LeCount says she’s always expressed herself best through music . The British performer — who released her latest EP Pareidolia Feb. 27 — says she fell in love with music at a young age thanks to a teacher who sparked her interest. She was eventually scouted for The Voice Kids in the U.K., finishing as a runner-up in season 1 after making it to the finale. “I had no idea what I was doing,” she tells The Hollywood Reporter on a Zoom, recalling the imposter syndrome she felt going into the program with no formal training. By 17, she found musical production and “totally fell in love.” Related Stories Movies How Anderson .Paak Turned His Son's K-Pop Obsession Into a Movie -- and a Crash Course in Filmmaking Movies Director Alexandre Trudeau Wades Into Berlin Fest's Artistic Freedom Debate: \"There's Politics Everywhere\" Now, at 23, LeCount is finding her stride, having just wrapped her first U.S. tour. She showed off a commanding stage presence during a pair of Valentine’s Day weekend shows at the Roxy in West Hollywood. Dressed in etherial white to match her long white blond hair, she directs the audience to belt out a note so she can record it. LeCount — who produces all of her music onstage — makes that note the beat for her next song. Pareidolia , her latest release, is the singer’s exploration of a downward spiral. The word itself, she points out, means finding patterns in places there aren’t — it’s a theme that runs throughout the album. Below, LeCount breaks down Pareidolia , shares on the “beautiful” connection between her song “Silver Spoon” and Heated Rivalry , and her passion for giving young women a space to hysterical. The production element seems important to you. Why has it been so important to you that you produce your own music? There’s so much misogyny that exists around female artists, and then a whole added layer of that when it comes to female artists who want ownership over their work or production. For me, it came because when I was working with other people, I was just so incredibly insecure and had so much imposter syndrome. I didn’t know how to not freeze up in a room with other people. I started doing sessions when I was about 17. You’re in rooms with people, all male, a lot older than you, and that… Everyone was lovely and everyone was kind, and I didn’t have any bad experiences, but it wasn’t something I felt able to open up in. I really felt this need to understand what was happening, and the idea of someone else being at the driving seat of my music and not understanding what was happening, I couldn’t get my head around that. I just tried to learn the language of production and the basics to communicate what I wanted. It ended up being that once I was in that rabbit hole, I fell in love with it. My brain latches onto the process of production so well. I lose hours to it, and it’s just something inherent to the music now. I’m so open to collaboration, and I’ve become more comfortable with that, but I get to what I want to say better and more truthfully when it’s just me in the beginning. There’s no room to be swayed by any external influences or impressions. Erin LeCount performs onstage during a concert on Dec. 5, 2025 in London, England. Lorne Thomson/Redferns Have you always been someone who feels they’re more able to express themselves better through music? Writing is where I figure out everything about myself that I need to be self-aware of. It’s so telling and a lot of the time making music is… When you’re in this flow state, especially being at computer and production, that’s where I hit into it. When my brain is switching between this flow between writing the song and being at the computer and your hands moving. You often reveal things to yourself that you were not aware of before that moment, and that is how I work through everything in my life. For better or worse, that comes out really honestly in the music, and I do struggle to filter that. It’s just coming from this subconscious place, and then all of a sudden it’s on paper or it’s recorded on a screen. When I play it back, it’s almost like having, I don’t know, your therapy notes read to you or something. It’s like an untangling of thoughts. It’s all incredibly personal, but I don’t really know how else to write. It’s been a communication to other people, but it’s also been a method of understanding myself and how my mind works. I’m pretty on the go all the time. I don’t stop to think about things until I sit down, and I’m at the computer and that’s the only quiet reflection time I have. As a writer in a different way, I can understand that. It’s all the same. It really is all the same. I [had always] wanted to be a writer, whether that was novels or journalism. That’s where the biggest revelations come about. Can you tell me more about some of your recent songs? Let’s start with “I Believe.” “I Believe” is the first track on this EP. It was a song when I felt really existential about what purpose is and the meaning that I apply to things. I write a lot about God for someone who’s not sure what they believe in, it’s a really ongoing theme. I have noticed that. I just keep writing as a method of untangling and that’s just a very long string to pull. It never ends. “I Believe” was questioning my identity and who I am, and how I compartmentalize all these pieces of myself and really wanting to believe in something bigger. A plan to feel that comfort. This cynicism about the whole thing. It was just a big question mark really. I think that was the perfect opening because it just opens up this entire conversation of what is my purpose? I’m going to go out and look for it. Erin LeCount attends world premiere Of ‘Wuthering Heights.’ Unique Nicole/FilmMagic What about “Don’t You See Me Trying?” [It’s the] second song of the EP; they flow directly into each other because “Don’t You See Me Trying” is about feeling out of control in your life and reverting back to old habits and self-destructive patterns because it’s the only thing you do feel you have control over. I think there’s a real theme of questioning yourself and feeling small in the grand scheme of things. Just clutching at straws to try and control what you can. The movement from “I Believe” — and [questioning] what my purpose is — and “Don’t You See Me Trying” being [about], “I don’t have one and I’m losing my mind about it, and I’m going to find a drive even if that’s a really poisonous, scary, self-destructive thing.” What does this album mean to you? It sounds like you’re working through a lot of existential things, which is quite relatable to anyone who’s been 23. I knew that I wanted to make an EP about all these different stages of a downward spiral, sort of a relapse or regression of some sort. There’s slow progression of losing your perspective and beginning to see lies in yourself through a really distorted lens. [The] pushing and pulling with that. It’s something I’ve lived really vicariously through. Making this EP was like acting out all those self-destructive tendencies through the music rather than engaging with them personally. I’ve been down and lived the sequence of events in the EP so many times, and I think I just wanted to make something productive from it. Something that felt cathartic and something that had all that impulse and that, sort of, recklessness. Pareidolia, the word, is about a tendency to perceive meaningful patterns between things that aren’t related, like shapes and clouds or a face in the moon. It was just the perfect word to sum up what our brains do when we don’t understand something or feel out of control of something or can’t perceive things correctly. We just go back to the patterns that we know and we try and make them fit and try; associate them with something new. One track that really stuck out to me was “Alice.” I thought that was a really interesting take. In a not crass way, no matter what your vice of choice is, someone who enables that behavior, even just by being there, is a really relatable idea. “Alice” is the last track on the EP because it is a bit of a gut punch, even for me to sing live. I didn’t realize how much it was until it came to touring. It’s about a person; it’s also about yourself, it’s about myself. Sometimes there’s a relationship that brings up all the things about yourself that you don’t like, and you see them reflected in another person right back at you. When you struggle with the same thing, there’s this intense bond that happens that feels like nobody else in the world could possibly understand. Sometimes that is the worst person for you to be around. That’s incredibly difficult. When I wrote that song, that feeling — of you two being the only people in the world who deal with it — sticks with you for a very long time. Furmaan Ahmed How did the song help you work through things? Writing that song took a really long time because it was hard to get an accurate and fair portrayal of both the people in that scenario. You’re navigating your relationship to each other, but you’re also navigating the relationship you have to your vices and yourself. For that all to be reflected in one person, for one person to bring that all out in you, is an incredibly scary and confronting experience. For a long time, it was a version of the song that blamed her entirely, and then it was a version that blamed me entirely. Then it was all about me and nothing about her. Other times it was too focused on the love between us and not enough on the vices that we both had that got in the way. It was a really complex song to navigate, but it’s a complex scenario to navigate. It’s far more universal than people think it is. Social media has obviously played a large part in helping you find a community. Your song “Silver Spoon” had this second wind because Heated Rivalry fans were making edits to it. It came so out of the blue. You make a song, and you selfishly think “this is so specific to me and only applicable to me.” It was the first time that instantly that was revealed to me as not true, and that it was universal in people’s lives and shows and films that people really resonated with and saw themselves in. It was really beautiful for me because I found so much of the music that I loved in the age of Tumblr to fandom edits of different shows and movies that I loved. Those edits, they take time, and they’re incredibly valuable. There are fandoms that are the reason that people found my song and found communities around it. It then led people to retrospectively go back on my work and other things I’d shared, and come forward with me and listen to the music that was coming after that. To see yourself reflected in music, to see your situation represented in shows is so important and incredibly comforting. @erinlecount i’d like to know i’m very fascinated and curious. i like ur edits very much ! very lovely. saw that nice girl crying about it. thanks 4 the kindness on silver spoon a whole year later, it’s a christmas song at heart #newmusic #femaleproducer #heatedrivalry #singersongwriter ♬ Silver Spoon – Erin LeCount When I was at your show, I was behind a group of passionate teen fans. It reminded me why I love music. What’s it like to see that for you? It’s so incredibly rewarding. Nobody rides harder or feels more intensely about things than teens or people in their mid-20s. That’s really the demographic that have been showing up for me at shows and across the board. I’ve met some of the most passionate, creative people who just make worlds of their own with the songs and what I give them. They just expand on it, creatively and within their own communities and building friendships around it. I just think there’s not enough spaces where young women and teens are encouraged to be that hysterical in the best way. When you have all that built up emotion and all these shared experiences, to be at a show and to be facilitating a space where people are able to feel that amongst each other and with their friends and release that is so important because I think “where else does it go if it doesn’t go here?” I was always incredibly cynical about showing love or passion or the hysteria that fan girls get mocked for sometimes. I wish I’d had a space like that, and I wish I’d opened myself up to that community of people who feel similarly to me. I see myself in when I was younger. It would’ve probably saved me a lot of feelings of loneliness, which is a lot of what I sing about. I could talk your ear off about teen girls making people’s careers and getting no respect for being tastemakers in music. They are the tastemakers, the dictators. They are pop culture, and they are what all these labels and businesses thrive off. What a lot of people profit off. They should be rewarded and respected and shown love and appreciation in return for that. THR"
    },
    {
      "title": "Longtime CBS News Producer Cites Claims of Aiming Reporting Towards “Particular Part of the Political Spectrum” in Exit Memo",
      "url": "https://www.hollywoodreporter.com/tv/tv-news/cbs-news-producer-political-reporting-paramount-warner-bros-1236518091/",
      "date_collected": "2026-02-28 07:16:48",
      "publication_date": "2026-02-28T02:56:07",
      "source": "Hollywood Reporter",
      "full_text": "× Skip to main content By McKinley Franklin Plus Icon McKinley Franklin View All February 27, 2026 6:56pm CBS News signage in Manhattan. Spencer Platt/Getty Images Mary Walsh, a veteran CBS News producer of over four decades, is exiting the company, claiming in an exit memo to staffers that instructions to “aim our reporting at a particular part of the political spectrum” are partly why she’s departing. “We’ve been reading a lot of goodbyes lately and here I am headed out the door. It’s too soon, even after 46 years,” Mary Walsh wrote in a memo sent Friday, per The Guardian . “But maybe it’s for the best. We’ve been told to aim our reporting at a particular part of the political spectrum. Honestly, I don’t know how to do that.” Related Stories Business What Sparked Paramount's Investigation of Jeff Shell Business It's a Deal: Paramount and Warner Bros. Discovery Unveil $111 Billion Megamerger The Guardian further reported that CBS Evening News executive editor Kim Harvey sent a separate message to staff in response to Walsh’s memo. “We wish Mary Walsh well and thank her for many years of service,” Harvey wrote, according to the outlet. “Mary wrote in her farewell note, ‘We’ve been told to aim our reporting at a particular part of the political spectrum.’ That is simply not true. Here at the Evening News , we value our editorial independence, and CBS News leadership has never asked us to aim our reporting in any political direction.” Walsh joined CBS News in September 1982, per her LinkedIn . Her departure arrives one day after Netflix backed out of the bidding war for Warner Bros. Discovery, that was ultimately won by Paramount . The latter company is led by David Ellison, and has been going through changes with Bari Weiss as CBS News’ editor-in-chief. Several CBS Evening News production staffers have taken buyouts , as the program shifts with Tony Dokoupil at the forefront. As The Hollywood Reporter previously reported on Feb. 12, 11 staffers took the buyout offer, including producer Alicia Hastey , who wrote in a departing note that she was “proud of the work that’s been done in my time here.” However, she added that “there has been a sweeping new vision prioritizing a break from traditional broadcast norms to embrace what has been described as ‘heterodox’ journalism.” “The truth is that commitment to those people [in the stories Hastey cited] and the stories they have to tell is increasingly becoming impossible,” Hastey continued. “Stories may instead be evaluated not just on their journalistic merit but on whether they conform to a shifting set of ideological expectations — a dynamic that pressures producers and reporters to self-censor or avoid challenging narratives that might trigger backlash or unfavorable headlines.” THR"
    },
    {
      "title": "ACE Eddie Awards for Editing: ‘One Battle After Another,’ ‘Sinners’ Win Top Prizes",
      "url": "https://www.hollywoodreporter.com/movies/movie-news/2026-ace-eddie-awards-winners-list-one-battle-sinners-1236517103/",
      "date_collected": "2026-02-28 07:16:47",
      "publication_date": "2026-02-28T04:45:28",
      "source": "Hollywood Reporter",
      "full_text": "× Skip to main content By David Canfield Plus Icon David Canfield Senior Entertainment Writer View All February 27, 2026 8:45pm Leonardo DiCaprio and Benicio Del Toro in 'One Battle After Another.' Courtesy Warner Bros. Pictures A slew of top Oscar contenders won ACE Eddie Awards for the best in editing on Friday night, affirming their positioning as top Oscar contenders as final Academy voting has just gotten underway. When it came to top best-picture candidates One Battle After Another and Sinners , at least, the American Cinema Editors guild did not have to decide, with One Battle ’s Andy Jurgensen and Sinners ’ Michael P. Shawver, respectively, winning the theatrical comedy and theatrical drama categories. The Oscars only have one editing category, of course, and both ACE Eddie winners are nominated there alongside Sentimental Value , Marty Supreme and F1 — all of which were nominated for ACE Eddies between their two main theatrical categories. Related Stories Guest Column I Have Tourette Syndrome and I Have the N-Word Thrown at Me. I Have Thoughts on BAFTA. Movies Delroy Lindo Reveals the Convo He Had With Ryan Coogler About 'Black Panther 3' Netflix dominated the rest of the feature-film lineup, with KPop Demon Hunters ’ Nathan Schauf winning for animation and The Perfect Neighbor ’s Viridiana Lieberman taking home the documentary award. Both movies continue to cruise to Oscar night, where they’re heavily favored to win — though The Perfect Neighbor ’s biggest competition, BAFTA doc winner Mr. Nobody Against Putin , was not nominated here. Moving to TV, Mark Strand of awards juggernaut The Pitt won in drama, overtaking Andor , which actually won the equivalent Emmy back in the fall. The Studio stayed strong in comedy, with Eric Kissack winning the ACE Eddie for the series premiere “The Promotion,” just as he did at the Emmys. The limited series race was of particular interest, since the single-take-driven Adolescence wasn’t nominated here (just as it wasn’t in the Emmys’ editing race). While The Penguin had three of the five Emmy-nominated episodes, it lost with the Television Academy to Monsters: The Lyle and Erik Menendez Story , likely a result of vote-splitting. Here, ACE nominated only Henk van Eeghen for the series finale, and he has managed to win. It’s oddly late recognition of the drama, which aired way back in 2024 — in fact, despite its single season, this is the second straight year of ACE Eddie noms for the show because the finale fit within an extended eligibility period. Taking place at UCLA’s Royce Hall, the ACE Eddie Awards were hosted by Asif Ali and featured several special award presentations: The ACE Golden Eddie Filmmaker of the Year Award went to Ang Lee; YouTube’s Kim Larson received the ACE Visionary Award; and Arthur Forney and Robert Leighton won ACE Career Achievement awards. See below for the full list of winners. EDITED FEATURE FILM (Drama, Theatrical): Sinners Michael P. Shawver BEST EDITED FEATURE FILM (Comedy, Theatrical): One Battle After Another Andy Jurgensen BEST EDITED ANIMATED FEATURE FILM: KPop Demon Hunters Nathan Schauf BEST EDITED DOCUMENTARY FEATURE: The Perfect Neighbor Viridiana Lieberman BEST EDITED DOCUMENTARY SERIES Pee-wee as Himself – Part One Damian Rodriguez BEST EDITED MULTI-CAMERA COMEDY SERIES: Frasier (Murder Most Finch) Russell Griffin, ACE BEST EDITED SINGLE CAMERA COMEDY SERIES: The Studio (The Promotion) Eric Kissack, ACE BEST EDITED DRAMA SERIES: The Pitt (6 p.m.) Mark Strand, ACE BEST EDITED FEATURE FILM (NON-THEATRICAL): A Winter’s Song Yvette M. Amirian, ACE BEST EDITED LIMITED SERIES: The Penguin (A Great or Little Thing) Henk van Eeghen, ACE BEST EDITED REALITY SERIES: Conan O’Brien Must Go (Austria) Matthew Shaw, ACE Brad Roelandt BEST EDITED VARIETY TALK/SKETCH SHOW OR SPECIAL: Saturday Night Live 50th Anniversary Special Paul Del Gesso Christopher Salerno Ryan Spears Sean Mcilraith, ACE Ryan Mcilraith Daniel Garcia BEST EDITED ANIMATED SERIES: South Park , “Twisted Christian” David List Nate Pellettieri BEST EDITED SHORT: All The Empty Rooms Erin Casper, ACE Stephen Maing Jeremy Medoff ANNE V. COATES AWARD FOR STUDENT EDITING: Luis Barragan – California State University, Fullerton THR"
    },
    {
      "title": "Bong Joon Ho, David Fincher and More Join Academy Museum’s Spring Programming Slate – Film News in Brief",
      "url": "https://variety.com/2026/film/news/film-news-in-brief-feb-23-2026-1236670209/",
      "date_collected": "2026-02-28 07:16:46",
      "publication_date": "2026-02-27T22:17:21",
      "source": "Variety",
      "full_text": "Feb 27, 2026 2:17pm PT Bong Joon Ho, David Fincher and More Join Academy Museum’s Spring Programming Slate – Film News in Brief By Jazz Tangcay , Kennedy French , Arushi Jacob , Payton Turkeltaub The Academy Museum of Motion Pictures has announced its 2026 spring programs, which will include special guests like Jessica Alba, Steve Anker, Dion Beebe, Bong Joon Ho and more. The slate includes film series, public programs and education programs. Programming includes a weekend with Ho featuring director David Fincher, a screening of “Gentlemen Prefer Blondes” to mark the opening of the “Marilyn Monroe: Hollywood Icon exhibition” and the annual Careers in Film Summit featuring Academy members and industry professionals, amongst many other events. Related Stories 'Pretty Little Liars' Cast Teams Up for INAD PSA Ahead of Rare Disease Day Ben Burtt, Ashley Clark, Janie Gieser, Beth Kean, Ken Kwapis, Shane Mahan, Hannah Minghella, Max Minghella, Mandy Moore, Isis Mussenden, Dennis Muren, Ngozi Onwurah, Gerald Quist, Nia Vardalos, Billy Dee Williams and more will also join. Popular on Variety “We are thrilled to offer visitors an exciting lineup of programming this spring that celebrates the history of film while championing future filmmakers,” said Director and President of the Academy Museum and Academy Collection Amy Homma in a statement. “From unique screenings accompanied by conversations with some of the most prolific filmmakers, to family-friendly workshops, and exciting new exhibitions, there is truly something for everyone to enjoy.” Tickets for film screenings and public programs are sold separately. All tickets are available through advance online reservations via the Academy Museum’s website . Friday, February 27 Felicia Pride’s Honey Chile Entertainment Acquires Film & TV Rights to “The Greene Sisters” Trilogy Award-winning filmmaker and TV writer Felicia Pride (“Bel-Air,” Netflix’s “A Different World” sequel) will develop Kristina Forest’s trilogy of romantic novels (“The Neighbor Favor,” “The Partner Plot” and “The Love Lyric”) through her independent media and production company Honey Chile Entertainment. “I’ve been a fan of Felicia Pride’s work for years, and we share the same mission of creating life-affirming art featuring Black women,” said Forest in a statement. “ I’m so thrilled that Honey Chile has optioned ‘The Greene Sisters’ series and I’m excited for all that’s to come.” The “Greene Sisters” series centers on three accomplished sisters navigating career, family and modern love. “While each novel functions as a standalone,” a press release explains, “the trilogy collectively builds a cohesive portrait of contemporary Black sisterhood and romance.” Pride will write and produce the first film and serve as producer on the remaining two movies. “At Honey Chile, we’ve always centered the audience and the power of Black storytelling,” added Pride. “Kristina is such a smart writer whose work completely draws you into her worlds. Her ‘Greene Sisters’ trilogy captures romance, ambition, and partnership in ways that feel aspirational and deeply familiar.” The acquisition marks a major expansion of Honey Chile’s premium film and television slate, underscoring the company’s mission to develop and produce stories by, for and about Black women over 40. “As we mark five years in operation, our commitment to telling layered, culturally resonant stories, the kind born in our living rooms, hair salons, and girls’ trips — has never been stronger,” Price added. “We’re excited for this next chapter.” Pride is represented by Dianne Fraser at Industry Entertainment, UTA and attorney Marcie Cleary of Frankfurt Kurnit Klein & Selz. Thursday, February 26 North American Rights to Crime Thriller “Once a Week for Life” Acquired by Stonecutter Media Stonecutter Media has acquired North American distribution rights to the crime thriller “Once a Week for Life.” The film is produced by Fiat Lux Studios in association with BrandCinema, and is set to premiere on March 19 in New York City. Following the premiere, “Once a Week for Life” will be available in select theaters before expanding to digital and cable platforms throughout the United States and Canada, starting April 14. “Once a Week for Life” follows NYPD Lieutenant Adam Galanis, a Navy SEAL veteran battling PTSD and addiction while leading the NYPD–U.S. Marshals Fugitive Task Force. When a botched fugitive sting sparks a violent collision between the Castellazzo crime family and powerful figures inside City Hall, Galanis is forced into an impossible choice: die by his own uncompromising code or survive by becoming something worse. John Kapelos (“The Shape of Water”) and Diana Durango (“Escape at Dannemora”) lead the film’s ensemble cast, joined by Daniel Roebuck (“The Fugitive”), Dikran Tulaine (“The Blacklist”), Armen Garo (“The Departed”), Robert Funaro (“The Sopranos”), Al Sapienza (“The Sopranos”), John Fiore (“CODA”), and Owen Burke (“The Town”). “Once a Week for Life” is set in New York and was written and directed by George Zouvelos, who also stars in and produces the film, alongside Nicholas Levis. * Slamdance Announces Sparky Award Winners Slamdance Film Festival’s annual Sparky Awards in audience and jury categories were handed out to emerging filmmakers from around the world during the awards ceremony on Feb. 25 at the Egyptian Theater in Los Angeles. “Speedy!” filmmaker Jiin Oh received the AGBO Fellowship, created by Slamdance alumni Joe and Anthony Russo, while Aaron Hughes’ “Cat & Nat” took home the Summer Chastant Episodic Award. The 2026 lineup consisted of 141 films, 50 of them being world premieres. Auteurs and industry professionals voted to determine the festival’s jury awards across ten categories. The narrative feature grand jury prize was awarded to Yuqing Lai’s “Whisperings Of The Moon,” while the breakouts feature prize went to David Maler;s “Zumeca,” and the documentary feature prize to “Silver,” directed by Natalia Koniarz. J. Snow’s “You Look Fine” won the Unstoppable feature category, while Shane Hillier’s “Everhand” won the Unstoppable short film prize. Additionally, the 2024 Episodes prize was awarded to “Vicky Wakes Up,” directed by Victoria Blade; the 2024 Narrative Shorts prize was won by “Beaks,” directed by Xavier Demoulin, and the documentary short prize was awarded to “Panther Pat,” directed by Ashley Brandon. Suse Itzel’s “I Would Have Liked To Make A Different Film” won the experimental short category, and “Busy Bodies” directed by Kate Renshaw-Lewis, took home the animated shorts prize. The 99 Special Jury Prize was awarded to “Dead Grandma,” directed by Rachel Kempf and Nick Toti. The George Starks Spirit of Slamdance award went to Jalen Wilson-Nelen for” Puke Bitch.” The festival’s outstanding acting award, which is curated by the Slamdance team, went to Angela Canó for “Zumeca.” The 2025 audience awards — which are voted on by Slamdance attendees — went to “Three Colors: Pan-African,” directed by Elijah Davis, Allison A. Waite, and Tyler Ocasio Holmes (narrative feature); “Kings of Venice,” directed by Sveinn Ingimundarson and S.D. Saltarelli (documentary feature); and “You Look Fine,” directed by Snow (Unstoppable). This year’s Slamdance lineup consisted of titles from more than 50 countries, including Australia, Brazil, the Democratic Republic of Congo, Iceland, Iran, Palestine, Spain, Sudan, and Vietnam, among others. * Tickets on Sale Now for BTS’ ‘Arirang’ In-Theater Concerts Tickets are now on sale for live viewings of BTS’ “Arirang” world tour, which will allow fans around the world to experience the spectacle in cinemas. The full-length cinema broadcasts of the two shows — Goyang and Japan — will take place on April 11 and April 18, respectively. The “Arirang” world tour marks the group’s (which includes RM, Jin, SUGA, j-hope, Jimin, V, and Jung Kook) return to the global stage in their first shows since 2022, when the group toured “Permission To Dance On Stage.” The “Arirang” tour spans 34 cities worldwide and 82 shows, and accompanies their fifth full-length album. Screenings, which will showcase the tour’s 360-degree in-the-round stage design, are set to take place in more than 3,800 locations across more than 80 locations. Further live viewings are planned for later in the year. More details will be announced at a later date. Watch the event trailer here: Wednesday, February 25 Taurus World Stunt Academy handed out honors for the 25th annual Taurus World Stunt Awards on Saturday during a live ceremony at the Wilshire Ebell Theatre, celebrating the film industry’s top stunt professionals and action filmmaking achievements. This year’s awards recognized stunt work across major studio releases and streaming originals, with nominated films representing Walt Disney Company, Warner Bros., Amazon MGM Studios, Lionsgate, Paramount, Apple TV+ and Netflix. Titles in contention included “Thunderbolts,” “Superman,” “A Working Man,” “Shadow Force,” “The Naked Gun,” “The Gorge” and “Havoc.” The ceremony opened with a headline-making moment as nominee and Red Bull athlete Jon Devore parachuted from a helicopter to deliver the Taurus Award statue to the red carpet, officially kicking off the show. In addition to eight competitive categories — including hardest hit, best fight, best work with a vehicle, best specialty stunt and best stunt coordination/second unit direction — the Academy introduced the first-ever ICON Award, presented to Arnold Schwarzenegger. The inaugural honor recognizes Schwarzenegger’s lasting influence on the modern action hero and his impact on generations of stunt performers. His onstage appearance was met with a standing ovation from the stunt community. 2026 Taurus World Stunt Awards Winners Best Fight : “Forbidden City” (Yunlong Ban, Yaxi Liu, Anthony Pho, Thitsady Voravong, Haoqi Yang) Best High Work : “Jurassic World: Rebirth” (Eduardo Gago Munoz) Best Stunt Rigging : “Final Destination: Bloodlines” (Dustin Brooks, Dar Hicks, Brent Lister, Dillion Maberly, Jason Reynolds) Best Work with a Vehicle : “Back in Action” (Amanda Bradley, Jef Groff, Kevin Waterman) Best Specialty Stunt : “Ballerina” (Seregi András, Jayson Dumenigo, Róbert Kovalik, Ivan Orsanyi, Gyula Toth) Best Overall Stunt by a Stunt Woman : “Eenie Meanie” (Crystal Hooks) Hardest Hit : “The Accountant 2” (Paul Whitecotton) Best Stunt Coordination and/or Second Unit Direction : “Back in Action” (JJ Perry, Troy Robinson, Travis Wong) Lifetime Achievement Award : Debbie Evans Winners are selected exclusively by the Academy’s nearly 3,000 members, making the Taurus Awards the only film honors voted on entirely by working and retired stunt professionals. The event remains the industry’s sole awards show dedicated exclusively to stunt performers and second unit artists. The Taurus World Stunt Awards benefit the Taurus World Stunt Awards Foundation, established through an endowment inspired by the late Red Bull founder Dietrich Mateschitz, to provide financial assistance to stunt performers who suffer debilitating, stunt-related injuries. The Taurus World Stunt Awards first aired on U.S. television in 2001 and continue to spotlight the behind-the-scenes athletes whose work defines action cinema. ‘Stranger Things’ Creators Defend Will’s Coming Out Scene and Confront Toxic Fan Review Bombing: ‘The Ultimate F— You to Vecna’ Sadie Sink on Eleven’s Fate in ‘Stranger Things’ Finale: ‘I Think She’s Dead’ ‘Stranger Things’ Documentary Sets Netflix Release Date; Trailer Takes Fans Inside the Making of the Final Season and Last Day on Set ‘Stranger Things’ Star Jennifer Marshall Says She Was Surprised Not to Be Asked Back for Season 5, Notes It Came After Cancer Diagnosis Prince’s ‘When Doves Cry’ and ‘Purple Rain’ Spotify Streams More Than Double in ‘Stranger Things’ Series Finale Surge ‘Stranger Things’ Play Breaks Broadway House Record With $2.5 Million Over Christmas Loading comments... More From Our Brands Rolling Stone Michael Jackson Estate Sued for Child Trafficking by Siblings Alleging More Than Decade of Abuse Robb Report Demi Lovato’s Former Villa Above the Sunset Strip Lists for $11 Million Sportico Miami of Ohio’s Perfect Hoops Run Sets Table for New $281M Arena"
    },
    {
      "title": "‘David Ellison Scares the S— Out of Me’: How Paramount Beat Out Netflix, Won Warner Bros. and Will Change Hollywood Forever",
      "url": "https://variety.com/2026/film/news/paramount-warner-bros-deal-explained-netflix-ellison-1236674841/",
      "date_collected": "2026-02-28 07:16:44",
      "publication_date": "2026-02-27T22:29:06",
      "source": "Variety",
      "full_text": "Brian Stuaffer Ted Sarandos had just wrapped up a White House meeting with Attorney General Pam Bondi on Thursday when Warner Bros. Discovery released a statement announcing that Paramount’s latest bid for the media company was a “superior proposal” to the one that Netflix had offered. With his deal to buy the 100-year-old film and television giant hanging in the balance, Sarandos quickly consulted with a key team of executives, which included CFO Spencer Neumann and his co-CEO Greg Peters, who had been overseeing Netflix’s bid for Warners, sources say. Related Stories 'Pretty Little Liars' Cast Teams Up for INAD PSA Ahead of Rare Disease Day Under the terms of its agreement to buy Warner Bros. Discovery, Netflix had four business days to equal or surpass a better offer. But the numbers didn’t lie. Paramount was now willing to pay $31 per share to buy all of Warner Bros. Discovery, including its struggling cable business. Netflix, which only wanted Warners’ studio and streaming business, did not want to dramatically enhance its bid of $27.75 per share. Sarandos didn’t see the point of dragging things out. Popular on Variety “If you know you’re not going to match an offer on day one, why wait until day four?” a source with knowledge of the deliberations said. Sarandos placed a call to David Zaslav , Warner Bros. Discovery’s CEO, to let him know the streamer was walking away from a pact that would have given Netflix control of a library that included everything from Harry Potter to Batman and Tony Soprano. Then Sarandos and Peters released a joint statement in which they said, “We’ve always been disciplined, and at the price required to match Paramount Skydance’s latest offer, the deal is no longer financially attractive.” “This transaction was always a ‘nice to have’ at the right price, not a ‘must have’ at any price,” they added. An internal email was sent out to Netflix staffers that hit similar notes; namely that the streamer didn’t want to overextend itself and would concentrate on growing organically rather than by acquisitions, as it has done for most of its nearly 30-year history. However, the brave face put on by the co-CEOs could not shade the truth that the company had been gearing up for what was likely to be a transformational acquisition — and then suddenly, it wasn’t. “This deal could have accelerated Netflix’s growth on top of a strong existing trajectory by attracting new subscribers, reducing churn and driving more engagement,” wrote Robert Fishman, media analyst with MoffettNathanson Research. In December, Warner Bros. Discovery CEO David Zaslav hosted Netflix co-CEOs Ted Sarandos and Greg Peters on the Warner Bros. Studio lot to meet with leaders across the company. Joe Pugliese and John Nowak for Warner Bros. Discovery Netflix was wholeheartedly preparing for a regulatory fight to close the deal at the moment earlier this month that it agreed to WBD’s unusual request for a waiver from the merger agreement reached on Dec. 5 in order to hold negotiations with Paramount Skydance, according to an individual with knowledge of the situation. At the same time, WBD’s board was under pressure from investors and corporate watchdogs to engage with Paramount Skydance, which went from making unsolicited offers last fall to filing a lawsuit against WBD in January in an effort to force it to disclose more details about the valuation methodology used in reaching Netflix’s $27.75 per share offer. It all added up to a lot of noise. Netflix was ready to fight fire with fire — until Sarandos and Peters decided to bow out. That decision too — described by one observer as “putting shareholder value above executive ego” — is drawing praise from the investment community. “It signals that Netflix believes in its internal growth story enough to maintain M&A discipline. We also believe the future Paramount Skydance Warner Bros. Discovery — they’ll need a better name — could finally transform two subscale media companies into a more serious industry player, provided management has the financial flexibility to execute on its vision,” Fishman wrote. Paramount’s new owner, David Ellison , has been relentless in his pursuit of Warner Bros. Discovery, working his connections on Capitol Hill, while making a spirited case that his company was offering a better deal for shareholders. This month, he and his team pulled off what many analysts and industry figures thought was impossible, forcing Warner Bros. Discovery to come back to the negotiating table. And Ellison was determined to make the most of the opportunity. While fine-tuning his pitch, he relied on a core team of trusted advisors and board members such as Safra Katz, Justin Hamill and Gerry Cardinale. Paramount’s Chief Operating Officer Andy Gordon worked closely with his investor relations group and advisor Faiza Saeed of the law firm Cravath, Swaine & Moore. Melissa Zukerman, Paramount’s chief communications officer, also was involved in the strategy sessions. Conspicuously absent from all WBD-related proceedings was Paramount president Jeff Shell, who is currently embroiled in controversy over allegations he leaked sensitive financials in CBS’ $7 billion UFC deal. During the seven-day negotiating period that ran Feb. 17 to Feb. 23, WBD and Paramount Skydance leaders never once met as a group in person. All the discussions were held via video conference calls, emails and by phone. There was an evident chill — or at least lack of chumminess — between the sides. Some of that has to do with the tangled history between the players. Paramount’s unsolicited offer to buy WBD last September set off a domino effect that forced Zaslav and his team to hold an auction for the company much sooner than they had planned. And Paramount’s desire to buy WBD’s linear cable channels derailed the plan that was in the works to spin them off into a standalone company dubbed Discovery Global. Despite the bad blood, a weekend of virtual talks between Paramount and WBD saw Ellison’s ninth offer sweetened from $30 per share to $31. Paramount also offered shareholders a “ticking fee” for each quarter the acquisition might be stuck in the regulatory process. It was an offer David Zaslav couldn’t refuse. Ellison was taking meetings at Skydance’s sleek Santa Monica headquarters on Friday when word came down that the path had been cleared for Paramount to take WBD. Shortly before Netflix publicly bowed out, champagne was rolled into the executive suite at Paramount’s Melrose lot. The mood was ebullient, partly because while Netflix deemed Warner Bros. “nice to have,” Ellison always saw the studio as “must have” if he was going to realize his ambitions to create a new media leviathan. But now comes the even harder part. If Paramount is able to secure regulatory approval, a process that insiders predict will take at least a year, it will have to find a way to grow the company’s streaming business while overseeing the decline of cable. And it will have to pull off that transition while servicing more than $78 billion in debt. That’s left some industry executives skeptical that Paramount will make good on its promise to increase its output of streaming programming, while making 30 theatrical film releases a year, the most of any studio by a wide margin. Indeed, if the WBD transaction is completed, Team Ellison will have an even steeper climb to bring the enlarged Paramount back to the summit of Hollywood. The vertical merger of Paramount and Warner Bros.’ film and TV studio operations is guaranteed to be a bloodbath of layoffs and a senior management “Game of Thrones” environment as the new regime decides who stays and who goes between Paramount Pictures and Warner Bros. Pictures as well as Warner Bros. Television, CBS Studios and Paramount Television Studios, among many other imprints. The same questions loom over HBO Max and Paramount+ and the management of WBD’s large portfolio of linear cable channels that include CNN, TNT, TBS, Cartoon Network, Discovery Channel, TLC, Animal Planet, Food Network and HGTV. Given the behind the scenes drama that has enveloped CBS News since Ellison took over Paramount Skydance, the mood was grim at CNN after the news broke in real time Thursday. One persistent sentiment shared by staffers from various divisions of WBD was what one studio insider described as “complete and total fucking merger fatigue.” If completed, the Paramount transaction will mark the third time that Warner Bros., HBO, CNN, TNT and other channels have been sold to new owners just since 2018, when AT&T sealed its purchase of Time Warner, after winning an antitrust trial in the first Trump administration. That was followed in 2022 by the WarnerMedia merger with Zaslav’s Discovery Inc. In both cases, WB and HBO endured a long period of limbo while legal and regulatory processes ensued. And all of that has unfolded under the backdrop of massive disruption across the entertainment business. WBD troops were bracing for another long merger slog regardless. But as the tables turned quickly on Thursday afternoon, many rank and file staffers expressed regret that the studio would not be hitched to the industry’s dominant subscription streaming platform but rather to a smaller, struggling rival legacy media conglomerate. There is great skepticism about Ellison’s ability to make the high-wire act work while Paramount Skydance shoulders a mountain of debt supplied by a consortium that includes Middle Eastern sovereign wealth funds. “Debt is debt,” says Rick Morris, a professor at Northwestern University’s School of Communication. “Debt will stop them from taking new initiatives, from investing in content, and it’ll take a period of time to work off. And many companies fail at working off the debt, and that is part of the reason that Warner Bros. is for sale.” There is little doubt that Paramount Skydance will make massive cuts to WBD operations for the sake of de-leveraging the balance sheet. If all goes as planned, the company will carry a debt ratio of nearly 7 times its annual earnings — a huge red flag for credit agencies and many investors. Paramount has pledged to swiftly cut its debt-to-earnings ratio down to 4.4 times earnings, which means finding billions of dollars in cost savings from the jump. The WBD transaction is backed up to an unprecedented degree by a guarantee made by Larry Ellison against his personal fortune, buoyed by shares in Oracle, the software giant that he co-founded in 1977 when computing was in its infancy. Larry Ellison is also on the hook to invest many more billions should the enlarged Paramount Skydance struggle to maintain enough cash flow to support operations. Laurent Yoon, media analyst with Bernstein, sees WBD as a necessity for Paramount but one that will not be easy on the rank and file tasked with running the businesses. “Overpaying for WBD to accelerate growth is perhaps better than facing a mediocre standalone trajectory — at least this gives [Paramount] a shot at greatness, in our view.. But we do not expect them to come out swinging too hard,” Yoon wrote in a Feb. 26 research note. “Before they can invest in growth, they’ll need to cut deep and fast, and allocate most of their free cash flow to interest expense and de-levering. This is effectively the same position WBD was in from ‘22 (post-merger) through ‘25, a period that constrained growth despite having quality studios and IPs.” In the Netflix-WBD merger scenario, filmmakers were concerned about Netflix’s commitment to the theatrical business , noting that Sarandos had earlier dismissed cinemas as “outdated.” That left them skeptical of the company’s promises that it would continue to release Warners films on the big screen and honor traditional home entertainment windows. Paramount, in contrast, has loudly argued that it is the true defender of the cinematic experience and has promised to increase the number of films that the combined studios will release in theaters. Yet having Paramount own Warners Bros. Discovery has raised other concerns for artists, some of whom worry that Ellison’s coziness with the Trump administration will stifle free expression. They’ve been alarmed by his moves at CBS News, where he has installed Bari Weiss, a conservative columnist best known for her anti-woke jeremiads, as editor-in-chief. It’s expected that Weiss will have a big role in steering CNN down the road. “Ellison scares the shit out of me,” says one A-list director. “Are the movies they put out going to be catered to Trump’s taste? Are they going to start cracking down on content that they don’t find to be ideologically aligned with the right?” Ellison has earned that skepticism. In his aggressive pursuit of WBD, he has not been shy about flexing his family’s wealth (his father Larry Ellison is one of the world’s richest men) and connections to President Donald Trump. In lobbying publicly and privately for Paramount’s unsolicited WBD bids, Team Ellison sought to amp up concerns about Netflix exerting monopoly power over the streaming pay TV marketplace and having the ability to dictate pricing and deal terms for Hollywood’s creative community. The Ellisons also made their case to regulators in the U.K. and European Union, which have a track record of tougher enforcement of antitrust and concentration issues. David Ellison went so far as to attend Trump’s State of the Union address to Congress Tuesday as a guest of Sen. Lindsey Graham , a key confidant of the president. One observer compared Ellison’s trek to the Capitol earlier this week to the row of tech leaders who attended Trump’s inauguration in January 2025 — an image that has become symbolic of the fact that big business and moguls — the likes of Jeff Bezos and Tim Cook — are kowtowing to Trump’s authoritarian style of leadership. “This process speaks volumes,” says J. Christopher Hamilton, a professor of Syracuse University’s Newhouse School of Public Communications and an attorney. “Companies don’t have to go behind the scenes any longer to court lawmakers and this administration doesn’t feel like it has to be subtle about who it wants to reward and who it prefers to own businesses.” Netflix’s Sarandos also invested in personally lobbying political leaders on the merits of the deal. He endured a two-hour grilling in the Senate at a hearing on Feb. 4 that demonstrated the depth of the fight that Netflix would face. In addition to federal pressure, state attorneys general are lining up to launch their own local probes into the transaction. Now they will focus more on vertical-merger issues for two companies with mostly overlapping operations versus the specter of monopoly power — a loaded term that raised the stakes for Netflix no matter how many times Sarandos pointed to independent Nielsen audience data showing that even combining the streaming service with HBO did not rise to the level of what is traditionally considered to be a monopoly-level of market share. On Friday, as Netflix staffers digested all the news, more than a few executives expressed the feeling that the streamer may have dodged a bullet. And for their troubles, Paramount Skydance will pay them the $2.8 billion breakup fee that Netflix negotiated in the agreement it inked with WBD’s board on Dec. 5. “I think there’s a sense of relief on the Netflix side that we came close to getting it, and now we have an out and we got paid for the time we spent doing it. There’s some disappointment in not getting what you want and a relief that you didn’t get it,” said a senior entertainment lawyer with knowledge of the situation. Now, as the town’s attention shifts from the bidding war to what is likely to be a war of attrition, there are fears that the union of Paramount Pictures and Warner Bros. Pictures will result in one fewer buyer of films — and that WB will be hamstrung on dealmaking and big long-term swings while it waits for the sale to close. Already, filmmakers say that it’s taking longer for them to get an answer from the studio on the status of their projects, noting that the company is wary of committing too much money to new films when a different ownership team is waiting in the wings. Ellison’s politics have alarmed many in left-leaning Hollywood, but some people are impressed with the executive team he has installed at Paramount. Josh Greenstein, who was brought over from Sony Pictures to help oversee the film studio with Dana Goldberg, has earned high marks for making tough calls on film projects, while urging the studio to land splashy projects from the likes of James Mangold and Timothée Chalamet. “Josh is the real deal,” says one media executive who has worked with him. “He is a straight shooter. And in a matter of months he’s stocked a cupboard that was bare.” At the same time, Warner Bros. Pictures has been on an unprecedented roll at the box office since the second half of 2025, after enduring some painful flops in 2024 and early in 2025. To many, it feels as though just as WB Pictures chiefs Pam Abdy and Michael De Luca were hitting their stride with commercial and critical successes — the studio’s “Sinners” and “One Battle After Another” are this year’s top film award season contenders — the executive turnstiles are about to swing once again. “If they’re smart, they’ll keep Mike and Pam,” says the media executive. “But there’s only so much executive power to go around. Decisions will need to be made.” For Paramount, the road ahead will be paved with key management and strategic decisions, as well as a herculean effort to revitalize two media giants that have often struggled to navigate the streaming era. Up the road from Paramount’s Melrose lot in Hollywood, Netflix brass also face momentous decisions about their future. But first they’ll need to figure out what to do with the $2.8 billion check that Paramount wrote them on Friday. Think of it as a dowry that a jilted suitor gets to keep. Matt Donnelly and Todd Longwell contributed to this report. Loading comments... ‘Stranger Things’ and Prince: The Complicated Road to Bringing ‘When Doves Cry’ and ‘Purple Rain’ to the Show’s Finale ‘Stranger Things’ Play Breaks Broadway House Record With $2.5 Million Over Christmas Prince’s ‘When Doves Cry’ and ‘Purple Rain’ Spotify Streams More Than Double in ‘Stranger Things’ Series Finale Surge ‘Stranger Things’ Finale Spoiler Interview: Duffer Brothers on Whether Eleven Is Alive, Debating Who Got to Kill [SPOILER] and Why the Rock From the Briefcase Is Key to the Spinoff Box Office: Netflix’s ‘Stranger Things’ Series Finale Earns More Than $25 Million in Movie Theaters ‘Stranger Things,’ ‘Squid Game’ Top Nielsen’s Most-Streamed Original Series of 2025 List More From Our Brands Rolling Stone Michael Jackson Estate Sued for Child Trafficking by Siblings Alleging More Than Decade of Abuse Robb Report Demi Lovato’s Former Villa Above the Sunset Strip Lists for $11 Million Sportico Miami of Ohio’s Perfect Hoops Run Sets Table for New $281M Arena"
    },
    {
      "title": "Zack Snyder Says ‘Go F— Yourselves’ If You Think His Fans Are ‘Toxic’ and Defends ‘Batman v Superman’ 10 Years Later: ‘Do You Really Want a Movie Where the Decisions Have Been Made in a Boardroom?’",
      "url": "https://variety.com/2026/film/news/zack-snyder-defends-toxic-fans-batman-v-superman-1236674621/",
      "date_collected": "2026-02-28 07:16:43",
      "publication_date": "2026-02-27T23:03:03",
      "source": "Variety",
      "full_text": "Feb 27, 2026 3:03pm PT Zack Snyder Says ‘Go F— Yourselves’ If You Think His Fans Are ‘Toxic’ and Defends ‘Batman v Superman’ 10 Years Later: ‘Do You Really Want a Movie Where the Decisions Have Been Made in a Boardroom?’ By Zack Sharf Plus Icon Zack Sharf Digital News Director ZSharf Latest Zack Snyder Says ‘Go F— Yourselves’ If You Think His Fans Are ‘Toxic’ and Defends ‘Batman v Superman’ 10 Years Later: ‘Do You Really Want a Movie Where the Decisions Have Been Made in a Boardroom?’ 8 hours ago Hilary Duff Crashed ‘Freaky Friday’ Premiere Because Lindsay Lohan Was Her ‘Childhood Feud’ and ‘Nemesis’; They Squashed Their Beef Later Over Shots 2 days ago Donald Trump Lashes Out at Robert De Niro for Telling Americans to ‘Resist’ the President: ‘A Sick and Demented Person With an Extremely Low IQ’ 2 days ago See All ©Warner Bros/Courtesy Everett Collection Zack Snyder joined the “Happy Sad Confused” podcast to mark the 10th anniversary of “ Batman v Superman: Dawn of Justice ,” his highly-divisive comic book movie that opened to negative reviews on March 25, 2016 but went on to gross a mighty $874 million worldwide. The tentpole was Snyder’s sequel to the already-polarizing “Man of Steel,” which sent comic book fans into a tizzy for depicting Superman killing Zod, and “BvS” only divided fans further with Batman killing criminals, the two heroes bonding over their moms both being named Martha and more. Related Stories 'Pretty Little Liars' Cast Teams Up for INAD PSA Ahead of Rare Disease Day “My 100% honest reaction to ‘BvS’ and how it’s received in the world is… Do you really want a movie that’s had all the edges shaved off it by the focus groups?” Snyder said in defense of the movie 10 years later. “Do you really want a movie where the decisions have been made in a boardroom, or tested ideas have been rendered for your enjoyment? Do you really want the Kmart version of your story? Is that what you really want?” Popular on Variety “Batman v Superman” was the second movie in Snyder’s DC Universe, dubbed the ‘SnyderVerse’ online by his legion of fans. “Justice League” came next with its own polarizations after Snyder left the production due to a family tragedy and the studio brought in Joss Whedon to rewrite scenes and conduct reshoots. This led to a social media movement of Snyder fans calling Warner Bros to release the “Snyder Cut” of “Justice League,” which the studio permitted. “Zack Snyder’s Justice League” debuted on HBO Max in 2021. “I love the mythological journey we went on in these three movies,” Snyder said. “The intensity of where we ended up with ‘Justice League’ and how it evovled and where it came from. That whole insanity. When we were trying for the PG-13 rating on ‘BvS,’ the MPAA kept kicking the movie back to us saying, ‘It’s still an R.’ I remember someone saying we got a report from the MPA saying, ‘We just don’t like the idea of Batman fighting Superman. That kind of makes it an R. He really hits him hard with that sink. That’s rude. That feels like an R.’ I’m just like, ‘Okay… let’s just pretend it’s not Batman vs. Superman for one second.'” “You realize then that we were kicking the zeitgeist in the nuts and that we were going to anger people,” Snyder continued. “Not only do they not want their heroes deconstructed, they don’t want their heroes battling each other on a road to deconstructing the why of their existence. That’s another sacrilege.” The Snyder Verse ended before Snyder got to make two more “Justice League” movies, although he admitted on the podcast that he’s “absolutely talked about” bringing those two movies to life somehow in other mediums like a comic book or animation. Snyder added: “We live in a world where all that is possible.” “I would never say there is no way,” Snyder said when asked about his fans’ continued pleas for the SnyderVerse to continue. “I was on the ride that created ‘Justice League,’ and if you were in my shoes there were numerous times, dark times, when there was no chance that there will ever be my version of it. It will never exist. It can’t… cost, politics, everything stood against. And yet it exists. The fans should never forget they did that. They also raised a ton of money for suicide prevention. They did a lot of good. They catch a lot of flak for being toxic or whatever, but they literally saved human lives. You can go fuck yourselves if that’s what you think.” The DC Universe has since been revived at Warner Bros. under the leadership of James Gunn and Peter Safran. Gunn directed a new “Superman” movie that was greeted with a mostly positive critical and fan reception upon release last year. “James is cool. I wish them all the best. It is what it is,” Snyder said. “That three movie trilogy is a weed that just won’t die. It grows on its own. It has its own life. It’s not concerned with James’ Superman, which is amazing and all the best to them. I can’t wait to see the next movie. It’s awesome. To me, it’s not the same thing. It’s a different thing.” Watch Snyder’s full interview on the “Happy Sad Confused” podcast in the video below. ‘Stranger Things,’ ‘Squid Game’ Top Nielsen’s Most-Streamed Original Series of 2025 List ‘Stranger Things’ Creators Defend Will’s Coming Out Scene and Confront Toxic Fan Review Bombing: ‘The Ultimate F— You to Vecna’ ‘Stranger Things’ Doc Director on Filming the Discussion About Demogorgons in the Final Battle and That Ambiguous Ending: ‘That’s the Reaction the Duffer Brothers Wanted’ (EXCLUSIVE) David Harbour Exits Tony Gilroy’s Searchlight Drama ‘Behemoth!’ Variety Scores GLAAD Media Award Nominations for Outstanding Print Article and Magazine Overall Coverage ‘Stranger Things’ and Prince: The Complicated Road to Bringing ‘When Doves Cry’ and ‘Purple Rain’ to the Show’s Finale Loading comments... More From Our Brands Rolling Stone Michael Jackson Estate Sued for Child Trafficking by Siblings Alleging More Than Decade of Abuse Robb Report Demi Lovato’s Former Villa Above the Sunset Strip Lists for $11 Million Sportico Miami of Ohio’s Perfect Hoops Run Sets Table for New $281M Arena"
    },
    {
      "title": "Susan Sarandon Says She Was Banned From Hollywood After Calling for Gaza Ceasefire: I Feel ‘Repression and Censorship’ in United States",
      "url": "https://variety.com/2026/film/news/susan-sarandon-hollywood-ban-gaza-ceasefire-speech-1236675199/",
      "date_collected": "2026-02-28 07:16:42",
      "publication_date": "2026-02-27T23:42:15",
      "source": "Variety",
      "full_text": "Feb 27, 2026 3:42pm PT Susan Sarandon Says She Was Banned From Hollywood After Calling for Gaza Ceasefire: I Feel ‘Repression and Censorship’ in United States By William Earl Plus Icon William Earl @beautifulbill Latest Susan Sarandon Says She Was Banned From Hollywood After Calling for Gaza Ceasefire: I Feel ‘Repression and Censorship’ in United States 7 hours ago Variety Announces 2026 Entertainment Marketing Summit Program Featuring Tina Knowles and Warner Bros. Motion Picture Group Co-Chair Pam Abdy 1 day ago ‘Real Housewives’ Star Mary Cosby’s Son Robert Jr. Dies at 23 2 days ago See All Kristina Bumphrey/Variety Susan Sarandon is speaking out about her current film and television career, saying that after she spoke out and called for a ceasefire in Gaza that she was unable to take on roles in the United States. “I was fired by my agency, specifically for marching and speaking out about Gaza, for asking for a ceasefire,” Sarandon said. “It became impossible for me to even be on television. I don’t know lately if it’s changed. I couldn’t do any major film or anything connected with Hollywood. I found agents ultimately in England and in Italy, and I work there. I just did a film in Italy, and I did a play at the Old Vic for a number of months. I know this Italian director that just hired me — he was told not to hire me, so that’s still recently. He didn’t listen, but they had that conversation. Right now, I kind of specialize in tiny films with directors who have never directed, in independent films.” Related Stories 'Pretty Little Liars' Cast Teams Up for INAD PSA Ahead of Rare Disease Day The “Thelma and Louise” star also said that Spain has more intellectual freedom than the United States. Popular on Variety “In a place where you feel repression and censorship, to see Spain and to see the president and what he says and the support that he’s giving about Gaza, and to have actors like Javier Bardem come forward with such a strong voice, is so important to us in the United States,” she said. Her comments came during a Feb. 27 discussion ahead of receiving the International Goya award in recognition of her career, including “Dead Man Walking” and “Atlantic City.” The Spanish Film Academy’s Goya Awards ceremony is set to take place on Feb. 28 in Barcelona. In 2023, Sarandon was dropped by UTA after she spoke at a pro-Palestine rally in New York City. Watch the full discussion below, courtesy of Reuters. ‘Stranger Things’ Star Jennifer Marshall Says She Was Surprised Not to Be Asked Back for Season 5, Notes It Came After Cancer Diagnosis ‘Stranger Things,’ ‘Squid Game’ Top Nielsen’s Most-Streamed Original Series of 2025 List Netflix Crashes as ‘Stranger Things’ Finale Premieres, Second Time This Season ‘Stranger Things 5′ Becomes Netflix’s No. 6 Most Popular English-Language Series of All Time, ‘His & Hers’ Debuts at No. 1 ‘Stranger Things: Tales From ’85’ Trailer Reveals April Release Date, New Monsters and Steve Harrington Voiced by Jeremy Jordan Prince’s ‘When Doves Cry’ and ‘Purple Rain’ Spotify Streams More Than Double in ‘Stranger Things’ Series Finale Surge Loading comments... More From Our Brands Rolling Stone Michael Jackson Estate Sued for Child Trafficking by Siblings Alleging More Than Decade of Abuse Robb Report Demi Lovato’s Former Villa Above the Sunset Strip Lists for $11 Million Sportico Miami of Ohio’s Perfect Hoops Run Sets Table for New $281M Arena"
    },
    {
      "title": "‘Scream 7’ Ending: All the Deaths, Cameos and Killers Explained, and Will There Be a ‘Scream 8’?",
      "url": "https://variety.com/lists/scream-7-ending-deaths-cameos-explained-scream-8/",
      "date_collected": "2026-02-28 07:16:41",
      "publication_date": "2026-02-28T00:30:00",
      "source": "Variety",
      "full_text": "Feb 27, 2026 4:30pm PT ‘Scream 7’ Ending: All the Deaths, Cameos and Killers Explained, and Will There Be a ‘Scream 8’? By Jordan Moreau Plus Icon Jordan Moreau Latest ‘Hamnet’ Sets Peacock Streaming Release Date Ahead of Oscars 15 hours ago Box Office: ‘Scream 7’ Makes $7.8 Million in Previews, Highest Ever for Franchise 16 hours ago ‘Pokémon’ Reveals New Games, ‘Winds’ and ‘Waves,’ With 2027 Release Date and 10th Generation Starters 16 hours ago See All Paramount SPOILER ALERT: This article contains spoilers for “Scream 7,” now playing in theaters. Ghostface is back in theaters, and so is Neve Campbell’s Sidney Prescott after sitting out “Scream 6.” In “Scream 7,” Sidney is now a mother to a teenage daughter named Tatum (Isabel May), who gets caught up in her own twisted cat-and-mouse game with the masked killer. Like past “Scream” movies, there’s buckets of blood, shocking kills and one big unmasking at the end of the movie — plus several cameos from past films. The Ghostface killers rack up quite the bodycount in “Scream 7.” Right off the bat, horror movie lovers Scott (Jimmy Tatro) and Madison (Michelle Randolph) are murdered after renting the home that belonged to Matthew Lillard’s Stu Macher in the original “Scream.” Over in Pine Grove, Sidney receives an eerie message from Stu, apparently back from the grave. He claims that he survived his death in “Scream” and is back as Ghostface to get his revenge on Sidney and her family. One of the Ghostfaces then kills Tatum’s classmate Hannah (Mckenna Grace) at her high school’s play rehearsal then goes to Sidney’s house. After a fight with Sidney, her husband Mark (Joel McHale) and Tatum, that Ghostface is run over by reporter Gale Weathers (Courteney Cox), who’s joined by her new camera crew Mindy (Jasmin Savoy Brown) and Chad Meeks-Martin (Mason Gooding) from the past two “Scream” movies. Ghostface is revealed to be an unknown murderer who escaped from an insane asylum and had been stalking Sidney. After visiting the mental institution and talking to a supervisor, Sidney finds out that Stu had apparently survived his death. The real Ghostface starts picking off his victims one by one: Tatum’s friend (Celeste O’Connor), Sidney’s neighbor’s son Lucas (Asa Germann) and Tatum’s boyfriend Ben (Sam Rechner) all die. Mark is wounded, but later survives. It’s also revealed that “Stu” is an AI deepfake created by Marco (Ethan Embry), the supervisor at the mental institute. He makes the AI video transform into late sheriff Dewey Riley (David Arquette), Nancy Loomis (Laurie Metcalf), who was the Ghostface from “Scream 2,” and Roman Bridger (Scott Foley), the killer from “Scream 3.” However, the real brains behind the Ghostface killing spree turns out to be Sidney’s neighbor Jessica (Anna Camp). After unmasking, she says she was inspired by Sidney’s autobiography and thought she needed to murder her own husband to reach the same levels of success. When that didn’t work, she discovered where Sidney lived, met Marco and decided to kidnap Tatum to put her through the same Ghostface killings that Sidney survived. But in the end, Sidney and Tatum are able to kill Marco and Jessica (who’s shot repeatedly in the head) and escape with their lives. With Sidney, Tatum and Mark alive, could they star in an eighth movie and face off against another Ghostface? Mindy and Chad also survive the finale, and in the mid-credits scene they shoot their own news broadcast about the killings; perhaps they could follow in Gale’s reporting footsteps. “Scream” creator Kevin Williams has ideas for an eighth movie, but so far nothing has been officially announced. See the past “Scream” cameos that appear in the seventh movie below. Stu Macher (Matthew Lillard) Stu was one of the original Ghostfaces in the original “Scream,” alongside Sidney’s boyfriend Billy Loomis (Skeet Ulrich), and fans have long theorized that he may have survived his death in the 1996 film after a TV fell on his head. Matthew Lillard returns to play the deranged horror movie fan, but it’s eventually revealed he’s an AI deepfake used to torment Sydney. Nancy Loomis (Laurie Metcalf) Laurie Metcalf plays local reporter Debbie Salt, who’s later revealed to be original Ghostface Billy Loomis’ vengeful mother Nancy in “Scream 2.” She has it out for Sidney after the heroine killed Billy in the original “Scream.” Nancy later turns on her fellow Ghostface Mickey Altieri (Timothy Olyphant), but is killed in her final showdown with Sidney. She appears as an AI recreation toward the end of “Scream 7.” Roman Bridger (Scott Foley) Scott Foley played Roman Bridger, director of the in-universe film “Stab 3” who’s revealed to be Sidney’s half-brother in “Scream 3.” Roman was the only solo Ghostface in the franchise, and his actions secretly dated back to the original “Scream.” He was the product of his and Sidney’s mother Maureen being sexually assaulted, but Maureen later rejected him as a son. Spurned by his mother, Roman filmed her affair with Billy Loomis’ father years ago and showed Billy the footage, causing him to go on the original murder spree in “Scream.” Sidney kills Roman in the “Scream 3” finale, and he appears as AI at the end of “Scream 7.” Dewey Riley (David Arquette) David Arquette first starred as Dewey Riley, deputy sheriff of Woodsboro, in the original “Scream” and appeared in every film until his death in “Scream 5.” He had survived stabbings by multiple Ghostfaces throughout the years, but he was finally killed for good in the 2022 reboot (or “requel”). He appears as an AI recreation at the end of “Scream 7.” CBS Wins Nielsen’s Fall Multiplatform Ratings Among Broadcast, Led by ‘Tracker’ — but Netflix’s ‘Stranger Things’ Dominates Overall (EXCLUSIVE) ‘Stranger Things’ Star Jennifer Marshall Says She Was Surprised Not to Be Asked Back for Season 5, Notes It Came After Cancer Diagnosis ‘Stranger Things,’ ‘Squid Game’ Top Nielsen’s Most-Streamed Original Series of 2025 List ‘Stranger Things’ Documentary Sets Netflix Release Date; Trailer Takes Fans Inside the Making of the Final Season and Last Day on Set David Harbour Exits Tony Gilroy’s Searchlight Drama ‘Behemoth!’ ‘Stranger Things’ Finale Breakdown: How Does it End, Who Dies and What Happens to Hawkins? Loading comments... More From Our Brands Rolling Stone Michael Jackson Estate Sued for Child Trafficking by Siblings Alleging More Than Decade of Abuse Robb Report Demi Lovato’s Former Villa Above the Sunset Strip Lists for $11 Million Sportico Miami of Ohio’s Perfect Hoops Run Sets Table for New $281M Arena"
    },
    {
      "title": "‘Bridgerton’ Stars Hannah Dodd, Masali Baduza and Victor Alli on Francesca’s Unlikely Romance and That Shocking Death",
      "url": "https://variety.com/2026/tv/news/john-death-bridgerton-francesca-michaela-season-4-1236670330/",
      "date_collected": "2026-02-28 07:16:40",
      "publication_date": "2026-02-28T00:30:00",
      "source": "Variety",
      "full_text": "Feb 27, 2026 4:30pm PT ‘Bridgerton’ Stars Hannah Dodd, Masali Baduza and Victor Alli on Francesca’s Unlikely Romance and That Shocking Death By Arushi Jacob Plus Icon Arushi Jacob Latest Bong Joon Ho, David Fincher and More Join Academy Museum’s Spring Programming Slate – Film News in Brief 9 hours ago ‘Resident Evil Requiem’ Launches (Gaming News Roundup) 10 hours ago ‘Wuthering Heights’: Meet the Folk Singer Whose Obscure Radio Performance of a 19th-Century Ballad Captured Emerald Fennell’s Ear 2 days ago See All LIAM DANIEL/NETFLIX SPOILER ALERT: This story contains spoilers for Season 4, Part 2 of “ Bridgerton ,” now streaming on Netflix. Everything has changed for Hannah Dodd ‘s Francesca in Season 4 of “Bridgerton.” Dodd took over the role of Francesca for the show’s third season, after the departure of Ruby Stokes. Since then, Francesca debuted in society, and then met, fell in love with and married John Stirling, Earl of Kilmartin ( Victor Alli ). Fans of Julia Quinn’s “Bridgerton” novels — the source material for Netflix’s mega-hit drama — know that the story doesn’t end there. Francesa’s book, “When He Was Wicked,” is the sixth installment in the series, and focuses on her romance with Michael Stirling, her late husband John’s cousin, who has loved her from the moment they met. As Season 3 set up Francesca and John’s love for each other, John’s rakish cousin finally made an appearance in the finale — as a woman named Michaela ( Masali Baduza ), in a dramatic gender-flipped departure from the book. While “Bridgerton” has introduced same-sex relationships to the show, it is unclear how the theme will be tackled in upcoming seasons. Francesca’s brother, and Season 4 lead, Benedict, was previously introduced as bisexual and came out to his now-wife, Sophie, during a heartfelt conversation in Part 2 . Regardless, Francesca and Michaela (dubbed “Franchaela” by fans) will be Bridgerton’s first central couple to be queer, as well as the show’s first Sapphic storyline. As for when that will happen, though Shondaland and Netflix haven’t yet announced who will be the lead character for Season 5, Francesca’s arc in the fourth season make her the prime candidate. (When Variety ‘s Jenny Maas asked showrunner Jess Brownell this question about Francesa, Brownell said, “Can you just put ‘laughs’?” And then added, “Interesting theory.”) Although no overtly romantic moments have passed between the duo yet, they’ve shared several scenes as Michaela’s outgoing and impulsive nature grates against Francesca’s need for order and repressed feelings. Much to the happiness of their mutually beloved John, the two eventually clear the air between them and strike up a friendship. Everything seems to be on track for the newly formed Kilmartin family, until John, suffering from a headache, lies down for a nap in Episode 6 and never wakes back up. The next two episodes feature a devastated Francesca as she attempts to navigate her grief, her suppressed emotions hard to read, until she reveals she is trying to stay calm for the sake of her pregnancy. But when the pregnancy turns out to be a false alarm, she has a devastating meltdown in her mother’s arms. Related Stories 'Pretty Little Liars' Cast Teams Up for INAD PSA Ahead of Rare Disease Day Through it all, her one steady source of comfort remains Michaela, the only one who understands the depth of her loss. Poles apart in character, Michaela proposes a joyful celebration of life for John, where Francesca finally smiles and thanks her for her support. Seemingly a united front, Michaela agrees to stay in London upon Francesca’s request, but secretly flees in the finale. Here, Baduza and Dodd, and Alli in a separate interview, speak with Variety about the trio’s love for each other, what’s next for Francesca’s character arc — and what John’s death means for Francesca and Michaela’s romance. Popular on Variety This is the first time we’ve seen a queer relationship in the spotlight on “Bridgerton.” Is there any added pressure to depict this particular storyline? Hannah Dodd: We’re mainly really, really excited and very proud to get to tell that story, and tell it in a way that it’s the lead storyline and not just the side characters. They get a full eight-episode arc as they deserve, and hopefully there’s audiences that feel really represented and included. Do Francesca and Michaela have feelings for each other at this point? And, more importantly, are they aware of them? Masali Baduza: I think Michaela has feelings for Francesca. I think that she has pushed them down to the very bottom, but they are there, and she isn’t really acknowledging them. Obviously, Francesca is her cousin’s wife, so it’s a lot for her, but she’s definitely feeling that level of attraction for Francesca. Dodd: I think Francesca isn’t even aware of that as a possibility. As much as she’s feeling feelings , she doesn’t really know where they come from and why. For the most part, it’s a confronting energy for her. [Michaela] is somebody who lives their life in quite an opposite way. It’s a little bit like triggering for Francesca, and makes her question herself. There’s a response that comes from Francesca when she’s with Michaela, but I don’t think she has any idea what that is — yet. After helping each other navigate their grief, Michaela promises Francesca she’ll stay in London but ends up leaving without a word. Why is that? Baduza: Michaela’s feeling a lot of emotions, and she’s very overwhelmed. I think that her coping mechanism is to just run away and pretend like nothing is happening. If she’s not there to face it, then she doesn’t have to deal with it. She’s constraining herself, and in doing so, is hurting Francesca a lot. She’s just looking out for herself. It’s clear to viewers that Michaela has an overwhelming effect on Francesca, who ends up being a bit stand-offish toward her. How does Michaela read Francesca’s confusing behavior toward her? Baduza: Michaela thinks maybe that Francesca’s lived a very sheltered life. She’s not used to anything or anyone that really disrupts her state of peace. Michaela reads that as friction and tension. But again, she’s not someone who really loves to interrogate what she’s feeling in the moment. If it’s very hard for her, she’ll give it back to her, or deflect, or just not be in the space and in the environment whatsoever. John’s last scene is him completing a puzzle with Francesca and Michaela, where he does the ground, and Michaela finishes the sky. His last shot in the show is him looking at Francesca and Michaela getting along with fondness. Did you play into the symbolism of that? What was John feeling in that moment? Dodd: I think that whole scene is a metaphor, and is sort of a symbol for their relationship. I think it’s very, very clever and very well-written that they both complete Francesca’s puzzle [and the pieces they choose] really represent their characters as well. Whether or not the characters are aware of things, I do think it’s something that you can look back on, and it feels like a bit of a blessing. Victor Alli: It’s interesting because John doesn’t know what’s happening next, so I had to play every moment as is, and not think about it being my last. It is really symbolic, but I didn’t want to lean into it too much, and wanted to [keep] it sort of simple. What does John hope for Francesca and Michaela individually? Alli: That post John’s passing, Francesca is able to find her feet again. John would want her to be happy, and would be behind whatever she decides to do. She shouldn’t feel the pressure of having to stay in this wallowing rut, and he expects her to bloom. And with Michaela, he would want her to shine in every single way. She’s such a big part of his life, and he’d want her to carry on the family name and be a Stirling ambassador, whatever that may mean. How is John going to continue to influence Michaela and Francesca’s relationship as it builds? Dodd: John’s an integral character for both of us, and he’s had such an impact on both our lives. He’s what connects them, but also what separates them. He’s going to be with them, as anybody who leaves you is, forever. Baduza: Exactly, and they’ll always be family on some level, because they shared John. Alli: I think there will always be a part of John in Francesca and Michaela, because ultimately, he’s the thing that united them both. Of course, they have to find their own feet and their own journey together. But he’s the glue. So, hopefully, there might be moments where he’s spoken about and remembered, because he’s an integral part of their relationship. What’s next for Francesca and Michaela in terms of reconciliation after Michaela’s departure? Dodd: It is gonna take some work, definitely. They’re both in pain, so I do hope that there’s grace given to both of them. Everybody goes through those things very differently, and it can do things to you. You’re not always your best self in those situations. Baduza: I hope that Michaela comes back to apologize, sets the record straight with Francesca and explains why she did what she did. It would be lovely to see that. I hope so. Fingers crossed. Throughout the season, Francesca is struggling with being unable to have a baby. After John’s passing, there’s a moment where she thinks she might be pregnant but realizes she isn’t, followed by a particularly difficult conversation with her mother, when Francesca says she feels she failed John by not being able to make him a father. How much of Francesca’s grief is her not having a baby versus guilt over not being able to do something for her husband, whom she loved? Dodd: I don’t know if she knows. She’s got a tsunami of feelings. I think it’s something that connects her and her mum, and there’s this idea that this is how her mum got through [the loss of her husband]. I don’t completely know if she’s aware of what is “societal” and what are her own thoughts. I do think that she really, really wanted a baby, and I think that [having one] would have also been devastating in its own right, but also been a piece of John that she gets to keep. It could have given her a purpose, and she’s somebody who would have benefited from that. But sometimes when life goes in unexpected ways, that’s where you can grow the most. There’s so much pressure on women and expectations, and I think for her to work out what she wants and who she is, she needs to break away from all of that. One of the major plot points in Francesca’s book, “When He Was Wicked,” is her struggle with infertility and wanting a child. Is that something that will be incorporated into the show for Francesca and Michaela’s storyline? Dodd: I’m sure what the writers will come up with will be beautiful and wonderful, and there’ll be elements of the book incorporated. Obviously, we have done the infertility storyline, so whether or not that continues, I don’t know, but I do think it’s a really interesting dynamic, and queer couples are included in that story as well. Just because we’re doing a queer storyline, it doesn’t mean that that won’t fit into it, and I’m excited to find out. Francesca is very overwhelmed by all of the attention from her family is giving her, but does continue to seek Michaela out. In addition to her being John’s cousin, is there a reason why Francesca finds her presence comforting? Dodd: I think it’s a combination of things. There is an instinctual thing — an unspoken and not really understood connection there. Michaela is somebody that she is drawn to, whether or not it’s because she frustrates her, whether or not it’s because she represents home and knows John. But nobody knew John like Francesca and Michaela. She’s really looking for comfort in somebody who is actually experiencing what she’s feeling. As much as everybody around the family loved John, Michaela is the only one who is grieving in the same way as she is, so she’s looking for that familiarity and that comfort from her. But there is a bit of an instinctive pull there as well. Speaking of John and Michaela’s relationship, there’s a scene at Michaela’s welcome-to-society party, where John is adamant that Francesca not attempt to set Michaela up with suitors and gets quite upset when she does. Is there a reason behind that? Baduza: It was never explicitly said. But Victor and I talked a lot about the fact that Michaela would have shared her sexuality with him, or her figuring it out, with him. John is very protective over Michaela. They have a very close sibling relationship, so he knows her very well. He knows that she’s not in the market for her husband, probably never will be. He knows what society expects of her and that she’s just not willing to do that. Alli: He knows Michaela really well and knows that Francesca means well. But John is sort of like, “It’s more than that.” Michaela is not ready for marriage and all that comes with it. She’s pretty content being single and seeing people, and she’s just waiting for the right time and the right love. Does John pick up on any of the romantic tension between the two of them? Baduza: I don’t think so. He would never expect his cousin to be into his wife. Alli: I don’t think he does. He’s so invested in his marriage that he just wants that. It wouldn’t even cross his mind that there’s something there. Throughout the season, Michaela gives Francesca a lot of difficult-to-decipher looks, especially during John’s funeral. How was she feeling overall and dealing with a confusing mix of emotions? Baduza: I think Michaela was definitely in her own world at the funeral. She couldn’t have been there for Francesca, because she was grappling with the loss of her brother. She was just overwhelmed and maybe was thinking of possible exit plans. She was just going through it and also grieving her brother with this family that she’s also getting to know. So she’s just not in the most comfortable environment. The pregnancy test Francesca undergoes is, quite frankly, very invasive. How does that add to the stress of the situation for Francesca? Dodd: It’s awful. It’s just horrible. You’ve got a grieving woman who has also been quite sheltered, so it’s so invasive, even filming it. I think [being pregnant] was something that she was hanging on to. If there was any hope in that situation, it was the baby. So to have that ripped away from her as well, it’s just like, what else can you take? She’s at absolute ground zero, especially once Michaela leaves; she doesn’t know what life looks like anymore. She’s worked so hard to create that life. It’s an opportunity for her to start again, which is horrendous for anybody to have to do, but there’s an opportunity there for her to actually get to know [herself]. There’s a really interesting dynamic of you can’t take anything else from me. I’m hoping that that will kind of contribute towards growth, because she’s been quite a little girl scared of the world, and “what else can you do to me?” is a really interesting place to take her. Just to switch gears for a second, how do you envision the Bridgertons breaking the Sophie scandal to Francesca in the middle of everything she’s dealing with? Dodd: I know! I know! Francesca is still very close to her family, so I like the idea of Eloise [telling her], just because I think they’re sort of besties. But Francesca would have been like, “OK, do you know what’s going on in my life?” Maybe she would have had something to say in support, like “love whilst you have time.” As awful as it is, maybe there was some motivation that’s given. Speaking of the Bridgertons, they’re a very close-knit family, and you really see that they want to be there for Francesca. Benedict and Hyacinth are really upset by John’s passing in particular, and it affect their actions throughout the next few episodes. How do you think his death affects the family at large? Dodd: It’s really interesting, because the death of our father has connected us as a family. It’s sort of the core of what the Bridgertons are and why we are so close as a family. To see them all kind of go through it again, it’s quite a visceral reaction. They are so close, and they do really feel for Francesca, but I do think it’s because some of them have been there before as well, that reality is probably quite difficult to replay and go through. It’s a beautiful family dynamic where they really lean on each other. There’s still a lot to explore within the siblings and their different relationships. I’m looking forward to hopefully getting to explore some other relationships out of this situation. But it definitely shakes all of them to their core. This interview has been edited and condensed. ‘Stranger Things’ and Prince: The Complicated Road to Bringing ‘When Doves Cry’ and ‘Purple Rain’ to the Show’s Finale ‘Stranger Things’ Surprise Final Episode Doesn’t Exist: Here’s Why Fans Thought ‘Conformity Gate’ Was Real ‘Stranger Things’ Doc Director on Filming the Discussion About Demogorgons in the Final Battle and That Ambiguous Ending: ‘That’s the Reaction the Duffer Brothers Wanted’ (EXCLUSIVE) ‘Stranger Things’ Documentary Sets Netflix Release Date; Trailer Takes Fans Inside the Making of the Final Season and Last Day on Set ‘Stranger Things’ Finale Spoiler Interview: Duffer Brothers on Whether Eleven Is Alive, Debating Who Got to Kill [SPOILER] and Why the Rock From the Briefcase Is Key to the Spinoff ‘Stranger Things’ Creators Defend Will’s Coming Out Scene and Confront Toxic Fan Review Bombing: ‘The Ultimate F— You to Vecna’ Loading comments... More From Our Brands Rolling Stone Michael Jackson Estate Sued for Child Trafficking by Siblings Alleging More Than Decade of Abuse Robb Report Demi Lovato’s Former Villa Above the Sunset Strip Lists for $11 Million Sportico Miami of Ohio’s Perfect Hoops Run Sets Table for New $281M Arena"
    },
    {
      "title": "‘The Beach Boys Love You’ Gets Its Live Premiere After 50 Years: Al Jardine and Darian Sahanaja on Finally Bringing the Classic Album to the Stage",
      "url": "https://variety.com/2026/music/news/beach-boys-love-you-live-concert-al-jardine-darian-sahanaja-1236675233/",
      "date_collected": "2026-02-28 07:16:38",
      "publication_date": "2026-02-28T01:43:05",
      "source": "Variety",
      "full_text": "Feb 27, 2026 5:43pm PT ‘The Beach Boys Love You’ Gets Its Live Premiere After 50 Years: Al Jardine and Darian Sahanaja on Finally Bringing the Classic Album to the Stage The 1977 album, a Brian Wilson auteur project, will get its official live premiere in full at L.A.'s United Theater Friday night. By Chris Willman Plus Icon Chris Willman Senior Music Writer and Chief Music Critic ChrisWillman Latest ‘The Beach Boys Love You’ Gets Its Live Premiere After 50 Years: Al Jardine and Darian Sahanaja on Finally Bringing the Classic Album to the Stage 5 hours ago Radiohead Tells Trump’s Homeland Security to ‘Go F— Yourselves’ After Song Used in ICE Video 13 hours ago Bruno Mars Makes a Leisure Suit of a Record With ‘The Romantic,’ Doubling Down on Silk Sonic’s Hermetically Sealed ’70s Revivalism: Album Review 15 hours ago See All Everett (Beach Boys); Stevo Rood (Al Jardine) Is the 1977 album “The Beach Boys Love You” a classic and essential part of this great American band’s catalog, or a lark? It’s so different from virtually every other album the group ever recorded over a nearly 50-year period, there will always be some split over that — maybe even internally, because even core member Al Jardine says he wasn’t that high on the record until relatively recently. But it’s fair to say that if you are really, really, really into the recorded output of Brian Wilson , there’s an outstanding chance you have consumed whatever Kool-Aid is necessary to have joined the choir of fans who have been singing the praises of “Love You” ever since it came out and flopped. Related Stories 'Pretty Little Liars' Cast Teams Up for INAD PSA Ahead of Rare Disease Day Now, it’s getting its due and then some. Al Jardine and the Pet Sounds Band — which is essentially the group that toured with Brian Wilson as a solo artist for many years — have been doing tour dates where they’ve performed most of the “Love You” album live. On Friday night, for the very first time ever, the ensemble will play the entire record, not leaving out a single track. Anyone who has heard them perform any of this material live will know it’s well worth the pilgrimage… as is any set of theirs that’s mostly limited to the core canon, given how faithfully they have been bringing any Brian song to full-fleshed life for decades before and months since the pop genius’ death. Popular on Variety Before a different SoCal show recently, Variety caught up backstage with Jardine and one of the key architects of the Brian Wilson/Pet Sounds Band, Darian Sahanaja , who was known as a member of the L.A. group the Wondermints before he began training virtually all his passion onto the Wilson ouevre. Following is an edited version of that conversation. In the meantime, for anyone reading this before Friday night’s show, it takes place at the United Theater on Broadway in downtown L.A. at 8 p.m. Tickets can be found here . For an itinerary of other upcoming shows, in which a good chunk of “Love You” might still be played, check here . (For those who can’t make it to a show — or those who can — there is also a new boxed set out from UMe that focuses on the “Love You” album and its outtakes, along with material from right before and after that project. Read more about that collection in Variety ‘s previous coverage here .) Al Jardine: We should bring in some of the fellas in the band, because it’s fascinating from their point of view. They’re the ones that talked me into doing this “Love You” album. It’s a pretty big deal. They call Darian the librarian. He’s got all this stuff in the back of his head, and he wanted to do this in a bad way. And I thought it was a great way to put the band back together, after Brian passed. Well, even before Brian passed, we’d been trying to get the band back together. Did it help, in reforming Brian’s band, to have kind of an excuse to do something different than what you were doing when he was around? Jardine: Yeah, it gave us a focus a priority, this long-awaited completion of the idea to do the “Love You” album and bring it to the forefront of our activity, musically. The band hadn’t worked since ’22, and I just wanted to to get it back together. Thanks to Darian, we’d been sharing this idea for quite a while, but for some reason, it just never happened while Brian was with us, even though it was a very personal thing for him, especially. Who knows why. But it’s happening. [To Darian] I’m so glad you convinced me, because we kept going back and forth. He said, “If you do this, if we accomplish this, people are gonna come out of the cities, they’re gonna come out of the woods, Al…” Darian Sahanaja: Yeah, you were doubtful. I think you were kind of like, “Really? People like that album?” Jardine: Well, it was very, very understated, and my participation in it was (just) as a vocalist, coming out of the woods in Big Sur to come down to do a session. It was a major thing in itself, just physically and mentally getting into the process of recording it, and it didn’t sound like a Beach Boy album to me. It was great, but it seemed like more of a Brian project, which of course it was. It was dedicated to him by his brothers, and particularly Carl (Wilson). Carl was the de facto producer, really, and pulled us all together so that Brian would be at ease, writing these songs. Sahanaja : He was coming out of an era when he was sort of hiding out in his room and not really doing much. Well, there was that whole “Brian’s back” campaign, right? Jardine: With “15 Big Ones” [the album immediately preceding “The Beach Boys Love You”]. And he wasn’t really entirely back. It was a big promotion that Mike (Love) put together with his brother, trying to make something out of nothing, quite honestly. Sahanaja : But the way you described how Brian put this music together and brought you guys in sort of in the late stage to sing on it, I don’t know why, but I see that as a very similar — maybe in a completely different context —to the way you did “Pet Sounds” [in the mid-‘60s]. Because in the same way, you guys were on tour, so it was very personal for Brian at the time. He put all the tracks together, and then the guys came into town and you laid down the tracks. I almost see that as a similar approach for Brian . And that’s why I consider “Love You” probably Brian’s second-most-personal album, after “Pet Sounds,” because basically, he wrote all the songs. I mean, even more personal in a way, because he wrote most of the lyrics. With “Pet Sounds,” he had Tony (Asher as lyricist), as you know. Jardine: Of course, Mike and I did write a couple songs, but they pale in comparison to his personal stuff. It’s just remarkable. And I admit I didn’t really appreciate it, because we were in the hit mode. We were on tour all the time. We were like, “We gotta have another hit. We gotta have another single.” And this wasn’t about that. Sahanaja : Well, that’s why Brian is an artist. He takes risks, he does things… If they fail, they fail. If they’re successful, they’re successful. Jardine: I mean, I don’t even remember singing some of this stuff. I don’t remember singing on “Solar System,” for instance. Sahanaja: You are in that vocal stack. Jardine: Am I? Are you sure? You would know. He (Sahanaja) knows how to pull this stuff out. But who writes a song with that kind of context, about the planets? t’s just beautiful. Sahanaja : Very sincere, very childlike. Jardine: You know, “Airplane.” Oh my God. “Airplane” is one of my favorites of all time.Now I’m completely… Sahanaja : Well, this was my favorite thing in the process of all this, is how he was skeptical at first, and just to watch him become reoriented with this music again and discovering it… maybe because the first time, it wasn’t successful, so onto the next… I love seeing him getting really, really into the music and realizing, “God, these are really, really beautiful songs.” And of course, in the wake of us losing Brian, it’s just his soul and his spirit are with us… Jardine: He’s right there. He’s right there. Sahanaja : That’s how we feel on stage. Every time we play these songs. I’m just like, ahhh, you can feel Brian’s soul. Al Jardine and the Pet Sounds Band at Cerritos Center Chris Willman/Variety Jardine: The guys in the band carry these leads really well, and do it justice. You carry Carl’s leads amazingly. How you do that? “God, please let us go on this way…” You won’t believe that, his performance, how he carries the spirit of Carl. Dennis (Wilson)… Sahanaja : I don’t do Dennis. “I Want to Pick You Up”… I can’t really sing that like Dennis. … To be fair, I’ve met people who maybe are not big fans of the record for one reason or another, but I would imagine a lot of it is because the way it’s executed is very raw… Jardine: Well, the amazing thing, it’s a synth-driven record, right? And your peers relate to that. Brian was in the forefront of all that stuff. He didn’t use bass guitars on this. He had a Moog synthesizer [as the bass]. It was a different style of production than the Beach Boys were accustomed to. And he literally brought that world to us, and so I’m sitting there with a guitar and going, “What the hell am I supposed to do?” So I really didn’t relate in that sense musically to it at first. Now I get it, because it’s so cleverly written. Sahanaja : With all the synths and really odd sort of production decision-making on it, I think it appealed to that next generation, especially going into the ‘80s and beyond, because it’s got that synth-pop thing going on. But, typical Brian: he wasn’t intellectualizing it at all. He wasn’t calculating it. He was like, “This sounds good to me and I could do this. I can just grab a keyboard and play these notes, and there it is. I’m happy.” But the way it all came together in that sort of DIY approach, little did he know… Jardine: But at the same time, he writes a song called “Roller Skating Child,” which is totally Beach Boys. That almost harkens back to the days. And “Honkin’ Down the Highway,” those two that are like that, I could relate to, and I sing the lead on (“Honkin’”). It just feels natural to me when you feel Brian’s.ability to go backwards and forwards, or retro and future. Amazing. I learned a new chord, by the way, the other day, in my book. Did you know there’s a sus4 in “Roller Skating Child”? Sahanaja : Is there? Jardine: That’s what it says. I found a little book in my stack of memorabilia called “The Beach Boys: Volume One.” It’s got all the songs that we wrote , and “The Beach Boys Love You” is in it, of all things. So, look at me. showing him some new chords. Sahanaja : I’ve gotta take a look.I’ll have to check that. Because Brian didn’t like sus; he didn’t like sustained chords. Jardine: Well, maybe the book’s wrong, then! Darian Sahanaja Scott Dudelson When you guys are playing the “Love You” songs now, have you rearranged it to fit in a little more with the other classic Beach Boys stuff that doesn’t sound anything like that, or are you trying to recreate the original synthy sounds? Sahanaja : It’s one thing is to say recreating. Another thing is just to embody the spirit and feel of the record, the original sensibilities of the record, which was Brian’s … It’s like when we do “Pet Sounds.” You can cut corners and simplify the chords and all that, but that’s not what Brian wrote, and that’s not what he came up with in the studio. So you can say, “Yeah, let’s get the exact paint-by-numbers thing,” but if you do paint by numbers but if it’s not done with the right feel and the spirit of it… Jardine: They nail it. This band, they nail it. Paul Von Mertens (multi-instrumentalist and musical director): I remember during “Pet Sounds” (on a tour performing that entire album), we would even debate in rehearsal … There’s a funny banjo entrance. You know, is that a mistake or intentional? “No, let’s keep it because it’s on there.” Sahanaja : And even one in this record. How about “Johnny Carson”? It’s so clearly a mistake. There’s this errant symbol crash that’s completely not (right), and we just love it, because, again, I picture Brian just going, “Pssssh, that’s it! That sounds great. Keep it .” Jardine: Well, how about in the third verse? Is it the third verse where he goes “da-da-da” and he does the resolve. Sahanaja : Yes, yes, you’re right. Jardine: And Bob (in the Pet Sounds Band) plays it just like it! He plays the mistake, perfectly. Sahanaja : I gives it an out-of-the-box feel. It’s just like, what? But when you listen back to even the golden-era Beach Boys recordings of Brian conducting the studio musicians (in the mid-‘60s), many times they’ll play something and say, “Is that right?” And Brian will go , “Yeah, that’s great. Just keep that,” because he just loves the vibe of it. Al Jardine and the Pet Sounds Band joined by Weird Al Yankovic and Eric Idle in concert in Cerritos, Calif, with Rob Bonfiglio. Scott Dudelson It feels like there might be different audiences coming to shows like this. There are some people coming who really just want to hear “The Beach Boys Love You.” And then at most of these shows, there will be people who don’t know the albu at all. Do you feel like there’s kinda like two audiences that you’re playing for? Jardine: Probably, I’m sure. Sahanaja : I don’t know. In the spirit of Brian Wilson, I like the idea that we just forge ahead and be bold. Von Mertens: I think that the idea is partly to bring the audience along with us. I can remember on the “Smile” tour, we were playing a festival in Belgium, and it was kind of drizzling on a soccer field, and there were beer stands encircling the entire field where the audience was. We hadn’t been playing “Smile” for very long. and we’re playing this outdoor festival and people are sliding around in the mud. And I remember the whole band — Jeff (Foskett) in particular — was like, “We can’t do ‘Smile.’ They’re gonna kill us! They’re gonna hate it.” And finally we just like bit the bullet and said, “OK, we’re gonna do it and we’re just gonna throw down like we always do.” When we finished the set, we left the stage and the audience was singing that soccer chant that they do that’s like an audio equivalent of a standing ovation. They were all going, “Ohhh-wayyyy-ooh,” and we were like, “OK. I guess, I guess it worked.” Sahanaja : Exactly. I always believe that if the material is really good and it’s performed well with love and care, it doesn’t matter if an audience is familiar with the music. I think they walk away feeling like, “Wow, that was really good.” Jardine: But I do like the first note of the show… It’s an anthem, “California Girls,” and as soon as you hit that first ding. Sahanaja : You’re making me sentimental because, because our dearly departed guitarist, Nick Walusko, I remember when I met him in 1983. And Nick would always say, “What Brian could do with just one note. Like the intro of ‘California Girls,’ listen, I know it’s one note, but it’s like a whole atmosphere in that one note.” And I totally understood that. How many members of the Brian Wilson Band have carried over to this band now? Jardine: There’s 12 on stage. All of us. Sahanaja : Almost everybody; one of us, Probyn (Gregory), couldn’t do this tour because he was out with “Weird Al” Yankovic on that incredible, successful tour. So we have another fellow filling in for him named Emeen Zarookian, who plays with Micky Dolenz. It’s been really fun. … Just to go back really quickly to the audiences: I love that this new music, us performing the “Love You” material, is just because of its kind of DIY approach in the synths, and we’re getting a lot of young people coming out to the shows, and freaking out. We just see them chanting and jamming along and jumping and up and down. It’s insane. It’s great, because I know what they’re excited about: Brian being Brian, which is somebody eccentric… Jardine: The big sing-along is a tune called “Ding Dang.” You know the album. It’s 52 seconds long, right? But it gets the audience; they go crazy immediately with the biggest reaction, and they start going “woo” with this, just carrying on like a bunch of kids. It’s really a childlike experience. We add a little extra, actually, at the end. We actually have a chord change now. We will surprise you with it. Netflix Crashes as ‘Stranger Things’ Finale Premieres, Second Time This Season ‘Stranger Things’ Star Jennifer Marshall Says She Was Surprised Not to Be Asked Back for Season 5, Notes It Came After Cancer Diagnosis ‘Stranger Things’ Finale Breakdown: How Does it End, Who Dies and What Happens to Hawkins? ‘Stranger Things’ Surprise Final Episode Doesn’t Exist: Here’s Why Fans Thought ‘Conformity Gate’ Was Real Winona Ryder Says Beheading [SPOILER] With an Ax in the ‘Stranger Things’ Finale Took Only Two Takes: ‘You Can’t Rehearse a Scene Like That’ ‘Stranger Things’ Play Breaks Broadway House Record With $2.5 Million Over Christmas Loading comments... More From Our Brands Rolling Stone Michael Jackson Estate Sued for Child Trafficking by Siblings Alleging More Than Decade of Abuse Robb Report Demi Lovato’s Former Villa Above the Sunset Strip Lists for $11 Million Sportico Miami of Ohio’s Perfect Hoops Run Sets Table for New $281M Arena"
    },
    {
      "title": "Jeff Probst Explains Why the Official ‘Survivor’ Podcast Is on Hiatus for Season 50",
      "url": "https://variety.com/2026/tv/news/survivor-podcast-hiatus-season-50-jeff-probst-1236674959/",
      "date_collected": "2026-02-28 07:16:37",
      "publication_date": "2026-02-28T02:00:00",
      "source": "Variety",
      "full_text": "Feb 27, 2026 6:00pm PT Jeff Probst Explains Why the Official ‘Survivor’ Podcast Is on Hiatus for Season 50 By Emily Longeretta Plus Icon Emily Longeretta emilylongeretta Latest Jeff Probst Explains Why the Official ‘Survivor’ Podcast Is on Hiatus for Season 50 5 hours ago ‘Grey’s Anatomy’ Cast and Creator Shonda Rhimes Honor Eric Dane After His Death: ‘A Truly Gifted Actor’ Who ‘Left an Indelible Mark’ 1 week ago Eric Dane, ‘Grey’s Anatomy’ and ‘Euphoria’ Star, Dies at 53 1 week ago See All Robert Voets/CBS The official “ Survivor ” podcast is hitting pause for Season 50. “‘Survivor’ 50 was designed as a celebration, and it features one of the most exciting game designs we’ve ever done,” Probst said in a statement to Variety . “Because of that, we made a conscious decision not to immediately pull back the curtain while it was happening. We wanted fans to discover it on their own and experience it in real time. Then at the live finale, we’ll have the opportunity to reflect on all parts of the season together.” Related Stories 'Pretty Little Liars' Cast Teams Up for INAD PSA Ahead of Rare Disease Day “On Fire With Jeff Probst” debuted at the start of Season 44 in 2023. Each week, directly after a new episode aired on CBS, a new episode would reveal Probst giving listeners a look behind the curtain at the making of “Survivor,” sharing his view as the executive producer, showrunner and host. Popular on Variety Rick Devens joined Probst and producer Jay Wolff as co-host for Season 45; Dee Valladares co-hosted for 46; Charlie Davis joined for Season 47; Rachel LaMont took over for 48; and Jeremy Collins joined for 49. “Survivor” 50 premiered on Feb. 25 and averaged 5.06 million viewers over its three-hour debut — the biggest same-day audience for Season 45’s penultimate episode in December 2023. It became CBS’ best Wednesday night performance since the Season 42 finale of “Survivor” in 2022. The milestone “Survivor” is a huge one for CBS and Probst, as they introduce new twists , fan voting and celebrity twists. During the premiere, a Billie Eilish idol was revealed; a Jimmy Fallon twist and integration of Zac Brown and Mr. Beast will come later in the season — but the game won’t change, Probst promises . “I think it’s a legitimate concern when you start adding layers like celebrities, that they can overshadow the game and take it off course,” he told Variety . “Our job was to make sure that we stayed true to what we’re doing on ‘Survivor,’ which is exploring this continuous social experiment. And now we’re adding another layer.” David Harbour Exits Tony Gilroy’s Searchlight Drama ‘Behemoth!’ ‘Stranger Things’ Surprise Final Episode Doesn’t Exist: Here’s Why Fans Thought ‘Conformity Gate’ Was Real Variety Scores GLAAD Media Award Nominations for Outstanding Print Article and Magazine Overall Coverage CBS Wins Nielsen’s Fall Multiplatform Ratings Among Broadcast, Led by ‘Tracker’ — but Netflix’s ‘Stranger Things’ Dominates Overall (EXCLUSIVE) ‘Stranger Things’ Doc Director on Filming the Discussion About Demogorgons in the Final Battle and That Ambiguous Ending: ‘That’s the Reaction the Duffer Brothers Wanted’ (EXCLUSIVE) ‘Stranger Things 5’ Finale Trailer: Eleven Prepares for the Final Fight Against Vecna as Netflix Series Ends With Two Hour-Plus Last Episode Loading comments... More From Our Brands Rolling Stone Michael Jackson Estate Sued for Child Trafficking by Siblings Alleging More Than Decade of Abuse Robb Report Demi Lovato’s Former Villa Above the Sunset Strip Lists for $11 Million Sportico Miami of Ohio’s Perfect Hoops Run Sets Table for New $281M Arena"
    },
    {
      "title": "Joey Bueno Breese Wins 2026 Deutsche Bank Frieze Los Angeles Film Award (EXCLUSIVE)",
      "url": "https://variety.com/2026/film/columns/joey-bueno-breese-wins-deutsche-bank-frieze-los-angeles-film-award-1236675288/",
      "date_collected": "2026-02-28 07:16:36",
      "publication_date": "2026-02-28T03:44:23",
      "source": "Variety",
      "full_text": "Feb 27, 2026 7:44pm PT Joey Bueno Breese Wins 2026 Deutsche Bank Frieze Los Angeles Film Award (EXCLUSIVE) Devin O’Guinn takes home the Audience Award By Marc Malkin Plus Icon Marc Malkin Senior Editor, Culture and Events marcmalkin Latest Joey Bueno Breese Wins 2026 Deutsche Bank Frieze Los Angeles Film Award (EXCLUSIVE) 3 hours ago ‘Scream 7’ Cast and Creatives on Their Favorite Franchise Kills and an Eighth Movie: ‘We Have a Lot of Ideas’ 13 hours ago Gwyneth Paltrow, Jenna Ortega and Delroy Lindo to Present at Actor Awards (EXCLUSIVE) 16 hours ago See All Courtesy of Joey Bueno Breese Joey Bueno Breese has been named the recipient of the $10,000 2026 Deutsche Bank Frieze Los Angeles Film Award for his film “El Rio Nuestro.” At the same time, Devin O’Guinn received the $2,500 Audience Award for his film “Julian.” Both winners were presented with their prizes during a special ceremony on Friday at Frieze Los Angeles at the Santa Monica Airport. Now in its seventh year, the Deutsche Bank Frieze Los Angeles Film supports early-career filmmakers in Los Angeles and is produced in collaboration with Ghetto Film School. Related Stories 'Pretty Little Liars' Cast Teams Up for INAD PSA Ahead of Rare Disease Day Jury award jurors included Emmy- and Golden Globe–nominated actor and producer Connie Britton; Claudio de Sanctis, Head of Private Bank and member of the Management Board at Deutsche Bank; Ché Chisholm, Chief Executive Officer of Ghetto Film School; Oscar–winning director Orlando von Einsiedel; and Jorge Villon, founder of Grace Lab. Popular on Variety “In its seventh year, the Deutsche Bank Frieze Los Angeles Film Award continues to spotlight filmmakers whose work reflects the courage and imagination of this city,” Americas, Frieze director Christine Messineo said. “This year, the films respond to the theme of Renewal and Resilience in deeply personal and socially aware ways – from confronting histories to finding new purpose. The fellows remind us that storytelling is a vital tool for transformation, both for the artist and the community.” “Julian” The shortlisted films were presented online and at the fair. Since its launch in 2019, the Deutsche Bank Frieze Los Angeles Film Award has supported more than 40 fellows, serving as an incubator for next-generation talent within the industry. “In celebrating the 2026 Deutsche Bank Frieze LA Film Awards, I extend my warmest congratulations to Joey Bueno Breese, this year’s Jury Award recipient, and to Devin O’Guinn, honored with the Audience Award,” de Sanctis said. “Their work leaves a lasting impression on all who engage with it. At Deutsche Bank, we are proud to champion artists whose creativity challenges and enriches cinematic expression.” Winona Ryder Says Beheading [SPOILER] With an Ax in the ‘Stranger Things’ Finale Took Only Two Takes: ‘You Can’t Rehearse a Scene Like That’ Sadie Sink on Eleven’s Fate in ‘Stranger Things’ Finale: ‘I Think She’s Dead’ ‘Stranger Things 5’ Finale Trailer: Eleven Prepares for the Final Fight Against Vecna as Netflix Series Ends With Two Hour-Plus Last Episode Actor Awards’ Stunt Ensemble Categories Announce Nominated Performers and Coordinators (EXCLUSIVE) ‘Stranger Things’ Finale Breakdown: How Does it End, Who Dies and What Happens to Hawkins? ‘Stranger Things 5′ Becomes Netflix’s No. 6 Most Popular English-Language Series of All Time, ‘His & Hers’ Debuts at No. 1 Loading comments... More From Our Brands Rolling Stone Michael Jackson Estate Sued for Child Trafficking by Siblings Alleging More Than Decade of Abuse Robb Report Demi Lovato’s Former Villa Above the Sunset Strip Lists for $11 Million Sportico Miami of Ohio’s Perfect Hoops Run Sets Table for New $281M Arena"
    },
    {
      "title": "‘Sinners’ and ‘One Battle After Another’ Take Top Honors at ACE Eddie Awards",
      "url": "https://variety.com/2026/artisans/news/ace-eddie-awards-2026-winners-list-1236674690/",
      "date_collected": "2026-02-28 07:16:35",
      "publication_date": "2026-02-28T04:33:20",
      "source": "Variety",
      "full_text": "Feb 27, 2026 8:33pm PT ‘Sinners’ and ‘One Battle After Another’ Take Top Honors at ACE Eddie Awards By Jazz Tangcay Plus Icon Jazz Tangcay Artisans Editor @jazzt Latest ‘Sinners’ and ‘One Battle After Another’ Take Top Honors at ACE Eddie Awards 2 hours ago Bong Joon Ho, David Fincher and More Join Academy Museum’s Spring Programming Slate – Film News in Brief 9 hours ago How ‘F1’s’ Sound Team Gave the Film Its Sense of Scale and Authenticity With Unprecedented Access to Formula 1 Tracks, Grand Prix Races, Camera Footage and Audio 12 hours ago See All Warner Bros. “Sinners” and “One Battle After Another” took home the live action feature awards at the 76th ACE Eddie Awards . “Sinners” editor Michael Shawver said, “Ryan Coogler took a big risk, and I think gave audiences something that maybe they didn’t even know they were hungry for something new, different, fun, and total experience.” “KPop Demon Hunters” took home the award for best edited animated feature film. The awards were handed out Friday night at UCLA’s Royce Hall, and to Oscar watchers provided insight into the Oscars race for best editing. The winners in best film drama editing and best film comedy/musical editing has gone on to match the best editing Oscar 17 times in the past 26 years. Related Stories 'Pretty Little Liars' Cast Teams Up for INAD PSA Ahead of Rare Disease Day “The Perfect Neighbor” took home the award for best edited documentary. The Netflix documentary is also nominated for an Oscar in the best documentary category. Popular on Variety Damian Rodriguez who won best edited documentary series for “Pee-wee as Himself” – Part One dedicated his win to team and Paul Reuben. Rodriguez said, “We wouldn’t be here without him. He was such an amazing artist, and he influenced so many people, including myself. I wish he was here.” On the TV side, “The Studio” and “The Pitt” won in their respective categories for best edited comedy and best edited drama. The ACE Eddies recognize outstanding editing in film, television, documentaries, shorts and digital content. Ang Lee received the ACE Golden Eddie Filmmaker of the Year Award. Kim Larson & YouTube Will were honored with the ACE Visionary Award, and Film Editors Arthur Forney, ACE, and Robert Leighton were given ACE Career Achievement Awards. Lee dedicated his award to his go-to editor Tim Squyres. “When you give me this award, you actually give me it to Tim Squyres.” Lee shared how Squyres had cut all his movies except “Brokeback Mountain.” “He missed that one because I told him, after ‘Crouching Tiger, Hidden Dragon,’ I’m retiring, I said ‘I had enough.’ So he took another movie.” Lee said he had stuck with Squyres for over 35 years. Speaking about what editing means to Lee, he said, “It’s very hard to say, but let me put this way, my wife said, I can only do two things, right, making movies and cooking. So let me use cooking as a metaphor. Shooting is like buying groceries, and the real cooking is on the editing table. That’s how I feel about editing. I’ve feel I have this editing machine in my head when I’m making movies, every section, every setup, editing is at the center of my consciousness. Every working day I have to answer, hundreds of questions about what I want. The only reason I can give directions and put the whole movie together is because I have that editing table in my head.” Lee added, “We’re in a particularly difficult moment, challenging moment, in our life of cinema. But I do believe, as long as there is as long as there are moving images, there will be editors.” Erin Casper who won best edited short for “All The Empty Rooms” that goes into the bedrooms of children killed in US school shootings, dedicated her win to the victims and the families “who opened their doors to us and welcomed us into their sacred spaces of their child’s bedroom preserved just as it was since the last day they saw their child alive.” She went on to say, “The word gun is never mentioned in our film, and this was intentional on our part, because we’ve all grown so numb to this epidemic.” She said their goal was to center the humanity and “the life that was in these rooms.” “South Park’s” Twisted Christian episode won best edited animated series. During his acceptance speech, editor David List said, “It was especially gratifying to work on these last 10 episodes because Trey and Matt really, really went for it. They challenged the boundaries of censorship and how far all of us can exercise our First Amendment rights, whether it’s political commentary, mocking celebrity or that expertly timed fart joke.” He added, “Our freedom of speech should ultimately be protected and celebrated regardless of political party affiliation.” Full list of winners below. EDITED FEATURE FILM (Drama, Theatrical) “Sinners” Michael P. Shawver BEST EDITED FEATURE FILM (Comedy, Theatrical) “One Battle After Another” Andy Jurgensen BEST EDITED ANIMATED FEATURE FILM “KPop Demon Hunters” Nathan Schauf BEST EDITED DOCUMENTARY FEATURE “The Perfect Neighbor” Viridiana Lieberman BEST EDITED DOCUMENTARY SERIES “Pee-wee as Himself – Part One” Damian Rodriguez BEST EDITED MULTI-CAMERA COMEDY SERIES “Frasier” (Murder Most Finch) Russell Griffin, ACE BEST EDITED SINGLE CAMERA COMEDY SERIES “The Studio” (The Promotion) Eric Kissack, ACE BEST EDITED DRAMA SERIES “The Pitt” (6pm) Mark Strand, ACE BEST EDITED FEATURE FILM (NON-THEATRICAL) “A Winter’s Song” Yvette M. Amirian, ACE BEST EDITED LIMITED SERIES “The Penguin” (A Great or Little Thing) Henk van Eeghen, ACE BEST EDITED REALITY SERIES “Conan O’Brien Must Go” (Austria) Matthew Shaw, ACE Brad Roelandt BEST EDITED VARIETY TALK/SKETCH SHOW OR SPECIAL “Saturday Night Live 50th Anniversary Special” Paul Del Gesso Christopher Salerno Ryan Spears Sean Mcilraith, ACE Ryan Mcilraith Daniel Garcia BEST EDITED ANIMATED SERIES “South Park” (Twisted Christian) David List Nate Pellettieri BEST EDITED SHORT “All The Empty Rooms” Erin Casper, ACE Stephen Maing Jeremy Medoff ANNE V. COATES AWARD FOR STUDENT EDITING Luis Barragan – California State University, Fullerton Box Office: Netflix’s ‘Stranger Things’ Series Finale Earns More Than $25 Million in Movie Theaters ‘Stranger Things’ and Prince: The Complicated Road to Bringing ‘When Doves Cry’ and ‘Purple Rain’ to the Show’s Finale ‘Stranger Things,’ ‘Squid Game’ Top Nielsen’s Most-Streamed Original Series of 2025 List David Harbour Exits Tony Gilroy’s Searchlight Drama ‘Behemoth!’ CBS Wins Nielsen’s Fall Multiplatform Ratings Among Broadcast, Led by ‘Tracker’ — but Netflix’s ‘Stranger Things’ Dominates Overall (EXCLUSIVE) ‘Stranger Things’ Star Jennifer Marshall Says She Was Surprised Not to Be Asked Back for Season 5, Notes It Came After Cancer Diagnosis Loading comments... More From Our Brands Rolling Stone Michael Jackson Estate Sued for Child Trafficking by Siblings Alleging More Than Decade of Abuse Robb Report Demi Lovato’s Former Villa Above the Sunset Strip Lists for $11 Million Sportico Miami of Ohio’s Perfect Hoops Run Sets Table for New $281M Arena"
    },
    {
      "title": "More Stories",
      "url": "https://deadline.com/2026/02/page/2/",
      "date_collected": "2026-02-28 07:16:34",
      "publication_date": "2026-02-01T00:00:00",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story Latest in Matthew Lillard Looks Back At ‘Scream’ & The Full-Circle Moment Returning As Stu Macher Scream turns 30 this year, and if you ask Matthew Lillard about it, he'll tell you he can't believe we're still talking about it. And yet, three decades after Scream redefined the modern slasher movie, it (and Lillard's unhinged performance as Stu Macher) remains embedded in pop culture. In a… By Scott Shilstone 8 hours ago Print Print Matthew Lillard Looks Back At ‘Scream’ & The Full-Circle Moment Returning As Stu Macher Read the full story Film WGA Condemns Paramount-WBD Merger, Says “Outcome Is The Same” As Netflix Deal It should come as no surprise that the Writers Guild of America is not pleased about the latest development in the Warner Bros. Discovery acquisition saga. After the news broke Thursday that Paramount had outbid Netflix for the legacy studio , the WGA East and West weighed in via a joint… By Katie Campione 8 hours ago Print Print WGA Condemns Paramount-WBD Merger, Says “Outcome Is The Same” As Netflix Deal Read the full story Business Story Arc: Paramount WB February 27, 2026 Paramount + WBD Vs. Coalition Of The Unwilling: CA AG Pulling Together Blue States Probe Of… February 27, 2026 Paramount Purchase Of Warner Bros. Discovery Stirs Angst At CNN – Again February 27, 2026 Movie Theater Org Cinema United Remains Firmly Against Paramount-Warner Bros Merger & Warns About… February 27, 2026 Massive Merger Confirmed: Paramount And WBD Reveal Details Of $110 Billion Deal WGA Pulls Back Curtain On State Of Health & Pension Plans Ahead Of AMPTP Negotiations Ahead of a March 16 start date for negotiations with the major studios, the Writers Guild of America has peeled back the curtain on the state of the union’s health and pension funds. As Deadline has previously reported, things aren’t looking good. In a joint memo to members on Friday , the WGA… By Katie Campione 8 hours ago Print Print WGA Pulls Back Curtain On State Of Health & Pension Plans Ahead Of AMPTP Negotiations Read the full story Business Susan Sarandon Says Hollywood Roles Dried Up After She “Spoke Out About Gaza”, Praises Spanish Government For “Moral Clarity” Oscar-winning actress Susan Sarandon is in Spain this weekend to collect a career achievement prize at the 40th Goya awards. Speaking at a press conference in Barcelona today, the decorated star discussed her support for Palestine — a cause close to the heart of the Spanish government — and… By Andreas Wiseman Feb 27, 2026 2:27 pm Print Print Susan Sarandon Says Hollywood Roles Dried Up After She “Spoke Out About Gaza”, Praises Spanish Government For “Moral Clarity” Read the full story Film Neil Sedaka Dies: “Breaking Up Is Hard To Do” & “Laughter In The Rain” Hitmaker Who Also Wrote “Love Will Keep Us Together” Was 86 Neil Sedaka, a multiple Grammy nominee and Songwriters Hall of Famer who wrote and sang on nine Top 10 hits including chart-toppers “Breaking Up Is Hard to Do,” “Laughter in the Rain” and “Bad Blood” and penned the 1975 smash “Love Will Keep Us Together,” died Friday in Los Angeles. He was… By Erik Pedersen Feb 27, 2026 2:15 pm Print Print Neil Sedaka Dies: “Breaking Up Is Hard To Do” & “Laughter In The Rain” Hitmaker Who Also Wrote “Love Will Keep Us Together” Was 86 Read the full story Music WME Group-Backed Pantheon Media Group Eyes New Investment EXCLUSIVE : Pantheon Media Group, the umbrella company behind series including Netflix's Sean Combs: The Reckoning docuseries and the upcoming BTS: The Comeback Live special, is on the lookout for some new investment. Deadline understands that the company, which was founded by Steve Michaels and r… By Peter White Feb 27, 2026 2:03 pm Print Print WME Group-Backed Pantheon Media Group Eyes New Investment Read the full story Exclusive Business Marlon Wayans Leaks ‘Scary Movie 6’ Trailer: “Just Bootlegged My Own Movie Trailer” As if having a Scream sequel and a Scary Movie in theaters the same year wasn’t enough of an aughts throwback, real fans will have to go to the cinema to see the trailer for the latter. While Paramount appears to be keeping the Scary Movie 6 trailer close to its chest, debuting ahead of Scream 7 … By Glenn Garner Feb 27, 2026 1:50 pm Print Print Marlon Wayans Leaks ‘Scary Movie 6’ Trailer: “Just Bootlegged My Own Movie Trailer” Read the full story Film Movie Theater Org Cinema United Remains Firmly Against Paramount-Warner Bros Merger & Warns About “Fewer Movies Being Made” Exhibitors weren’t in favor of a Netflix and Warner Bros marriage, and a Paramount-Warner Bros union isn’t going to change their minds. Theater owners trade org Cinema United President and CEO Michael O’Leary emphasized again Friday following this week’s Paramount-WB news that “We have been… By Anthony D'Alessandro Feb 27, 2026 1:45 pm Print Print Movie Theater Org Cinema United Remains Firmly Against Paramount-Warner Bros Merger & Warns About “Fewer Movies Being Made” Read the full story Box Office Story Arc: Paramount WB February 27, 2026 Paramount + WBD Vs. Coalition Of The Unwilling: CA AG Pulling Together Blue States Probe Of… February 27, 2026 Paramount Purchase Of Warner Bros. Discovery Stirs Angst At CNN – Again February 27, 2026 WGA Condemns Paramount-WBD Merger, Says “Outcome Is The Same” As Netflix Deal February 27, 2026 Massive Merger Confirmed: Paramount And WBD Reveal Details Of $110 Billion Deal ‘Bridgerton’ Season 4 Trio Unpacks “Different Paths” For Francesca And Michaela Following [SPOILER’s] Death: “It’s Double As Devastating” SPOILER ALERT: This post contains spoilers from Bridgerton Season 4 Part 2 on Netflx. Though Benedict Bridgerton (Luke Thompson) and Sophie (Yerin Ha) have finally found their happy ending, Francesca Bridgerton (Hannah Dodd) ends Season 4 thinking hers has come and gone. At the end of… By Dessi Gomez Feb 27, 2026 1:45 pm Print Print ‘Bridgerton’ Season 4 Trio Unpacks “Different Paths” For Francesca And Michaela Following [SPOILER’s] Death: “It’s Double As Devastating” Read the full story TV Massive Merger Confirmed: Paramount And WBD Reveal Details Of $110 Billion Deal It's official. For real this time. Warner Bros. Discovery is selling itself to Paramount for $31 a share in cash in a deal worth $110 billion. The companies unveiled their formal agreement on Friday. Paramount will hold a conference call and webcast on Monday at 8:30am ET to discuss the… By Jill Goldsmith Feb 27, 2026 1:37 pm Print Print Massive Merger Confirmed: Paramount And WBD Reveal Details Of $110 Billion Deal Read the full story Business Story Arc: Paramount WB February 27, 2026 Paramount + WBD Vs. Coalition Of The Unwilling: CA AG Pulling Together Blue States Probe Of… February 27, 2026 Paramount Purchase Of Warner Bros. Discovery Stirs Angst At CNN – Again February 27, 2026 WGA Condemns Paramount-WBD Merger, Says “Outcome Is The Same” As Netflix Deal February 27, 2026 Movie Theater Org Cinema United Remains Firmly Against Paramount-Warner Bros Merger & Warns About… On The Set Of ‘Peaky Blinders: The Immortal Man’: Cillian Murphy, Steven Knight & More On Upping Stakes For Explosive Movie That’s A Gift To Fans \"If you're gonna make a film of a TV show, it has to have all the bells and whistles, and you have to have that kind of cinematic magic dust, and I think we’re achieving that.\" That was star and producer Cillian Murphy speaking to me on the set of the Tom Harper-directed, Steven Knight-penned Peaky Bl… By Nancy Tartaglione Feb 27, 2026 1:15 pm Print Print On The Set Of ‘Peaky Blinders: The Immortal Man’: Cillian Murphy, Steven Knight & More On Upping Stakes For Explosive Movie That’s A Gift To Fans Read the full story Film ‘Scream 7’ Shrieking At Record Decibels With Franchise-Best $59M Debut – Box Office Update UPDATED FRIDAY MIDDAY: David Ellison can celebrate another win this weekend in addition to taking pole position with Warner Bros and that’s that Scream 7 is heading to a franchise opening record of $59M after a $28M Friday that includes previews. What the? Nope, no head-scratching needed. Give the Scr… By Anthony D'Alessandro Feb 27, 2026 1:07 pm Print Print ‘Scream 7’ Shrieking At Record Decibels With Franchise-Best $59M Debut – Box Office Update Read the full story Exclusive Box Office Previous page of stories Previous Next page of stories Next Sidebar Newswire PMC Deadline is a part of Penske Media Corporation. © 2026 Deadline Hollywood, LLC. All Rights Reserved. Powered by WordPress.com VIP Site"
    },
    {
      "title": "staff memo",
      "url": "https://deadline.com/2026/02/cnn-paramount-warner-bros-merger-1236738177/",
      "date_collected": "2026-02-28 07:16:33",
      "publication_date": "2026-02-01T00:00:00",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Ted Johnson Ted Johnson Political Editor @tedstew More Stories By Ted Paramount + WBD Vs. Coalition Of The Unwilling: CA AG Pulling Together Blue States Probe Of Mega-Merger Paramount Purchase Of Warner Bros. Discovery Stirs Angst At CNN – Again FCC Approves Charter’s Merger With Cox Enterprises View All February 26, 2026 4:46pm Story Arc Mark Thompson Photo by John Lamparski/Getty Images for Advertising Week New York With Paramount emerging as the winning bidder for a potential deal for Warner Bros. Discovery , one of its prizes would be CNN . That has triggered a new level of consternation at the network, not just because of the ever-present worries about cutbacks at a time of consolidation, but that CNN would be under the same corporate umbrella as CBS. The broadcast network’s news division is undergoing a transformation since the David Ellison-run Skydance acquired Paramount last year. Related Stories News That’s All, Folks: Netflix Walks Away From Warner Bros., Refusing To Raise Offer News WBD’s David Zaslav Wishes Netflix Well, “Can’t Wait” To Start Working With Paramount “Despite all the speculation you’ve read during this process, I’d suggest that you don’t jump to conclusions about the future until we know more,” CNN’s chairman and CEO Mark Thompson wrote to employees Thursday. Watch on Deadline He added, “And secondly let’s not forget our duty to our audience. We’re still near the start of what is already an incredibly newsy year at home and abroad, one that will culminate with critical U.S. midterm elections and who knows what else. Let’s continue to focus on delivering the best possible journalism to the millions of people who rely on us all around the world.” CNN’s Jake Tapper reported Netflix’s withdrawal from the process on his show on Thursday afternoon, telling viewers, “We have some breaking news internationally that affects everybody I’m looking at right now in the studio.” Democrats already are seeking answers from Ellison on whether he made any guarantees to Donald Trump about changes to CNN, which has long been one of the president’s targets. There also are concerns about editorial direction at CNN. At CBS, Skydance committed to hiring an ombudsman to take complaints about its news coverage. A former head of a conservative think tank, Kenneth Weinstein , was hired in that role. Ellison later tapped Bari Weiss , founder of the center-right site The Free Press, to serve as editor in chief of CBS News. He attended Trump’s State of the Union address this week, as a guest of Sen. Lindsey Graham (R-SC), one of the president’s allies. Under the Netflix-Warner Bros. deal, CNN and other cable networks would have ultimately been spun off into a separate entity. But Paramount’s proposal calls for buying all of Warner Bros. Discovery, creating a media giant. Jim Acosta, the former CNN anchor and host who launched his own media venture, posted on X, “As I’ve been warning, America now has state-compromised media. When 60 Min or CNN is in trouble, we’re all in trouble. Trump has cracked the code in how to hurt the press. Free speech is now at risk. MAGA corporations must not control the news. Support independent media.” Thompson’s full note is below: Dear All, Many of you will have already heard and seen our reporting about today’s two significant pieces of news: first that the board of our parent company Warner Bros. Discovery has decided that Paramount Skydance’s offer to purchase WBD is now the best offer in front of them, and second that Netflix has decided not to increase its own latest offer. David Zaslav is holding a WBD Town Hall Friday to discuss the news – you should already have received an invitation to that. We will hold our own CNN Town Hall as soon as possible after that to discuss next steps and to answer your questions to the best of our ability. I want to end this note with two thoughts: Despite all the speculation you’ve read during this process, I’d suggest that you don’t jump to conclusions about the future until we know more. And secondly let’s not forget our duty to our audience. We’re still near the start of what is already an incredibly newsy year at home and abroad, one that will culminate with critical U.S. midterm elections and who knows what else. Let’s continue to focus on delivering the best possible journalism to the millions of people who rely on us all around the world. Mark Is Par’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? David Zaslav Tries To Sell Par Deal To Shocked & Disappointed Staff At Town Hall ‘Scream 7’ Is Slaying: Pic Eyes Franchise-Best $59M In Opening Frame ‘Sinners’ ‘One Battle’ & ‘KPop Demon Hunters’ Take Top Film Prizes: Full List More from this Story Arc Paramount WB February 27, 2026 Paramount + WBD Vs. Coalition Of The Unwilling: CA AG Pulling Together Blue States Probe Of Mega-Merger February 27, 2026 Paramount Purchase Of Warner Bros. Discovery Stirs Angst At CNN – Again View All Story Arc Read More About: 15 Comments"
    },
    {
      "title": "Netflix ceded the fight for Warner Bros. to Paramount",
      "url": "https://deadline.com/2026/02/netflix-declines-to-raise-offer-for-warner-bros-1236738005/",
      "date_collected": "2026-02-28 07:16:32",
      "publication_date": "2026-02-01T00:00:00",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Jill Goldsmith Jill Goldsmith Co-Business Editor More Stories By Jill ‘The Napa Boys’, ‘Idiotka’ & Japan’s First Interactive Anime New In Limited Release, ‘Elvis Presley In Concert’ Expands – Specialty Preview Netflix Banks A Quick $2.8 Billion As Paramount Pays WBD Termination Fee; Streamer’s Shares Rise Another 14% Netflix Walks With A Cool $2.8 Billion Breakup Fee: Who Gets What In New Paramount-WBD Merger Proposal View All February 26, 2026 2:55pm Story Arc David Zaslav, Ted Sarandos, Greg Peters and David Ellison Getty Images Netflix has thrown in the towel and won’t be raising its offer for Warner Bros . to match a rival bid by Paramount — game-changing news that caps several days of action around the bidding war. The move comes two hours after Warner Bros. Discovery said it determined that the latest offer it received from Paramount was superior to the $82.7 billion deal it signed with Netflix on December 5. Related Stories News WBD’s David Zaslav Wishes Netflix Well, “Can’t Wait” To Start Working With Paramount News With Netflix Out, Cory Booker Calls For David Ellison To Testify On A Paramount-WBD Deal Netflix still had four business days to match Paramount’s offer but decided, why wait? Co-CEOs Ted Sarandos and Greg Peters regretfully took the company out of the running, saying, “We’ve always been disciplined, and at the price required to match Paramount Skydance’s latest offer, the deal is no longer financially attractive.” Read a joint statement from the two executive below. Netflix investors are relieved, no regrets. The stock is up 10%. The drama began six month ago, and truth be told, Paramount was in there first as CEO David Ellison set his sights on Warner Bros Discovery almost immediately after closing the Skydance-Paramount merger in August. He began making rapid-fire offers , all rejected , pushing the WBD board to open things up with a formal auction process that resulted in four offers — from Paramount, Netflix, Comcast and one mystery bidder never specified. “This transaction was always a ‘nice to have’ at the right price, not a ‘must have’ at any price.” — Netflix co-CEOs Ted Sarandos and Greg Peters WBD clinched a a deal to sell Warner Bros’.’ streaming and studio assets to Netflix, a major departure for the streamer that tends to grow organically. Paramount launched a hostile tender offer , threatened a proxy fight and things got noisy. It sweetened its offer several times but continually was rebuffed by WBD until this week. A seven-day negotiating window ended with a new offer that Warner felt was superior to the Netflix deal. Paramount raised its offer price to $31 a share in cash, from $30, but also addressed other concerns raised by the WBD including around financing guarantees. The two sides now are working on the text of a final agreement, which would need approval by WBD shareholders and a green light from regulators in the U.S. and other territories. Hollywood players, Wall Streeters, public interest groups guilds and lawmakers will know, definitively, where to direct their fire. Netflix issued this statement from its co-CEOs Sarandos and Peters: The transaction we negotiated would have created shareholder value with a clear path to regulatory approval. However, we’ve always been disciplined, and at the price required to match Paramount Skydance’s latest offer, the deal is no longer financially attractive, so we are declining to match the Paramount Skydance bid. Warner Bros. is a world-class organization, and we want to thank David Zaslav, Gunnar Wiedenfels, Bruce Campbell, Brad Singer and the WBD Board for running a fair and rigorous process. We believe we would have been strong stewards of Warner Bros.’ iconic brands, and that our deal would have strengthened the entertainment industry and preserved and created more production jobs in the U.S. But this transaction was always a ‘nice to have’ at the right price, not a ‘must have’ at any price. Netflix’s business is healthy, strong and growing organically, powered by our slate and best-in-class streaming service. This year, we’ll invest approximately $20 billion in quality films and series and will expand our entertaining offering. Consistent with our capital allocation policy, we’ll also resume our share repurchase program. We will continue to do what we’ve done for more than 20 years as a public company: delight our members, profitably grow our business, and drive long-term shareholder value. Is Par’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? David Zaslav Tries To Sell Par Deal To Shocked & Disappointed Staff At Town Hall ‘Scream 7’ Is Slaying: Pic Eyes Franchise-Best $59M In Opening Frame ‘Sinners’ ‘One Battle’ & ‘KPop Demon Hunters’ Take Top Film Prizes: Full List More from this Story Arc Netflix WB February 26, 2026 Ted Went All That Way For Nuthin’: Netflix Lost WB While Sarandos Was Pitching Deal At The White House February 26, 2026 Warner Bros Discovery Board Calls Paramount’s Offer “Superior,” Now Netflix Has Four Days To Match View All Story Arc Read More About: 130 Comments"
    },
    {
      "title": "Movie Theater Org Cinema United Remains Firmly Against Paramount-Warner Bros Merger & Warns About…",
      "url": "https://deadline.com/2026/02/paramount-warner-bros-merger-movie-theaters-1236739020/",
      "date_collected": "2026-02-28 07:16:31",
      "publication_date": "2026-02-01T00:00:00",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Anthony D'Alessandro Anthony D'Alessandro Editorial Director/Box Office Editor @AwardsTony More Stories By Anthony Sony Pictures Classics Continues Sundance Buying Streak With Jon Hamm, John Slattery & Zoey Deutch Pic ‘Gail Daughtry And The Celebrity Sex Pass’ Movie Theater Org Cinema United Remains Firmly Against Paramount-Warner Bros Merger & Warns About “Fewer Movies Being Made” ‘Scream 7’ Shrieking At Record Decibels With Franchise-Best $59M Debut – Box Office Update View All February 27, 2026 1:45pm Story Arc Getty Images; Cinema United Exhibitors weren’t in favor of a Netflix and Warner Bros marriage, and a Paramount-Warner Bros union isn’t going to change their minds. Theater owners trade org Cinema United President and CEO Michael O’Leary emphasized again Friday following this week’s Paramount-WB news that “We have been clear from the outset about our concerns around consolidation, and nothing that has occurred within the past 36 hours has changed that. Studio consolidation historically leads to fewer movies being made, and at this juncture, there is no reason to believe the outcome here will be any different. We continue to urge regulators to heed the lessons of the past.” Related Stories News Massive Merger Confirmed: Paramount And WBD Reveal Details Of $110 Billion Deal Executives Is Paramount’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? O’Leary’s official comment on the Paramount -Warner Bros merger was made as the former confirmed details of the proposed $110 billion deal this afternoon. Watch on Deadline “We will invest in expanding the creative engines at the core of both WBD and Paramount. We will maintain both studios while prioritizing the attraction and retention of world-class creative talent, strengthening our ability to deliver a broad pipeline of high-quality content, including 15 theatrical feature films per year per studio, for our combined platforms and third-party distribution partners,” read a Paramount press release about the merger. While there was agita over Netflix potentially crushing the theatrical window despite the streamer co-CEO Ted Sarandos promising a 45-day exclusive theatrical window (despite his actions in handling theatrical films in the past), the worry now is that Paramount won’t be able to keep its promise for 30 movies a year. The math doesn’t math out for many in the industry: How do you appease filmmakers and explain that their tentpole is following another tentpole on the calendar? There’s also the situation that 30 slots may not be available."
    },
    {
      "title": "WGA Condemns Paramount-WBD Merger, Says “Outcome Is The Same” As Netflix Deal",
      "url": "https://deadline.com/2026/02/wga-reaction-paramount-wbd-merger-1236739121/",
      "date_collected": "2026-02-28 07:16:29",
      "publication_date": "2026-02-01T00:00:00",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Katie Campione Katie Campione TV Reporter @katie_campione More Stories By Katherine WGA Condemns Paramount-WBD Merger, Says “Outcome Is The Same” As Netflix Deal ‘A Knight Of The Seven Kingdoms’ Finale Summons Series’ Best Audience So Far With 9.5M U.S. Viewers In 3 Days ‘The Hunting Wives’ Adds Casey Mills As Recurring Guest For Season 2 View All February 27, 2026 2:51pm Story Arc Mario Tama/Getty Images It should come as no surprise that the Writers Guild of America is not pleased about the latest development in the Warner Bros. Discovery acquisition saga. After the news broke Thursday that Paramount had outbid Netflix for the legacy studio , the WGA East and West weighed in via a joint statement on Friday, once again condemning any act of corporate consolidation. Related Stories News Massive Merger Confirmed: Paramount And WBD Reveal Details Of $110 Billion Deal News David Zaslav Tries To Sell Paramount Deal To Shocked & Disappointed Employees At Town Hall: “We’re The Envy Of All Of The Industry” “The combination is different but the outcome is the same: the proposed Paramount-Warner merger would consolidate control of two major film and television studios and streaming services, and two of the largest employers of writers,” the statement read. “The loss of competition would be a disaster for writers, consumers and the entire entertainment industry. This merger must be blocked.” This is similar to the sentiment from the writers guild since Netflix first struck a deal for Warner Bros. in December, calling the move “what antitrust laws were designed to prevent.” Watch on Deadline So far, all the other Hollywood-adjacent unions have declined to comment about this recent news. Many have expressed concerns about any potential merger, but none have taken a hard-line position the way that the WGA has. During a conversation with reports in January, DGA President Christopher Nolan acknowledged “in an ideal world it would continue to function as an independent buyer [and] distributor. That would be the best thing for all members.” However, he also urged that union leadership is “trying to evaluate the reality of this situation.” As of Friday, Warner Bros. Discovery is selling itself to Paramount for $31 a share in cash in a deal worth $110 billion. The companies unveiled their formal agreement on Friday, after WBD jilted Netflix, saying it received a Superior Proposal from the David Ellison company. Netflix had four days to match but declined immediately and walked away, leaving Paramount triumphant after a months-long hostile takeover attempt to pry apart its rivals. Is Par’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? David Zaslav Tries To Sell Par Deal To Shocked & Disappointed Staff At Town Hall ‘Scream 7’ Is Slaying: Pic Eyes Franchise-Best $59M In Opening Frame ‘Sinners’ ‘One Battle’ & ‘KPop Demon Hunters’ Take Top Film Prizes: Full List More from this Story Arc Paramount WB February 27, 2026 Paramount + WBD Vs. Coalition Of The Unwilling: CA AG Pulling Together Blue States Probe Of Mega-Merger February 27, 2026 Paramount Purchase Of Warner Bros. Discovery Stirs Angst At CNN – Again View All Story Arc Read More About: 5 Comments"
    },
    {
      "title": "Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal",
      "url": "https://deadline.com/2026/02/massive-merger-confirmed-paramount-and-wbd-reveal-details-1236738785/",
      "date_collected": "2026-02-28 07:16:28",
      "publication_date": "2026-02-01T00:00:00",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Jill Goldsmith Jill Goldsmith Co-Business Editor More Stories By Jill ‘The Napa Boys’, ‘Idiotka’ & Japan’s First Interactive Anime New In Limited Release, ‘Elvis Presley In Concert’ Expands – Specialty Preview Netflix Banks A Quick $2.8 Billion As Paramount Pays WBD Termination Fee; Streamer’s Shares Rise Another 14% Netflix Walks With A Cool $2.8 Billion Breakup Fee: Who Gets What In New Paramount-WBD Merger Proposal View All February 27, 2026 1:37pm Story Arc David Ellison Eamonn M. McCormack/Getty Images for Paramount Pictures It’s official. For real this time. Warner Bros. Discovery is selling itself to Paramount for $31 a share in cash in a deal worth $110 billion. The companies unveiled their formal agreement on Friday. Paramount will hold a conference call and webcast on Monday at 8:30am ET to discuss the deal. Related Stories News David Zaslav Tries To Sell Paramount Deal To Shocked & Disappointed Employees At Town Hall: “We’re The Envy Of All Of The Industry” Executives Is Paramount’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? The formal announcement comes after WBD jilted Netflix, saying it received a Superior Proposal from the David Ellison company. Netflix had four days to match but declined immediately and walked away, leaving Par triumphant after a months-long hostile takeover attempt to pry apart its rivals. Paramount said the merged company is committed to producing a minimum of 30 theatrical films annually — 15 per studio per year. It promised film will receive a full theatrical release, with a minimum 45-day window globally and the current industry standard home video window prior to availability on subscription streaming services. Doubts around Netflix’s ultimate commitment to theatrical and intermediate windows was a major concern fo exhibitors and many in the Hollywood community. Watch on Deadline The merger is expected to close in the third quarter of 2026, subject regulatory clearances and approval by WBD shareholders, with a vote expected in the early spring. Paramount expects over $6 billion in cost synergies, short for cost savings. It cited a “combination of: technology integration (such as migrating the combined company to a single enterprise resource planning system and consolidating streaming technology stacks), corporate-wide efficiencies, including procurement savings, optimizing the combined real estate footprint, and otherwise streamlining operational efficiencies.” Many industry players anticipate thousands of layoffs. The transaction is funded by $47 billion in equity fully backed by the Ellison Family and RedBird Capital Partners. At closing, the equity may include other strategic and financial partners. Paramount did not name them but its previous hostile tender offer included backing from the Public Investment Fund (Kingdom of Saudi Arabia), L’imad Holding Company PJSC (Abu Dhabi) and Qatar Investment Authority (Qatar). Affinity Partners, the investment fund of President Donald Trump’s son-in-law Jared Kushner , had also been involved but withdrew. Ditto for China’s Tencent. Under the terms of the equity commitments, new shares of Class B Paramount stock will be issued at a price of $16.02 per share. In addition to the new cash equity investment, the transaction is backed by $54 billion of debt commitments from Bank of America, Citigroup, and Apollo, which includes $15 billion to backstop WBD’s existing bridge facility and $39 billion of incremental new debt. The $54 billion excludes $3.5 billion of bridge financing from these institutions to backstop an existing $3.5 billion revolving credit facility. The combined company will own a film library of more than 15,000 titles and thousands of hours of television programming with franchises including Harry Potter , Mission Impossible , Lord of the Rings, Game of Thrones, the DC Universe, Teenage Mutant Ninja Turtles , Transformers, Star Trek and SpongeBob SquarePants . Combined sports rights will include the NFL, Olympics, UFC, PGA Tour, NHL, Big Ten and Big 12 Football, NCAA College Basketball, and Champions League, with the ability to distribute these rights collectively across all of its platforms. The merged company will have a massive portfolio of cable networks. That will include CNN, to the alarm of some lawmakers and many in the news business given shifts at CBS since David Ellison acquired control. The new company will inherit a diverse international portfolio from the former Discovery Communications, present in over 200 countries and territories with cable and free-to-air networks. Ellison, the son of Oracle co-founder Larry Ellison, has stressed technology and today’s announcement promised streamlining of “the technological underpinning of every aspect of the combined company’s businesses.” Paramount said it will be well-positioned to invest in growth, noting marquee deals since the Skydance merger with Trey Parker and Matt Stone of South Park , the UFC, the Duffer Brothers and Activision. However, Wall Streeters have noted it will carry a huge amount of debt that may constrain investment. “From the very beginning, our pursuit of Warner Bros. Discovery has been guided by a clear purpose: to honor the legacy of two iconic companies while accelerating our vision of building a next-generation media and entertainment company. By bringing together these world-class studios, our complementary streaming platforms, and the extraordinary talent behind them, we will create even greater value for audiences, partners and shareholders — and we couldn’t be more excited for what’s ahead,” said Paramount CEO David Ellison. “I’m very pleased with the outcome we achieved for WBD shareholders and the entertainment industry. Our guiding principle throughout this process has been to secure a transaction that maximizes the value of our iconic assets and our century-old studio while delivering as much certainty as possible for our investors. We look forward to working with Paramount to complete this historic transaction,” saoid WBD CEO David Zaslav . Is Par’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? David Zaslav Tries To Sell Par Deal To Shocked & Disappointed Staff At Town Hall ‘Scream 7’ Is Slaying: Pic Eyes Franchise-Best $59M In Opening Frame ‘Sinners’ ‘One Battle’ & ‘KPop Demon Hunters’ Take Top Film Prizes: Full List More from this Story Arc Paramount WB February 27, 2026 Paramount + WBD Vs. Coalition Of The Unwilling: CA AG Pulling Together Blue States Probe Of Mega-Merger February 27, 2026 Paramount Purchase Of Warner Bros. Discovery Stirs Angst At CNN – Again View All Story Arc Read More About: 16 Comments"
    },
    {
      "title": "‘Survivor 50’ Helps CBS To Best Wednesday In Four Years",
      "url": "https://deadline.com/2026/02/survivor-50-cbs-ratings-1236739119/",
      "date_collected": "2026-02-28 07:16:27",
      "publication_date": "2026-02-27T23:00:00",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Peter White Peter White Executive Editor, Television @peterzwhite More Stories By Peter WME Group-Backed Pantheon Media Group Eyes New Investment ‘Monopoly’: Studio Lambert Passes Go At Netflix After Winning Bake-Off For Reality Game Show ‘Love Island USA’ EP Jordana Hochman Reupped At ITV America View All February 27, 2026 3:00pm Survivor 50: Chrissy Hofbeck, Benjamin \"Coach\" Wade, Mike White, Dee Valladares, Tiffany Ervin. Gail Schulman/CBS The planning for Survivor 50 has been in the works for over two years and it has seemingly paid off. The premiere episode of the evergreen reality series helped CBS to its most-watched Wednesday night in four years, since the finale episode of Season 42 on May 25, 2022. The three-hour opener (yes, three hours) was the night’s number one show in both total viewers and adults aged 25-54, averaging 5.06M viewers. It peaked with 6.18m viewers in its first half-hour but held on to at least 90% of its audience each subsequent half-hour, per Nielsen. Related Stories Casting Ashley Tisdale To Star In Co-Parenting Comedy 'You're Only Young Twice' In Early Development At CBS Casting Rob McClure, Joe Morton & Steven Pasquale Join CBS's 'Cupertino' It was up 26% from its fall 2025 premiere in total viewers and up +19% from its spring 2025 premiere. Watch on Deadline CBS said that its total viewership on the night was 81% higher than second-place NBC. The 50th iteration of the Jeff Probst-fronted show featured some of the show’s best-known stars over the years including The White Lotus creator Mike White. Joining White in Fiji in the race to $1M were Jenna Lewis-Dougherty, Colby Donaldson, Stephenie Lagrossa Kendrick, Cirie Fields, Ozzy Lusth, Benjamin Wade, Aubry Bracco, Chrissy Hofbeck, Christian Hubicki, Angelina Keeley, Rick Devens, Jonathan Young, Dee Valladares, Emily Flippen, Q Burdette, Tiffany Ervin, Charlie Davis, Genevieve Mushaluk, Kamilla Karthigesu, Kyle Fraser, Joseph Hunter, Savannah Louie and Rizo Velovic. In the episode, Lewis-Dougherty, from Season 1, was the first to be voted out, despite her trying to get Fields booted. “First in, first out,” she said. Fraser, whp won Season 48, unfortunately also left after injuring his ankle during the challenge. Mark Burnett, Jeff Probst, Matt VanWagenen, Kahaia Pearson and Jesse Jensen exec produce the series, which returns next week with a one and a half-hour episode, leading in to Padma Lakshmi’s America’s Culinary Cup. Is Par’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? David Zaslav Tries To Sell Par Deal To Shocked & Disappointed Staff At Town Hall ‘Scream 7’ Is Slaying: Pic Eyes Franchise-Best $59M In Opening Frame ‘Sinners’ ‘One Battle’ & ‘KPop Demon Hunters’ Take Top Film Prizes: Full List Read More About: Comments"
    },
    {
      "title": "Paramount Purchase Of Warner Bros. Discovery Stirs Angst At CNN – Again",
      "url": "https://deadline.com/2026/02/cnn-angst-paramount-warner-bros-deal-1236738793/",
      "date_collected": "2026-02-28 07:16:26",
      "publication_date": "2026-02-27T23:35:27",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Ted Johnson , Dominic Patten February 27, 2026 3:35pm Story Arc CNN chairman and CEO Mark Thompson Getty Just hours after Netflix ceded the fight for Warner Bros. to Paramount , CNN ‘s CEO Mark Thompson tried to alleviate anxieties over the pending new owners in a staff memo : “Despite all the speculation you’ve read during this process, I’d suggest that you don’t jump to conclusions about the future until we know more.” Newsrooms, though, are notoriously made up of skeptics, for good reason in an environment of layoffs and buyouts, and, more recently, corporate efforts to woo President Donald Trump. Despite Thompson’s message, the mood among many at the cable news network on Friday was “beyond bleak,” per one source. Related Stories News Massive Merger Confirmed: Paramount And WBD Reveal Details Of $110 Billion Deal News With Paramount As A Potential New Owner, CNN CEO Mark Thompson Urges Employees, “Don’t Jump To Conclusions About The Future” Paramount has yet to comment on its specific plans for the network after emerging as the winner for WBD , but in the months since Warner Bros Discovery put itself up for sale, there has been rampant speculation about what life will look like if the David Ellison-led company owned CNN. Watch on Deadline Fears only accelerated after the Wall Street Journal reported in December that Ellison made assurances to Trump that he would make major changes to the network, long a target of the president’s. Ellison’s appearance at Trump’s State of the Union address , as a guest of one of his most stalwart congressional supporters, Sen. Lindsey Graham (R-SC), probably didn’t help soothe fears of the network’s future editorial direction. “There should be a lot of concern and consternation,” said Frank Sesno, professor at the George Washington School of Media and Public Affairs and former Washington bureau chief for CNN. When Sesno was at the network, he went through two mergers, when Time Warner acquired the network in 1995 and then when AOL bought Time Warner in 2000. Each time, he said, the question was whether corporate interests align and whether that values journalism. This time is different, he said. “Does CNN’s unique global presence matter?” Sesno said. “Given all the politics, and the sturm and drang around the Ellisons, and what we know and what was said, there is reason to be concerned.” As the bidding process was playing out last year, much of the D.C. consensus was that Paramount would emerge the winner, leaving the company with two major news organizations, CBS News and CNN. In the eyes of one veteran, that development could prove to be worse for CBS News than CNN, in part because the latter is heavily unionized, at a time when Paramount will be under pressure to massively reduce costs. Sesno said that the three major areas of concern are the editorial direction, how Paramount combines resources to save money, and the organizational structure. He said that most concerning are the political pressures, as “the Ellisons have made no pretense of being chums with Donald Trump and Donald Trump made no pretense of who he wanted to see victorious in this merger.” Yet Another Period Of Uncertainty CNN finds itself in yet another period of uncertainty, with its parent company already sold twice in the past decade. During his first term, the Justice Department sued to block AT&T’s purchase of CNN parent Time Warner, the companies sought to mount a defense of retaliation due to Trump’s hatred of the news network. The DOJ denied it, and the judge declined to allow such an argument. Although AT&T prevailed, the suspicion of Trump’s influence lingered. What’s different about Trump 2.0 is the extent to which efforts to lobby the president for favorable treatment are much more blatant. Trump himself had said that he would be involved in whether the deal gets regulatory approval, breaking from a presidential tradition of keeping arm’s length. Although he later said that he would leave it to the DOJ to decide, earlier this week he was demanding that Netflix fire Susan Rice , one of its board members. The anxiousness over the situation also stems from the way that Skydance’s purchase of Paramount Global went down last year. As they sought to get the deal through regulatory approval, the previous Paramount owners settled Trump’s lawsuit against CBS for $16 million, even though the litigation, over the way that 60 Minutes edited an interview with Kamala Harris, was seen by many legal experts as baseless. As it sought the FCC’s greenlight, Skydance committed to an ombudsman to take newsroom complaints. The new Paramount then hired Bari Weiss , founder of the center-right opinion site The Free Press, to take charge of the news division as editor in chief. A number of her changes outlined in her strategy have been directed at regaining a footing as viewer habits shift to streaming and social media, the same challenge that other legacy news outlets have tried to address. But Weiss also put a heavy emphasis on rebuilding trust, a problem that certainly bears out in polls. The Problem Of Trust Sesno said that he agrees that is a major problem for news organizations, not just those that may be perceived as leaning to the left but to those leaning to the right. Where he cautions is over the implication that “in order to build trust, you need to avert your gaze from holding everyone’s feet to the fire.” “We have a false equivalency here that creates confusion in the public’s mind and oversimplifies the problem and the challenge that confronts people seeking to do journalism in the way that it is meant to be done,” he said. The actions to address the problem of trust can in turn create plenty of consternation in news divisions: The assumption often is that it means a shift rightward, something that in turns triggers extra scrutiny from audiences on the left, who may be the more loyal viewers. As CBS News has laid off employees and offered buyouts, some have gone out with stinging rebukes of the new strategy. According to the Guardian , producer Mary Walsh, departing after 46 years this week, wrote to staffers that “maybe it’s for the best. We’ve been told to aim our reporting at a particular part of the political spectrum. Honestly, I don’t know how to do that.” In announcing the merger on Friday afternoon, Paramount’s release touted of being able to “offer complementary portfolio of cable networks spanning entertainment, sports and news will significantly improve cash flow, unlock efficiencies, and strengthen our ability to manage linear market pressures.” There were no specific commitments for CNN. “I’m very worried about the people there,” said Jim Acosta, the former CNN anchor and chief White House correspondent who left last year and launched his own media company. “From everything I hear many of the staffers at CNN work with perpetual job fear. And now this …” Is Par’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? David Zaslav Tries To Sell Par Deal To Shocked & Disappointed Staff At Town Hall ‘Scream 7’ Is Slaying: Pic Eyes Franchise-Best $59M In Opening Frame ‘Sinners’ ‘One Battle’ & ‘KPop Demon Hunters’ Take Top Film Prizes: Full List More from this Story Arc Paramount WB February 27, 2026 Paramount + WBD Vs. Coalition Of The Unwilling: CA AG Pulling Together Blue States Probe Of Mega-Merger February 27, 2026 WGA Condemns Paramount-WBD Merger, Says “Outcome Is The Same” As Netflix Deal View All Story Arc Read More About: 2 Comments"
    },
    {
      "title": "Paramount + WBD Vs. Coalition Of The Unwilling: CA AG Pulling Together Blue States Probe Of Mega-Merger",
      "url": "https://deadline.com/2026/02/paramount-warner-bros-california-blue-states-1236739027/",
      "date_collected": "2026-02-28 07:16:25",
      "publication_date": "2026-02-27T23:53:38",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Dominic Patten , Ted Johnson February 27, 2026 3:53pm Story Arc Paramount & Warner Bros. studio water towers; state flag of California Justin Sullivan / Mario Tama / Getty Images The clock is ticking on the Paramount and Warner Bros Discovery mega-merger, literally, and things could get sticky and expensive if California’s Attorney General has his way. Tweeting the not-so quiet thing out loud today, Rob Bonta revealed he is in talks with other state (read Blue State) AGs about concerns they have on the absorption of WBD into the corporation owned by Donald Trump ‘s “good friends” David Ellison and his Oracle found father Larry Ellison. Related Stories News The Battle For Warner Bros May Be Over, But Regulatory Scrutiny Of Paramount’s Deal Is Not News Paramount-Warner Bros Discovery Deal: Experts Say Trump Factor Will Have Bearing On EU Antitrust Process “I’m in conversation with my AG colleagues about Paramount/Warner Bros,” the Golden State’s top lawman replied to Mark Ruffalo today. “As the epicenter of the entertainment industry, California has a special interest in protecting competition,” Bonta added in response to the progressively inclined Marvel star’s response to a previous February 26 posting by the Attorney General. Watch on Deadline Mark, I hear you. I’m in conversation with my AG colleagues about Paramount/Warner Bros. As the epicenter of the entertainment industry, California has a special interest in protecting competition. https://t.co/Av74BFnEsi — Rob Bonta (@AGRobBonta) February 27, 2026 As for Ruffalo himself, who has on more than one occasion ruffled a few feathers with his advocacy, red carpet label pins and outspokenness, the Hulk actor suggested to Bonta to put together a posse. “Please let’s circle up all the State AG’s and talk about how this is going to kill completion in the industry and drive down wages, and product quality for consumers,” Ruffalo posted last night after news of Netflix dropping out of the battle for WBD and Paramount’s 11th hour $110 billion hostile takeover bid getting the Warner’s board nod. “There are lots of agents in Hollywood who can tell you how past mergers and consolidations have hurt their clients and business. There is lots of talent that can tell you the same.” Having already put the brakes late Thursday on any victory laps by Ellison and that other David, WBD CEO David Zaslav in Paramount’s tentative win for all of WBD over Netflix with a stern “not a done deal,” Bonta is now emerging as the top interrogator of this latest Tinseltown Mother Boxes meld. The CA AG’s office didn’t get back to Deadline on what the status of those talks with other state AGs were and who was talking to who. However, sources in Sacramento tell me that it is pretty much the usual suspects of New York, Washington, Virginia and Pennsylvania at this point, with more on the go. Any attempt by state AGs to stop or slow down the Paramount and WBD meld would likely fit in to a competition and consolidation attack. Simply put, in the eyes of Blue State Justice Departments and maybe more, one big PARA-WBD would mean less places for filmmakers and producers to sell to and more power in the hands of one entity to set rates, prices and output. Without any irony on either side, that was pretty much the core of the claims MAGA and others made against Netflix when they were still aiming to buy WB. California Attorney General Rob Bonta at the U.S. Capitol on Nov. 6, 2025 (Photo:Getty) As well as fellow Blue Staters, Bonta is also talking to Dems in DC in terms of strategic coordination. Certainly, that tracks with the fiery words Friday of the usually circumspect Sen, Chris Murphy (D-CT) that federal Democrats “are going to break up these anti-democratic information conglomerates” once they get the majority in Congress and in 2028 back in the White House. Sen. Murphy’s pointed remarks follow the likes of Sen. Elizabeth Warren (D-MA) and Sen. Cory Booker (D-NJ) throwing antitrust shade on Paramount talking over WBD and the role and influence of the CNN-hating Trump administration on the deal and the outcome. With MAGA plans to derail “woke” Netflix from scooping up the WB crown jewels a success, Red State AGs are mute now on their insistence of earlier this week that federal AG Pam Bondi dig deep into possible Sherman Act violations by the streamer. In that context, a February 20 launched monopoly and antitrust probe by the DOJ into Netflix seems moot now. Even before there was a WBD deal for them, Paramount a week ago announced that it had moved past a DOJ antitrust examination and the necessary waiting period. Additionally, moving things along nicely for PSKY for a deal that Zaslav says will close in a year, a March 4 hearing before the Senate’s antitrust subcommittee, which roasted Netflix co-CEO Ted Sarandos earlier this month, has been canceled. That move by Sen. Mike Lee (R-UT) came as Sen. Booker unsuccessfully sought to have David Ellison show up to testify. The PARA-WBD deal as it stands, has some big baked in payout penalty fees, like the $2.8 billion Paramount already handed Netflix today and the $7 billion the Ellison-owned studio will have to give WBD if the deal fails its regulatory requirements. Also, adding up to millions and millions pretty quickly, there’s a daily “ticking fee” of $0.25 per share per quarter that starts taking effect on September 30, 2026 if the deal hasn’t been finalized by then. So, lots of moving pieces, and lots of AGs. Is Par’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? David Zaslav Tries To Sell Par Deal To Shocked & Disappointed Staff At Town Hall ‘Scream 7’ Is Slaying: Pic Eyes Franchise-Best $59M In Opening Frame ‘Sinners’ ‘One Battle’ & ‘KPop Demon Hunters’ Take Top Film Prizes: Full List More from this Story Arc Paramount WB February 27, 2026 Paramount Purchase Of Warner Bros. Discovery Stirs Angst At CNN – Again February 27, 2026 WGA Condemns Paramount-WBD Merger, Says “Outcome Is The Same” As Netflix Deal View All Story Arc Read More About: 2 Comments"
    },
    {
      "title": "Can Oscar Voters Be Trusted? Plus, From Hawke To Hudson To Byrne To Madigan, This Year’s Top Underdogs – Notes On The Season",
      "url": "https://deadline.com/2026/02/oscars-voting-trust-hawke-hudson-byrne-madigan-underdogs-1236738801/",
      "date_collected": "2026-02-28 07:16:24",
      "publication_date": "2026-02-27T23:56:42",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Pete Hammond Pete Hammond Awards Columnist/Chief Film Critic @DeadlinePete More Stories By Pete ‘Scream 7’ Review: Neve Campbell Is Back In Bloody Good Style For Fun, Nostalgia-Tinged Sequel In Venerable Horror Franchise BAFTA Confirms ‘One Battle’s Dominance, Throws Supporting Races Into More Disarray And Jump-Starts Robert Aramayo’s Oscar Campaign For Next Year – Hammond Analysis Is There An Upset Looming At BAFTA Awards? Plus, Disney’s Asad Ayaz On Studio’s Oscar Hopes For 2025’s Biggest Movie – Notes On The Season View All February 27, 2026 3:56pm Getty Images A column chronicling conversations and events on the awards circuit. Ballots are now in the hands — or laptops, actually — of the nearly 10,000 eligible voters of the Academy of Motion Picture Arts and Sciences, and they have only this weekend and a few days after until March 5 to turn in their individual verdicts. That comes after a long season where the impact of the Oscar race has stretched out almost a full year if you consider that Sinners , with an all-time record 16 Oscar nominations , opened April 17, 2025, almost 11 months to the day of the 98th annual Academy Awards taking place on March 15, 2026. Then you had Cannes way back in May, when four of the five nominees for Best International Feature made their world premieres — including two Best Picture nominees in Sentimental Value and The Secret Agent , which between them represent 13 nominations overall. And then in June, Apple and Warner Bros unveiled F1 , another Best Picture nominee. Finally what is considered the “official” start of Oscar season came around with the fall-festival trifecta of Venice/Telluride/Toronto and the 6 1/2-month campaigns began in earnest. But don’t kid yourself, this has become a year-round adventure. Related Stories News Oscar Nominations 2026: ‘Sinners’ Leads With Record 16, ‘One Battle’ Next – The Complete List Below The Line 2026 Awards Season Calendar: Dates For Oscars, Guilds, Tonys & More So now it is all up to the voters, who have a new wrinkle in the process this year. They are supposed to swear under oath that they have seen all the movies they are voting on. Okay, that may be an exaggeration. AMPAS members don’t have to “swear under oath,” they simply have to attest to the fact that they have actually either viewed the nominees in a theater, in the Academy’s digital screening room (where technology can affirm the film was played, if not actually watched, by the voter in question), or have seen it by some other method. Essentially this is all on the honor system and was needed because it has become all too apparent that just a very few of those films eligible for Oscars in any given year are really being seen by large swaths of voters, and by extension don’t have a fighting chance of being nominated. The Television Academy has done this in various ways, also on the honor system, but in some years fortified with signed affidavits for each category. Watch on Deadline (Clockwise from top left) ‘Sinners’, ‘Hamnet’, ‘ One Battle After Another ‘ and ‘Sentimental Value’ Warner Bros./Focus Features/Neon This new system was developed to encourage members to watch the movies they are given the task of voting on. The trend has been fewer films dominating the nominations, and the numbers bear that out, indicating voters are only concentrating on a few titles. Excluding the three Short and Documentary Feature categories, there are a mere 30 film titles stretched over 20 categories this year out of 317 eligible feature films. Of that number, half of the 30 represent just a single nomination. If you eliminate Animated Feature and Makeup/Hairstyling, you would have just eight films with a single nom, making the gap even wider in 18 key categories. That means there are a mere 15 films that received more than one nomination, a strong indication, as has been true in the recent past, that a paltry number of movies are taking up most of the oxygen, a point proven just by looking at most categories and seeing the same few films listed over and over. What all this says is that in the democracy known as the Motion Picture Academy there are realistically few ways to break in and upset the apple cart. Unless you have a big campaign, or a distributor hell-bent on making a mark like Neon, which buys up every winner in Cannes and winds up with four of the five International Feature nominees, what chance do you have to get through to voters? In asking for transparency from its members, in hoping for honesty, the Academy is clearly aware this has become a contest for the haves and the have nots, and maybe, just maybe, by adding the intimidation level of “requiring” members to see the movies before voting it can begin to make a difference in the level playing field of the winners, and going forward the nominees. For now though it is just a few who will share the glory on Oscar night. And by the way, it is no wonder that David Ellison was so bound and determined to succeed in taking over Warner Bros. It is sad that Paramount, a once great player in this sandbox, has an embarrassing zero nominations (even with the shamefully under-seen Roofman , produced in part by the Academy’s current president Lynette Howell Taylor) while Warners has 30 noms and shares in another four for distributing Apple’s F1. If you can’t beat ’em, buy them. Salute To Oscar’s Underdogs – Class Of ’25 All of this brings me to the true underdogs who are hoping for a miracle come Oscar night, and counting on voters to see their films before sending in a ballot — those one-hit wonders, those single nominations that somehow overcame the odds and got recognition from their peers despite the fact they were in a movie that didn’t register with the Academy otherwise. Let’s look at the acting categories, where a whopping 11 of the 20 acting nominees come from only three films (count ’em, three films): One Battle After Another with four, Sentimental Value with four, and Sinners with three. The ‘Sentimental Value’ team in Cannes Getty The Academy smartly lets the individual branches vote for nominations, but in the finals taking place now until next Thursday, it is the entire Academy that gets to vote in every category (provided they verify they have seen the nominees — see the beginning of this column for details). That means those acting nominees coming from those three films with a combined total 38 nominations overall have a distinct advantage of being seen by all members, not just the branch that invited them to the party. And five of the other acting nominees are also in multi-nominated movies that have all been nominated in Best Picture, a huge advantage. So is there any hope, any hope at all , for those not in a Best Picture nominee and therefore tilting at windmills, climbing the highest mountain, trying to defeat the odds, but praying the new rule designed to make voters testify they see you really works? If it does, can we reasonably expect that Ethan Hawke , Kate Hudson , Rose Byrne and Amy Madigan have a fighting chance? ‘Blue Moon’ Berlin Film Festival Hawke has won widespread praise for his portrayal of musical genius Lorenz Hart in Blue Moon but his, along with Best Original Screenplay, is just one of two nominations for the movie from Sony Pictures Classics, which is not waging the kind of money-ed campaign going for the likes of DiCaprio, Chalamet, and Jordan in more widely seen movies than this terrific little indie. Hawke has, out of necessity, been out there stumping (check out my current The Actor’s Side video interview with him on Deadline), but is it enough? I have talked to voters who bring his name up voluntarily, a good sign, but how many have seen it? Kate Hudson and Hugh Jackman in Craig Brewer’s ‘Song Sung Blue’ Sarah Shatz/Focus Features Hudson, so great in Song Sung Blue, continues to get a robust campaign with billboards and TV ads from Focus Features. But she is up against front-runner Jessie Buckley in Hamnet getting even a bigger campaign from the same distributor, and Hudson is the sole nomination for her film, so its a long shot here. But never say never because 25 years exactly since her first nomination for Almost Famous there is a lot of hometown goodwill for her work. Facing the same odds, but not having nearly the kind of visible campaign support (ala TV, billboards, etc) from A24, Byrne is hoping to ride wins at the Golden Globes and Indie Spirits, as well as deep respect in the industry, to turn her first Best Actress nomination for If I Had Legs I’d Kick You into Oscar gold. It’s a tough assignment since it is the single recognition for the movie that premiered at Sundance 13 months ago, this despite the fact that her co-star Conan O’Brien is again hosting the Academy Awards. He, however, does not control which names are in the envelopes. Conan O’Brien and Rose Byrne in ‘If I Had Legs I’d Kick You’ A24 /Courtesy Everett Collection Finally, in the Supporting categories, every nominee except one out of the 10 is also in a more widely seen Best Picture nominee. That lone exception is veteran Amy Madigan, up for Supporting Actress in Weapons , its only nomination, and in the running again only 40 years since her first and only previous nomination for 1985’s Twice in a Lifetime. This achievement is close to a near record in term of gaps between nominations (Judd Hirsch still holds it at 42 years). The Critics Choice winner is looking for momentum from this weekend’s Actor Awards, but it is still a steep climb, not to mention Weapons being a horror movie and the kind of role that rarely wins Oscars. She’s brilliant in it, so again if voters watched she might have a fighting chance. Amy Madigan as Aunt Gladys in ‘Weapons’ Warner Bros. To give you an idea of the long odds facing these acting nominees in lesser-seen performances, Forest Whitaker was the last to take home Best Actor for a film’s single nomination, for Last King of Scotland in 2006. Julianne Moore in Still Alice was the last to do it in 2014 in the Best Actress category. Christopher Plummer pulled off the feat in 2013 for Beginners, and then before that it was Jack Palance in 1991’s City Slickers , 39 years after his first nomination for Shane. These were all veteran stars long overdue. In Supporting Actress, Penélope Cruz won as the sole nominee for her 2007 film Vicki Cristina Barcelona, but then Woody Allen films had a long track record of delivering in this category. Winning on a single nomination has become so rare that when Marisa Tomei did it for 1992’s My Cousin Vinny, a March release no less, it was considered even then so unlikely that a conspiracy theory lives on to this day suggesting that presenter Palance read off the wrong name. Still, there is always hope, especially with new guidelines urging voters to watch the movies, so best of luck to all of you. Oscar voting continues through March 5 at 5 p.m. PT. The 98th Oscars airs on ABC and Hulu at 4 p.m. PT/7 p.m. ET on March 15. Is Par’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? David Zaslav Tries To Sell Par Deal To Shocked & Disappointed Staff At Town Hall ‘Scream 7’ Is Slaying: Pic Eyes Franchise-Best $59M In Opening Frame ‘Sinners’ ‘One Battle’ & ‘KPop Demon Hunters’ Take Top Film Prizes: Full List Read More About: 1 Comments"
    },
    {
      "title": "Mason Gooding On Reluctance To Embrace ‘Scream King’ Moniker, Learning To “Lead With Grace” On James Van Der Beek’s Final Film",
      "url": "https://deadline.com/2026/02/mason-gooding-reluctance-scream-king-james-van-der-beek-final-film-1236739148/",
      "date_collected": "2026-02-28 07:16:23",
      "publication_date": "2026-02-28T00:35:21",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Glenn Garner Glenn Garner Associate Editor @xoxo_glenn More Stories By Glenn ‘Scream 7’ Original Directors Say Their Version Was Intended To “F*ck You Up” Mason Gooding On Reluctance To Embrace ‘Scream King’ Moniker, Learning To “Lead With Grace” On James Van Der Beek’s Final Film Marlon Wayans Leaks ‘Scary Movie 6’ Trailer: “Just Bootlegged My Own Movie Trailer” View All February 27, 2026 4:35pm Mason Gooding at the Deadline Hollywood Portrait Studio during the 2026 Sundance Film Festival on Jan. 24, 2026 in Park City, Utah Josh Telles/Deadline With his recent performance in Gregg Araki’s hit Sundance romp I Want Your Sex and his return to the Scream franchise this weekend, Mason Gooding ‘s busy onscreen year is just getting started. Following Wednesday’s world premiere of Scream 7 , now playing in theaters, the actor told Deadline that despite reprising his role as Chad Meeks-Martin and starring in last year’s V-Day slasher Heart Eyes , the idea of being considered a ‘Scream King’ “stresses me out.” “I grew up with a certain affinity for horror and genre storytelling, and I feel like my natural proclivity to love stories, the Trojan horse sentimentality and themes through bombast and spectacle, is kind of what compels me as an audience member,” he explained. “And then as an artist, I feel like it allows certain stories that we tell as people to kind of transcend time or epoch and kind of resonate regardless of generation or experience.” Related Stories Red Carpet Premieres Kevin Williamson Comments On “Free Palestine” Protest At ‘Scream 7’ Premiere: “They Have The Right To Be Heard” Trailers ‘The Gates’ Trailer: James Van Der Beek Plays A Murderous Pastor In One Of His Final Roles Gooding added, “So, horror movies are something I love, and hopefully, I get to keep doing them for the rest of my life. But the ‘Scream King’ moniker thing always stresses me out because I feel like there’s just so much more I wanna do. And I appreciate it, but I’m trying my best to live up to it.” Watch on Deadline In the thriller genre, Gooding recently ventured to Catoosa, Oklahoma to work with James Van Der Beek on his final film, The Gates , in which about three young Black men heading to party find themselves trapped in a gated community, where they witness a resident commit murder. “It was a lot of trying your best to remain present and having someone as seasoned and giving and considerate as James to kind of lead that way and incite a lot of growth, at least in me as an artist,” explained Gooding. “It meant that even though I was tired every day, I still felt like I was being productive and educated on the nature of leading a film, and how to lead with grace and be considerate of all others as he does so effortlessly.” Read on about Mason Gooding’s return as Chad Meeks-Martin in Scream 7 , now in theaters, as well as his upcoming performances in The Gates , I Want Your Sex and 72 Hours . DEADLINE: It’s cool to see you and Mindy return, and I feel like you’ve kind of become somewhat of a ‘Scream King’ in the past few years with Heart Eyes and the Scream franchise. What’s that been like? MASON GOODING: You know, I grew up with a certain affinity for horror and genre storytelling, and I feel like my natural proclivity to love stories, the Trojan horse sentimentality and themes through bombast and spectacle, is kind of what compels me as an audience member, and then as an artist. I feel like it allows certain stories that we tell as people to kind of transcend time or epoch and kind of resonate regardless of generation or experience, so horror movies are something I love, and hopefully, I get to keep doing them for the rest of my life. But the ‘Scream King’ moniker thing always stresses me out because I feel like there’s just so much more I wanna do. And I appreciate it, but I’m trying my best to live up to it. DEADLINE: That’s fair. I’m sure you heard about the protests last night. What was it like returning to this movie without Melissa Barrera and Jenna Ortega? GOODING: I think, in terms of engaging with something that began as a like meaningful family-oriented—in terms of the experience—project, that you hope that remains constant moving forward, obviously, you don’t know the likelihood of sequels. And getting to engage with the artistry of Melissa’s immense talent and Jenna’s incredible penchant for creativity, I’m grateful for the amount of time I got to spend with them in 5 and 6 . So, coming back for 7 , I think it felt like a natural process to go through a level of grief. And once they had discovered their story with Neve [Campbell] and Kevin [Williamson] coming back into it, I think after you process the change that takes place in a franchise as ubiquitous as Scream , my North Star kind of just became, how do I support these people that have created this world that means so much to me? And in an attempt to pay tribute to something that has been around since my birth, as I was born, I think a few days after Scream premiered, it was really just in discussions with them about how meaningful it would be to bring Neve and Sidney back into the fold in a way that I think was just very exciting for me. Mason Gooding as Chad Meeks-Martin in ‘Scream 7’ (2026) (Jessica Miglio/Paramount Pictures/Courtesy Everett Collection) DEADLINE: And I also thought it was funny to see Chad and Mindy now as Gale’s “hot interns.” GOODING: Right, as we put it. The evolution of character became such a natural element to how you play the character. I loved that Chad had a level of exhaustion that I think is natural, given his experience in the past two films. And I think that juxtaposes nicely with Jasmin [Savoy Brown] portraying Mindy as still as passionate, as exuberant as she is, meaning that she will always be dedicated to her inquiry and pursuit of correctly guessing, or incorrectly guessing the nature of the film they’re in. But also, just for them, it’s real life, the lives that they lead. DEADLINE: I feel like both of them are practically invincible at this point. GOODING: See, it’s funny cause you do start to wonder what it is that coalesces into a kill in the Scream franchise. Obviously, Dewey has had his fair share of stabs, but it wasn’t until they did the old stab and pull up method that seemed to do him in. I’ve always wanted to die in a spectacular fashion in a movie. The closest I ever got was this movie I did called Fall , where I fell, and off-camera. Scream is a great opportunity to get murdered in a much more memorable way, but it hasn’t happened yet, so I’m just trying to figure out the best way to incorporate that in, somehow. Maybe, Chad has a brother, and I can play the brother, and then the brother dies. DEADLINE: Yeah, they’re triplets. GOODING: Yeah, exactly … But see, I’m a big text analysis nerd. I love the idea that Chad predicates a lot of his character and understanding on the protection of others. He’s the type of person to put his body on the line for the people that he cares about. DEADLINE: I heard that there’s already like talks about Scream 8 . GOODING: [Kevin Williamson] did say that. It’s funny, I think the first time I had engaged with even the idea of continuing, someone had asked Kevin, and he brought it up that on set, that you just start coming up with ideas , and I feel like I don’t have the foresight to think longterm like that. They obviously haven’t had any discussions with me, but I appreciate that in putting Kevin back in the driver’s seat, in a lot of ways, we have access to his line of thinking and how all-encompassing it is, how little threads can be laid in one movie and have that pay off in a sequel or in a long-standing franchise. So, I’m not surprised, but I am personally, especially cause I wasn’t a part of those conversations, I’m curious to know what about 7 piqued his interest to return to an 8 , aside from the obvious, being Isabel May’s incredible performance, but that’s certainly no surprise for her. She’s remarkable in all ways, so. Mason Gooding as Chad Meeks-Martin and Jasmin Savoy Brown as Mindy Meeks-Martin in ‘Scream 7’ (2026) (Jessica Miglio/Paramount Pictures/Courtesy Everett Collection) DEADLINE: Yeah, she was a great choice for Sidney’s daughter GOODING: I thought so too. DEADLINE: And I know you also have The Gates coming up. What can you tell me about that? GOODING: The Gates , it takes place in Texas. It’s about these three Black boys that try to make their way to a party in the wee hours of the evening and take a shortcut through a gated community, end up witnessing a murder, and then are pursued through that gated community by the perpetrator of said murder, and are blamed for it throughout. Filming it, we shot in Catoosa, Oklahoma, which I never thought I’d spend much time there, but now I know it intimately. I feel like we had so many assets that made the film feel so meaningful on the day, that to share it with people is so exciting, especially given our willingness to navigate certain thematic elements, like a relationship to federal authority or even a spiritual authority, as the antagonist of the film, played by the late great James Van Der Beek, misappropriates and also weaponizes the concept of faith and belief in religion and community to sort of direct the ire of the entire community into these three Black men that have ultimately just been trying to navigate their way out of said community. But, it was super fun, four weeks of straight night shoots. It was a lot of trying your best to remain present and having someone as seasoned and giving and considerate as James to kind of lead that way and incite a lot of growth, at least in me as an artist, meant that even though I was tired every day, I still felt like I was being productive and educated on the nature of leading a film, and how to lead with grace and be considerate of all others as he does so effortlessly. DEADLINE: Well, I’m sorry for your loss. That one cut deep, really. GOODING: I know, truly, and my heart goes out to his family. I personally go back and forth on the way we engage in honoring, posthumously, an artist’s body of work, and to me, I don’t look beyond the fact that I was able to meet him and have an experience on set. That was as impactful and meaningful to me, that I can now engage and share with my understanding of James in his personhood, outside of his work, that has meant a lot, not only to me, but to all people fortunate enough to watch his work. I can say that his personhood is as remarkable and all-encompassing in its own right, which you always hope people are as wonderful as you think they are, and James was certainly that. James Van Der Beek in ‘The Gates’ (2026) (Sherwood Jones/Lionsgate /Courtesy Everett Collection) DEADLINE: That’s great to hear. I really enjoyed I Want Your Sex . Gregg Araki is my favorite director, so it’s just cool to see him back. GOODING: He’s got good taste. It’s funny that he has a penchant for visibility, not only of community, but also of lifestyle and taste. And I feel like his fan base is also so keen on seeing something expressed, whether through sexuality or the aesthetics of sex, in a way that feels like spectacle. If in a horror movie, you have these gruesome kills and these crazy killer masks and things, Greg predicates a lot of his aesthetic on the humanity and the humor and the awkwardness based around sexuality and what that might look like from a cerebral standpoint, and also how that might feel from a set design or character standpoint. It’s very cool. DEADLINE: Yeah, his entire aesthetic, from the beginning, has always just been so inspiring to me. You play Zap, who’s a very outspoken gay character, and I know you have a lot of gay fans. Was there a pressure for you to get it right for the gay fans? GOODING: Of course, trying to pay tribute to the queer community by actually expressing knowingness and understanding, both of the adversity experienced in real life, and how that might incite Zap’s confidence in his willingness to reject social etiquette, as his version of reclaiming his own agency. I feel as though my own personal experiences kind of become more manageable by portraying characters that have a level of confidence and that ingrained sense of community that I love about my queer friends and idols, that happened to make the most meaningful art, bred through that adversity, that I feel like portraying that self-assuredness. And he’s very fashion forward. There was a piece that Zap wears in the gallery that was made, customized specifically off the runway, that I was lucky enough to put on. And I feel like Zap, as it relates to his identity, is able to push the boundaries and to be outspoken because he knows in theory what it feels like to be othered, or in the worst case, unpersoned. And I love any opportunity to play a character that is separate from me, but one that I can investigate and do research on and understand as best that I can, and hopefully, I did a good job. You have to let me know. But he was certainly the pleasure of a lifetime. DEADLINE: Yeah, he was fun to watch, definitely. And I didn’t realize the last time we talked, this was a reunion for you and Olivia Wilde, which is crazy because I love Booksmart . What was it like working with her again after so many years? GOODING: Obviously, the dissimilarity between being directed by her and being technically a co-star of her is kind of getting to engage with her brilliance on multifacets. The fact that she has such a vision and a brain for direction and narrative allows her performance to take all that creativity and understanding of world-building and turn it into a laser beam of focus into a singular person or singular character. That meant following that lead was as challenging as you would want it to be, to feel productive. But she also subverts that by being so giving and communicative about process and character, and I feel like whether she’s acting or she’s directing, there’s always an opportunity to learn something from both in the way that she carries herself and also the way she discusses intent and process. It’s the reason I’m here today, certainly, and also something I benefited from greatly as her co-star. DEADLINE: It was great seeing both of you in that movie. Any chance there’s like a 10-year reunion Booksmart movie on the horizon? GOODING: I would love to do that. Obviously, as I said, it’s hard to think longterm about what creatively makes the most sense in terms of reinvestigating narrative in a sequel or in a franchise, but Booksmart is one of those things where, because it’s a high school narrative, I’m always fascinated to know who these kids become in their adult lives. And if there was a Booksmart 2 , any opportunity to watch Kaitlyn Dever or Beanie Feldstein step back into those characters would be exciting for me, or Billie Lourd as Gigi, that for me, would be very exciting. But if people watch it, I’m sure they’d make it happen. It just depends on what people want. Keith Powers, Algee Smith and Mason Gooding in ‘The Gates’ (2026) (Sherwood Jones/Lionsgate/Courtesy Everett Collection) DEADLINE: I would definitely go see it. I loved the first one. GOODING: You and me both. Be there opening night. I don’t even need to be in it. I would watch it 10 times. DEADLINE: And I know you have a few projects coming up. What can you tell me about 72 Hours ? GOODING: It’s a bachelor party comedy in which, I’m engaged and my best man, played by Marcello Hernandez, and my bachelor buddies, Ben Marshall, Kam [Patterson], we accidentally invite Kevin Hart, he plays the character Joe. Hijinks kind of ensues through the streets of Miami. It was definitely, funnily enough, despite that incredibly warm and goofy premise, it was maybe some of the most challenging work I’ve had to do, mostly just cause I don’t think I’m that funny. DEADLINE: No, I think you’re funny. GOODING: I appreciate you saying that cause I will take that compliment as much as I can, cause it makes me feel like hopefully I’m wrong. But in this case, getting to work opposite Kevin, who has a masterful handle over being a conduit for comedy or drama when need be, it meant that I didn’t need to be very funny, cause I could rely on Marcello, Ben or Kam to inundate the story with so many jokes, and I have my little drama corner over here. And then Kevin allowed himself to, by proxy of his talent, made himself the conduit to connect the two, so that you’re getting the funny as well as the sentimental moments that make the movie, in my mind, actually very poignant and thoughtful in a way that I’m really excited for people to see. DEADLINE: That’s awesome. You definitely have plenty of funny roles. Like I said, in I Want Your Sex , there’s just nonstop laughs with your dialogue. He’s very unhinged. I love it. GOODING: But that’s under the watchful eye of Gregg, who himself is so hilarious, just innately. It made the job super easy. DEADLINE: Your dad is also a great comedic actor. I read somewhere that you went to set with him once and then decided you’d rather go to college first instead of acting. Is that right? GOODING: I don’t know if it happened quite as succinctly as that, because then I would have maybe more direction in my adolescence. But I grew up on set and would try and parse out as much usable knowledge about the craft of acting, as well as the business, that when I went to college, I think my original intent was to study acting and be trained from a classical standpoint. And he—I hope he doesn’t mind me saying, he’s not here, and I haven’t spoken to him in a minute—but he was like, “I think you should go study something else. Being an actor means empathy for personhood and understanding of the human condition.” He’s like, “I don’t know if learning technique through a college course is going to yield that understanding.” He’s like, “I think you should experience a different curriculum that might broaden your understanding of people.” Hence, I studied psychology and writing, which ended up being super useful, because I was able to spot out and analyze the script in a way that’s helped me a ton in my professional life. And also psychology means I can be my own therapist. No! I can really understand the human condition from a more collegiate standpoint and understand why we are the way that we are. So, when I talk to a director about decisions or choices, it’s not necessarily based on a technique, but rather a textbook understanding of causality and why we are the way that we are, specifically through our adolescence experience. DEADLINE: I noticed that like in the times we’ve spoken, your answers are very well thought-out, and it really provides like interesting perspective that I appreciate. GOODING: Yeah. Obviously, I’m still formulating my understanding of our place in culture as artists, specifically as it relates to my hand in that, and I feel like what we owe outside of the work that is consumed by an audience is an understanding and thoughtful nature with the work that we put out. I try my best to have an opinion on the films that I make, and also the narratives and stories that they tell, so that when I’m discussing something that might mean a lot to people like Scream or Love, Victor , I feel like I’ve had maybe the most heartfelt interactions about that show. It’s not coming from a place—this is no offense to actors that will publicly tout, “oh, I needed the money, I took the job”—I feel like the reason I act is to engage with the innate desire for people to tell stories. … Otherwise, I don’t want an audience member who maybe responds so resoundingly to that work to feel as though it didn’t mean as much to me as it did to them, cause at that point, it’s like, you might as well AI me. Our opinions are what make us human. It’s what I think separates us as individuals, and also ironically, is what brings us together through discourse. It’s why I love when actors, performers, athletes discuss their work and they discuss their intent, because it allows the person to shine through in a way that is very meaningful to me. Is Par’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? David Zaslav Tries To Sell Par Deal To Shocked & Disappointed Staff At Town Hall ‘Scream 7’ Is Slaying: Pic Eyes Franchise-Best $59M In Opening Frame ‘Sinners’ ‘One Battle’ & ‘KPop Demon Hunters’ Take Top Film Prizes: Full List Read More About: Comments"
    },
    {
      "title": "Sony Pictures Classics Continues Sundance Buying Streak With Jon Hamm, John Slattery & Zoey Deutch Pic ‘Gail Daughtry And The Celebrity Sex Pass’",
      "url": "https://deadline.com/2026/02/jon-hamm-gail-daughtry-and-the-celebrity-sex-pass-sony-classics-1236739248/",
      "date_collected": "2026-02-28 07:16:21",
      "publication_date": "2026-02-28T00:38:31",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Anthony D'Alessandro Anthony D'Alessandro Editorial Director/Box Office Editor @AwardsTony More Stories By Anthony Sony Pictures Classics Continues Sundance Buying Streak With Jon Hamm, John Slattery & Zoey Deutch Pic ‘Gail Daughtry And The Celebrity Sex Pass’ Movie Theater Org Cinema United Remains Firmly Against Paramount-Warner Bros Merger & Warns About “Fewer Movies Being Made” ‘Scream 7’ Shrieking At Record Decibels With Franchise-Best $59M Debut – Box Office Update View All February 27, 2026 4:38pm 'Gail Daughtry and the Celebrity Sex Pass' Sundance Institute EXCLUSIVE: Sony Pictures Classics has taken its fourth Sundance Film Festival feature this year with the David Wain-directed comedy Gail Daughtry and the Celebrity Sex Pass . The deal for the pic’s global rights was negotiated between Sony Pictures Classics and WME Independent on behalf of the filmmakers. We hear there were about seven offers on the movie including Paramount/Republic Pictures, Lionsgate and Vertical. To date, Sony Pictures Classics has acquired out of this year’s Sundance Stephanie Ahn’s Bedford Park , Josef Kubota Wladyka’s Ha-Chan, Shake Your Booty and Noah Segan’s crime thriller The Only Living Pickpocket in New York. Related Stories Reviews ‘Gail Daughtry & The Celebrity Sex Pass’ Review: Zoey Deutch Leads Sex Romp Parody Down Yellow Brick Road To Absurdist Hollywood – Sundance Film Festival News Zoey Deutch On Stalking Jon Hamm And John Slattery On Playing Himself In David Wain And Ken Marino’s ‘Gail Daughtry And The Celebrity Sex Pass’ – Sundance Studio Gail Daughtry , which was shot entirely in Los Angeles, stars Mad Men ‘s Jon Hamm and John Slattery in a big-screen reteam alongside Zoey Deutch ( Nouvelle Vague ), Ken Marino ( The Residence ), Miles Gutierrez-Riley ( Smile 2 ), Ben Wang ( Karate Kid: Legends ), Joe Lo Truglio ( Brooklyn Nine-Nine ) and Sabrina Impacciatore ( The White Lotus ). Watch on Deadline Sony Pictures Classics Small-town hairdresser Gail Daughtry is engaged to her devoted high school sweetheart, Tom. Her life takes a turn when a trip to a book signing leads to Tom meeting – and sleeping – with his “celebrity pass.” Reeling from the betrayal, Gail impulsively joins her friend Otto on a trip to Los Angeles, where a psychic convinces Gail that the only way to save her marriage is to “even the scales” with her own celebrity pass: Jon Hamm. Thus begins an epic journey through Tinseltown as Gail and Otto join forces with a talent agency assistant, a paparazzo, and actor John Slattery, all in the search for Hamm. Along the way, they collide with celebrities and are hunted by a group of Italian assassins as they get ever closer to finding the elusive star. Wain ( Wet Hot American Summer, Role Models ) wrote the movie with longtime collaborator Marino. The pic notched 74% fresh reviews on Rotten Tomatoes out of its Sundance premiere. Wain said, “I think we’re all hungry to have more movies in theaters that are designed to provide laughter and joy, first and foremost — and I can’t wait for audiences to experience this very first chapter in the GDU (Gail Daughtry Universe)!” “To have our film embraced by Sony Pictures Classics, a company that has championed visionary filmmakers for decades, is incredibly special. I am deeply grateful for their passion and support and excited to work together on this,” added producer Crystine Zhang. “ Gail Daughtry and the Celebrity Sex Pass is the most hilarious comedy we have seen in ages with one of the most incredible and surprising indie casts any film could ask for. In a time when audiences need to smile, David Wain has delivered an entertainment that will have audiences’ cheeks hurting from all their laughs,” said Sony Pictures Classics. The film is produced by Anthony Bregman, Peter Cron, Marino, Wain, Zhang and Charles Zhong. EPs include Robert Herjavec, Chechen Dong, Tom Griffin, Amanda Chang, Adrian Politowski, Jamie Canniffe, Franny Baldwin, Deutch, Hamm and Slattery. Additional notable film creatives include cinematographer Kevin Atkinson ( A Futile and Stupid Gesture ), production designer Justin Lieb ( Stranger Than Fiction ), editor John Daigle ( Plus One ), costume designer Bryn Carter ( A Tree Fell in the Woods ), and composer Craig Wedren ( School of Rock ). Is Par’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? David Zaslav Tries To Sell Par Deal To Shocked & Disappointed Staff At Town Hall ‘Scream 7’ Is Slaying: Pic Eyes Franchise-Best $59M In Opening Frame ‘Sinners’ ‘One Battle’ & ‘KPop Demon Hunters’ Take Top Film Prizes: Full List Read More About: Comments"
    },
    {
      "title": "Cindy Holland Talks Taylor Sheridan’s “Unexpected & Intimate” New Paramount+ Series ‘The Madison’",
      "url": "https://deadline.com/2026/02/cindy-holland-taylor-sheridan-the-madison-paramount-plus-1236738927/",
      "date_collected": "2026-02-28 07:16:20",
      "publication_date": "2026-02-28T02:23:49",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Nellie Andreeva Nellie Andreeva Editor-In-Chief @DeadlineNellie More Stories By Nellie Netflix Leaders Reassure Staff At Town Hall After Ceding Warner Bros. To Paramount By Not Raising Bid Cindy Holland Talks Taylor Sheridan’s “Unexpected & Intimate” New Paramount+ Series ‘The Madison’ David Zaslav Tries To Sell Paramount Deal To Shocked & Disappointed Employees At Town Hall: “We’re The Envy Of All Of The Industry” View All February 27, 2026 6:23pm Paramount's Cindy Holland and Michelle Pfeiffer at the premiere screenings for 'The Madison' Paramount+ Hours after the stunning developments of Thursday afternoon when, in the span of hour of and a half, Warner Bros. Discovery took Paramount’s “superior” offer and Netflix pulled out, Paramount+ held a previously planned premiere screening for Taylor Sheridan ‘s new drama The Madison starring Michelle Pfeiffer. Symbolically, given the events of the past 24 hours, the Friday premiere was held at a favorite event place of future corporate sibling HBO, the San Vicente Bungalows, where the WBD streamer holds its Emmy parties as well as premiere screenings, including the one for House of the Dragon. Related Stories News Where to Watch All The 'Scream' Films: Streaming Guide News 'Tulsa King' Spinoff Starring Samuel L. Jackson Gets New Title After Moving Setting From NOLA To Frisco, TX; Taylor Sheridan Writing All Episodes The Madison screening was hosted by Paramount’s Direct to Consumer chair Cindy Holland who called the family drama an “unexpected, incisive and intimate” entry in the Taylor Sheridan universe. The series debuts the first three hours of its six-episode first season on March 14. As Deadline revealed , a six-episode second season is already in the can, with its release date TBD. Sheridan wrote every episode of both installments. Watch on Deadline Production on Season 2 of The Madison was wrapping when Skydance’s acquisition of Paramount Global was completed, with Holland and her team, led by Head of Originals Jane Wiseman, taking over Paramount+. While, as Holland said, “I cannot take credit for anything related to The Madison except my desire to support this series which I’m very proud of,” the show fits into the new regime strategy to expand into female-driven dramas to balance out Paramount+’s existing slate, including hit Taylor Sheridan series such as Landman and Tulsa King as well as the Star Trek franchise. Two high-profile recent commissions, Discretion , starring Nicole Kidman and Elle Fanning, and Fear Not, headlined by Anne Hathaway, also both fall into the female-forward lane which involves stories and talent in front and behind the camera. In addition to a largely female cast led by Pfeiffer, The Madison has Christina Alexandra Voros as director, executive producer and cinematographer on all six episodes from Season 1. Holland called Sheridan “a very talented artist and a joy to work with.” In addition to his slate of ongoing series, he has three upcoming ones, The Madison and Yellowstone spinoff The Dutton Ranch for Paramount+ as well as fellow Yellowstone offshoot Marshals for CBS, which will stream next day on Paramount+. The prolific writer-producer remains based at Paramount until January 2029 when he moves to NBCUniversal . The news of his new deal made waves in October , putting a spotlight on his relationship with the post-merger Paramount Skydance leadership. Sheridan has received several Paramount+ renewals since and recently committed to writing all eight episodes of Tulsa King spinoff Frisco King starring Samuel L. Jackson. Under the new regime, Paramount+ is experimenting with release patterns beyond Paramount+’s traditional weekly episode debut or the binge model introduced by Netflix where Holland and Wiseman were key programming executives for many years. For instance, The Madison ‘s first season is being released in two weekly installments of three episodes each. The series, which follows New York City’s the Clyburns to the Madison River valley of central Montana, is produced by Paramount Television Studios, David C. Glasser’s 101 Studios and Bosque Ranch Productions. In addition to Sheridan, in her brief remarks, Holland acknowledged Glasser as well as “the incredible” Pfeiffer, who attended the screening. She reminiscent about seeing Pfeiffer in Scarface and Grease 2 when she was young. “But when I saw your performance in Dangerous Liaisons i n the theater, it was that day that I knew I wanted to support that kind of art, those kind of performances,” Holland added, addressing the Oscar-nominated actress. The Madison also stars Kurt Russell, Beau Garrett, Elle Chapman, Patrick J. Adams, Amiah Miller, Alaina Pollack, Ben Schnetzer, Kevin Zegers, Rebecca Spence, Danielle Vasinova, Matthew Fox and Will Arnett. Here is a trailer: Is Par’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? David Zaslav Tries To Sell Par Deal To Shocked & Disappointed Staff At Town Hall ‘Scream 7’ Is Slaying: Pic Eyes Franchise-Best $59M In Opening Frame ‘Sinners’ ‘One Battle’ & ‘KPop Demon Hunters’ Take Top Film Prizes: Full List Read More About: Comments"
    },
    {
      "title": "‘Scream 7’ Original Directors Say Their Version Was Intended To “F*ck You Up”",
      "url": "https://deadline.com/2026/02/scream-7-original-directors-version-1236739343/",
      "date_collected": "2026-02-28 07:16:19",
      "publication_date": "2026-02-28T02:39:35",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Glenn Garner Glenn Garner Associate Editor @xoxo_glenn More Stories By Glenn ‘Scream 7’ Original Directors Say Their Version Was Intended To “F*ck You Up” Mason Gooding On Reluctance To Embrace ‘Scream King’ Moniker, Learning To “Lead With Grace” On James Van Der Beek’s Final Film Marlon Wayans Leaks ‘Scary Movie 6’ Trailer: “Just Bootlegged My Own Movie Trailer” View All February 27, 2026 6:39pm Ghostface 'Scream 7' (2026) Paramount Pictures Following Scream 7 ‘s long and bumpy road to the screen, Radio Silence is reflecting on their original vision for the slasher installment. The directing duo, consisting of Matt Bettinelli-Olpin and Tyler Gillett , recently described “how hard” they wanted to go with their version of the film, before ultimately departing the project to direct their vampire ballerina flick, Abigail (2024), with Christopher Landon temporarily stepping in for the pair. “We never read a draft of any version of Scream 7 that we were going to do because we had left to do Abigail before that,” noted Bettinelli-Olpin to Entertainment Weekly . “The thing that we had in our minds for Scream 7 was sort of like, ‘How hard can we go with this?’ It was the thing that we talked a lot about. For us, it was always this idea of, [if] Scream VI is like a secret feel-good movie, Scream 7 ‘s going to f*ck you up. That was as much as we ever got to.” Related Stories News Skeet Ulrich Says He Was Supposed To Return For ‘Scream 7’ Before Melissa Barrera’s Firing News Melissa Barrera Appears To React To ‘Scream 7’ Premiere Protest: “I See You” Gillett added, “Given that we expanded the sort of scope of the story by going to New York, the other thing that we had talked about — just Matt and I, by the way, it wasn’t a conversation with the writers — was, ‘How do you do the opposite for 7 ?’ Like, shrink it down and make it this like ultra-contained, almost continuous, like minute-to-minute thing. But outside of our own stupid idea, we weren’t privy to any plan beyond just, ‘There’s gonna be another one.'” Watch on Deadline Although they didn’t have specifics to share, Skeet Ulrich recently teased what was supposed to happen in Scream 7 with his murderous character Billy Loomis’ daughter Sam Carpenter (Melissa Barrera) and her sister Tara (Jenna Ortega) in the “really, really interesting” sequel, before Barrera was fired from the franchise . Matt Bettinelli-Olpin and Tyler Gillett attend the premiere of ‘Abigail’ on April 17, 2024 in Los Angeles, California. Gilbert Flores/Variety “I’m not involved. I’m really excited though,” he said of Scream 7 . “I’m excited for [original Scream (1996) writer] Kevin Williamson to take the helm and to see what the mastermind of it all comes up with. I have no clue.” Ulrich added, “I used to know because part of coming back for five and six was being a part of seven. It was a three-picture arc for Billy Loomis, or the imagination of Billy Loomis in Melissa Barrera’s character’s head. But when all that went down with her, obviously you lose her and you lose what’s in her head.” Spyglass fired Barrera in November 2023 over her social media posts on the Israel-Hamas conflict and the “atrocities being committed against Palestinians,” explaining the company has “zero tolerance for antisemitism or the incitement of hate in any form, including false references to genocide, ethnic cleansing, Holocaust distortion or anything that flagrantly crosses the line into hate speech.” Neve Campbell as Sidney Prescott in ‘Scream 7’ Paramount/Spyglass Following her ousting, Jenna Ortega also exited the franchise , later noting that the sequel “ was all kind of falling apart ” without Barrera to play its new ‘final girl’ Sam Carpenter. Director Christopher Landon dropped out of the project as well, citing “highly aggressive and really scary” death threats targeting his children . Neve Campbell was then brought back to reprise her role as OG ‘final girl’ Sidney Prescott in March 2024, with original Scream (1996) writer Williamson on board to direct. She previously sat out 2023’s Scream VI over the low pay offer. Is Par’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? David Zaslav Tries To Sell Par Deal To Shocked & Disappointed Staff At Town Hall ‘Scream 7’ Is Slaying: Pic Eyes Franchise-Best $59M In Opening Frame ‘Sinners’ ‘One Battle’ & ‘KPop Demon Hunters’ Take Top Film Prizes: Full List Read More About: Comments"
    },
    {
      "title": "Ryan Gosling On Why Big Franchises “Never Felt Right” Before ‘Star Wars: Starfighter’",
      "url": "https://deadline.com/2026/02/ryan-gosling-big-franchises-never-felt-right-star-wars-1236739383/",
      "date_collected": "2026-02-28 07:16:18",
      "publication_date": "2026-02-28T03:36:23",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Glenn Garner Glenn Garner Associate Editor @xoxo_glenn More Stories By Glenn ‘Scream 7’ Original Directors Say Their Version Was Intended To “F*ck You Up” Mason Gooding On Reluctance To Embrace ‘Scream King’ Moniker, Learning To “Lead With Grace” On James Van Der Beek’s Final Film Marlon Wayans Leaks ‘Scary Movie 6’ Trailer: “Just Bootlegged My Own Movie Trailer” View All February 27, 2026 7:36pm Ryan Gosling and Flynn Gray on the set of 'Star Wars: Starfighter' Shawn Levy/Instagram Although Ryan Gosling has been known to take on some major leading roles, he’s yet to commit to an ongoing franchise. The 3x Oscar nominee recently explained why those kinds of projects “never felt right” until Shawn Levy ‘s Star Wars : Starfighter , which went into production last fall and is scheduled to premiere May 28, 2027 in theaters. “It was Shawn’s enthusiasm and his vision and the script,” Gosling told io9 . “And I just avoided these things because they never felt right. And I’m glad I did because I feel like, [similar to] a book like this, [it was] worth waiting for. And it is like a once-in-a-lifetime opportunity.” Related Stories News ‘Star Wars: Starfighter’ First Look: Shawn Levy Posts Ryan Gosling Image From Mediterranean Sea Set News ‘Star Wars: Starfighter’: Shawn Levy, Ryan Gosling Reveal Details & Premiere Date For New Film — Star Wars Celebration A standalone film outside the Skywalker saga, Starfighter is set five years after Star Wars: Episode IX — The Rise of Skywalker (2019). Penned by Jonathan Tropper, the movie stars Gosling, Matt Smith, Mia Goth, Aaron Pierre, Simon Bird, Jamael Westman, Daniel Ings, Flynn Gray and Amy Adams. Watch on Deadline Gosling previously praised the installment as “such a great story with great and original characters,” as well as “so much heart and adventure,” adding: “There is not a more perfect filmmaker for this particular story than Shawn.” While the actor has played Ken in Barbie (2023) and starred alongside Harrison Ford in Blade Runner (2049), he’s yet to play the same character twice. With familiar faces constantly popping up in the ever-expanding Lucasfilm universe, Gosling could be up for a potential return down the road. Is Par’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? David Zaslav Tries To Sell Par Deal To Shocked & Disappointed Staff At Town Hall ‘Scream 7’ Is Slaying: Pic Eyes Franchise-Best $59M In Opening Frame ‘Sinners’ ‘One Battle’ & ‘KPop Demon Hunters’ Take Top Film Prizes: Full List Read More About: 2 Comments"
    },
    {
      "title": "Netflix Leaders Reassure Staff At Town Hall After Ceding Warner Bros. To Paramount By Not Raising Bid",
      "url": "https://deadline.com/2026/02/netflix-town-hall-after-warner-bros-paramount-ted-sarandos-1236739331/",
      "date_collected": "2026-02-28 07:16:17",
      "publication_date": "2026-02-28T03:54:56",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Nellie Andreeva Nellie Andreeva Editor-In-Chief @DeadlineNellie More Stories By Nellie Netflix Leaders Reassure Staff At Town Hall After Ceding Warner Bros. To Paramount By Not Raising Bid Cindy Holland Talks Taylor Sheridan’s “Unexpected & Intimate” New Paramount+ Series ‘The Madison’ David Zaslav Tries To Sell Paramount Deal To Shocked & Disappointed Employees At Town Hall: “We’re The Envy Of All Of The Industry” View All February 27, 2026 7:54pm Ted Sarandos and Greg Peters Netflix With Netflix employees still absorbing the news that the streamer won’t be buying Warner Bros. per the two companies’ December 5 agreement, co-CEOs Ted Sarandos and Greg Peters held a brief town hall Friday morning. The 15-20-minute affair was moderated by Netflix Chief Communications Officer Dani Dudeck and did not include a Q&A section, sources said. In their remarks, Sarandos and Peters sounded confident about their decision t o walk away from Warner Bros. and explained their reasons. According to sources, they said that they had a number for the storied film and TV studio and knew what it had to be in order to make sense for the company. When the Warner Bros. Discovery board came back with the recommendation for the higher price offered by Paramount and asked Netflix to match it, the duo’s response was a quick no. Sarandos and Peters noted that they had done due diligence and didn’t feel like they needed to prolong the process if the number was above the threshold they had set. Watch on Deadline Related Stories Acquisitions Paramount + WBD Vs. Coalition Of The Unwilling: CA AG Pulling Together Blue States Probe Of Mega-Merger News Paramount Purchase Of Warner Bros. Discovery Stirs Angst At CNN - Again In justifying their call, Sarandos and Peters used a version of the line they used in yesterday’s “thanks but no thanks” reply to WBD ‘s request for a higher bid, that acquiring Warner Bros. “was always a ‘nice to have’ at the right price, not a ‘must have’ at any price.” They also touted a strong year ahead for Netflix and momentum through 2030, a milestone year the streamer had been building to. Sarandos and Peters went on to thank employees, including those who had spent the last month and a half working on integration that didn’t happen, and asked people to go carry on with their work. They may have showed restrain and discipline in walking away, but that does not mean that Sarandos and Peters were not disappointed by the outcome of the Warner Bros. sale. Sarandos, in particular, had made it clear how much he wanted the century-old studio. With Paramount’s hostile takeover efforts ramping up in the past couple of weeks, he went on a publicity tour, talking up Netflix’s cause in several interviews, and was in Washington D.C. for meetings about the Netflix-WB deal when news of WBD board’s recommendation came in Thursday afternoon. Like the Warner Bros. Discovery town hall , which was held an hour earlier this morning, the 9 AM PT Netflix one was scheduled last minute, after WBD Board’s Paramount “superior offer” declaration Thursday afternoon and Netflix’s pullout an hour and a half later. Incidentally, it was the second Netflix town hall this week; the streamer also held their regular quarterly town hall a couple of days ago, I hear. As for Netflix staff’s reaction to losing Warner Bros., it is said to be mixed, with people divided over the news but virtually all stunned by it. “The office was quiet yesterday,” one person said. Is Par’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? David Zaslav Tries To Sell Par Deal To Shocked & Disappointed Staff At Town Hall ‘Scream 7’ Is Slaying: Pic Eyes Franchise-Best $59M In Opening Frame ‘Sinners’ ‘One Battle’ & ‘KPop Demon Hunters’ Take Top Film Prizes: Full List Read More About: 4 Comments"
    },
    {
      "title": "ACE Eddie Awards Winners List: ‘Sinners’, ‘One Battle After Another’ & ‘KPop Demon Hunters’ Take Top Film Prizes",
      "url": "https://deadline.com/2026/02/ace-eddie-awards-2026-winners-list-1236739337/",
      "date_collected": "2026-02-28 07:16:16",
      "publication_date": "2026-02-28T04:32:00",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Erik Pedersen Erik Pedersen Managing Editor More Stories By Erik Neil Sedaka Dies: “Breaking Up Is Hard To Do” & “Laughter In The Rain” Hitmaker Who Also Wrote “Love Will Keep Us Together” Was 86 2026 Awards Season Calendar: Dates For Oscars, Guilds, Tonys & More 2026 Premiere Dates For New & Returning Series On Broadcast, Streaming & Cable View All February 27, 2026 8:32pm ACE Eddie Awards American Cinema Editors Warner Bros’ awards-season combatants Sinners and One Battle After Another and Netflix’s toon phenom KPop Demon Hunters took the top film prizes at 2026 annual ACE Eddie Awards , which were handed out Friday night at UCLA’s Royce Hall. See the full winners list below. Sinners editor Michael P. Shawver took the Eddie Award for Best Edited Feature Drama, and One Battle ’s Andy Jurgensen took the Feature Comedy prize. Both are up for Best Editing at the Academy Awards on March 15, where they will compete against Stephen Mirrione ( F1 ), Ronald Bronstein and Josh Safdie ( Marty Supreme ) and Olivier Bugge Coutté ( Sentimental Value ). Related Stories Below The Line 2026 Awards Season Calendar: Dates For Oscars, Guilds, Tonys & More Below The Line Ang Lee Set For ACE Eddie Awards 2026 Filmmaker Of The Year Honor Since the turn of the 21st century, the Eddie winner for theatrical drama has gone on to score the Academy Award for Best Editing 14 of 26 times — but only once in the past five years, for Oppenheimer . Wicked and Emilia Pérez took the top film honors at the 2025 Eddies , with Anora ‘s Sean Baker going on the win the Oscar for Best Film Editing . The night’s first big film prize went to Nathan Schauf of the awards-season juggernaut KPop Demon Hunters for Best Edited Animated Feature. The Netflix pic is hot off its sweep at the Annie Awards and a VES Award this week. On the TV side, the Best Edited Drama Series prize went to HBO Max’s The Pitt, which won the Drama Series Emmy in September, and HBO’s The Penguin took the Limited Series award. Another 2025 Emmy winner, Apple TV’s The Studio , won the trophy for Single Camera Series, and CBS’ now-wrapped Frasier got the Multi-Camera category. The documentary categories were handed out first, with The Perfect Neighbor winning for film and HBO’s Pee-wee as Himself taking the TV prize. Other winners included the editors behind the wonderfully controversial “Twisted Christian” episode of South Park for Best Edited Animated Series, Saturday Night Live 50th Anniversary Special for Variety Talk/Sketch Show or Special, Conan O’Brien Must Go for Non-Scripted Series and All the Empty Rooms for Best Edited Short. A Winter’s Song won for Best Edited Feature Film (Non-Theatrical). The editors group presented a handful of special honors tonight. Two-time Oscar winner Ang Lee will receive the ACE Golden Eddie Filmmaker of the Year Award. Along with his Best Director wins for Life of Pi and Brokeback Mountain, Lee’s many films include Gemini Man (2019), Billy Lynn’s Long Halftime Walk (2016), Lust, Caution (2007), Hulk (2003), Sense and Sensibility (1995) and The Wedding Banquet (1993). His Eat Drink Man Woman (1994), The Ice Storm (1997) and Taking Woodstock (2009) premiered at the Cannes Film Festival, as did Couching Tiger . Emmy-winning Law & Order editor-director Arthur Forney, who also has eight other Emmy noms for the NBC franchise’s mothership series, accepted the first of two ACE Career Achievement awards. The prize was presented by longtime L&O franchise stars Mariska Hargitay and Christopher Meloni. Forney other credits include hundreds of episodes of Law & Order: SVU and Organized Crime along with NBC’s Chicago P.D., Med and Fire and CBS’ FBI . Oscar-nominated editor Robert Leighton received the other Career Achievement, presented by Christopher Guest, who directed three films he edited: Best in Show, A Mighty Wind and For Your Consideration . Leighton’s dozens of film credits also include Rob Reiner’s A Few Good Men — for which Leighton got his Oscar nom — This Is Spinal Tap, When Harry Met Sally…, Stand by Me and The Princess Bride along with Bull Durham, Misery, Ghosts of Mississippi, Shall We Dance? and Now You See Me. The ACE Visionary Award went to YouTube and was be accepted by Kim Larson, Managing Director and Head of the Creator and Gaming team. The award was presented by Michele Khare, host of the popular YouTube docuseries Challenge Accepted. The In Memoriam segment included tributes to Reiner , Chris Willingham , Don Zimmerman , Jane Kass, William Steinkamp, Alan C. Marks, John Soh and Ted Woerner. Deli Boys star and Wrecked alum Asif Ali hosted the ceremony. Here are the 2026 ACE Eddie Awards : BEST EDITED FEATURE FILM (Drama, Theatrical) Sinners Michael P. Shawver BEST EDITED FEATURE FILM (Comedy, Theatrical) One Battle After Another Andy Jurgensen BEST EDITED FEATURE FILM (NON-THEATRICAL) A Winter’s Song Yvette M. Amirian BEST EDITED ANIMATED FEATURE FILM KPop Demon Hunters Nathan Schauf BEST EDITED MULTI-CAMERA COMEDY SERIES Frasier (Murder Most Finch) Russell Griffin BEST EDITED SINGLE CAMERA COMEDY SERIES The Studio (The Promotion) Eric Kissack BEST EDITED LIMITED SERIES The Penguin (A Great or Little Thing) Henk van Eeghen BEST EDITED DRAMA SERIES The Pitt (6pm) Mark Strand BEST EDITED ANIMATED SERIES South Park (Twisted Christian) David List, Nate Pellettieri BEST EDITED SHORT All the Empty Rooms Erin Casper, Stephen Maing, Jeremy Medoff BEST EDITED NON-SCRIPTED SERIES Conan O’Brien Must Go (Austria) Matthew Shaw, Brad Roelandt BEST EDITED VARIETY TALK/SKETCH SHOW OR SPECIAL Saturday Night Live 50th Anniversary Special Paul Del Gesso, Christopher Salerno, Ryan Spears, Sean Mcilraith, Ryan Mcilraith, Daniel Garcia BEST EDITED DOCUMENTARY FEATURE The Perfect Neighbor Viridiana Lieberman BEST EDITED DOCUMENTARY SERIES Pee-wee as Himself – Part One Damian Rodriguez ANNE V. COATES AWARD FOR STUDENT EDITING Luis Barragan – California State University, Fullerton Is Par’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? David Zaslav Tries To Sell Par Deal To Shocked & Disappointed Staff At Town Hall ‘Scream 7’ Is Slaying: Pic Eyes Franchise-Best $59M In Opening Frame ‘Sinners’ ‘One Battle’ & ‘KPop Demon Hunters’ Take Top Film Prizes: Full List Read More About: Comments"
    },
    {
      "title": "‘The Napa Boys’, ‘Idiotka’ & Japan’s First Interactive Anime New In Limited Release, ‘Elvis Presley In Concert’ Expands – Specialty Preview",
      "url": "https://deadline.com/2026/02/new-indie-films-the-napa-boys-idiotka-elvis-presley-in-concert-expands-1236739426/",
      "date_collected": "2026-02-28 07:16:15",
      "publication_date": "2026-02-28T04:44:33",
      "source": "Deadline",
      "full_text": "Skip to main content Dismiss News Banner Breaking News Massive Merger Confirmed: Par And WBD Reveal Details Of $110B Deal Read the full story By Jill Goldsmith Jill Goldsmith Co-Business Editor More Stories By Jill ‘The Napa Boys’, ‘Idiotka’ & Japan’s First Interactive Anime New In Limited Release, ‘Elvis Presley In Concert’ Expands – Specialty Preview Netflix Banks A Quick $2.8 Billion As Paramount Pays WBD Termination Fee; Streamer’s Shares Rise Another 14% Netflix Walks With A Cool $2.8 Billion Breakup Fee: Who Gets What In New Paramount-WBD Merger Proposal View All February 27, 2026 8:44pm The Napa Boys Magnolia Pictures Hollywood franchise filmmaking spoof The Napa Boys , fashion comedy Idiotka , Jessica Chastain- starring Dreams , and Werner Herzog’s documentary Ghost Elephants debut with the unusual Hypnosismic – Division Rap Battle-Interactive Movie. Baz Luhrmann’s EPiC: Elvis Presley In Concert from Neon expands to 1,000 screens after the buzzy doc’s weeklong Imax exclusive run on 325 big screens. Cannes-premiering The President’s Cake from Sony Pictures Classics moves into 180 theaters. Magnolia comedy The Napa Boys starts in LA at the Landmark and AMC Americana with cast and filmmaker Q&As all weekednd. Adds the Angelika in New York next week. Directed by Nick Corirossi, who also stars with co-writer Armen Weitzman in a film that’s billed as the fourth installment of a fictional franchise. Jack Jr. (Corirossi), his reluctant co-captain Miles Jr. (Weitzman) and the rest of the Napa Boys gang are back for one more wine-sloshed journey into the unknown, reads the logline. With a mission set forth by the mysterious Sommelier, they’re joined this time by Puck, a bright young podcaster and the Napa Boys’ biggest fan. Watch on Deadline Related Stories News After More Than A Decade In The Ensemble, Anna Baryshnikov Claims The Spotlight With 'Idiotka' News Baz Luhrmann Says Elvis Presley Stage Musical \"Is Happening\" Features an ensemble of alt-comedians Sarah Ramos, Mike Mitchell, Chloe Cherry, Vanessa Chester, Paul Rust, Jamar Neighbors, Nelson Franklin, David Wain, Ray Wise, Riki Lindhome, Natasha Leggero, Ivy Wolk and Beth Dover. Jerrod Carmichael serves as Executive Producer. Utopia is out with SXSW 2025 fashion comedy Idiotka written and directed by Nastasya Popov. Stars Anna Baryshnikov, Camila Mendes (who also producers), Julia Fox, Owen Thiele, Benito Skinner, Gabbriette and Saweetie. Popov’s directorial debut – see Deadline review — follows Baryshnikov as Margarita, an ambitious fashion designer living in a chaotic West Hollywood apartment with her Russian-Jewish family who and enters a reality TV competition show called Slay, Serve, Survive in a desperate cash grab. It’s playing selected shows with Alamo Drafthouse ahead of an LA premiere at American Cinematique next weekend Michel Franco’s Dreams from Greenwich Entertainment starring Jessica Chastain and Isaac Hernandez opens on 188 screens. Premiered at Berlin 2025, see Deadline review . A powerful socialite and a promising ballet dancer begin a dangerous affair. When he secretly crosses the US-Mexico border, she takes desperate measures to protect their future together. Werner Herzog’s Venice-premiering documentary Ghost Elephants opens in limited release in NY (IFC Center) and LA (Laemmle Newhall) via Abramorama after a one night nationwide simulcast in over 100 theaters Thursday night. For over a decade, Dr. Steve Boyes, conservation biologist and National Geographic Explorer, has been in search of a mysterious, elusive herd of Ghost Elephants in the highlands of Angola, deep within its forests. The doc follows Boyes on an epic journey as he sets out with some of the best master trackers in the world, in pursuit of an animal long believed to be a myth. GKIDS is partnering with Regal Cinemas on the release of HYPNOSISMIC -Division Rap Battle- Interactive Movie , an interactive animated rap tournament where the audience votes on the outcome in real time using a web-connected phone app. The program will be running on a regular show schedule at 15 locations throughout the U.S. starting February 27. The film broke limited release box office records in Japan when it opened last spring. By Takanori Tsujimoto, written by Yuichiro Momose, starring Subaru Kimura, Shitaro Asanuma and Yusuke Shirai, the synopsis calls it “an immersive cinematic experience where the outcome lies in your hands. “Vote with or against your fellow movie-goers to determine how each battle unfolds in Japan’s first interactive anime film, where each film screening is uniquely shaped by its audience. Disputes are now settled through rap battles instead of violence using a special microphone known as the Hypnosis Mic. Lyrics delivered through the mic directly affect the human spirit, thereby eliminating the need for armed conflict. Six groups (Buster Bros!!!, Mad Trigger, Fling Posse, Matenro, Dotsuitare-Hompo, and Bad Ass Temple) from regions throughout Japan now compete to prove their strength in the Final Division Rap Battle, hosted by Kotonohatoh. In a world where words have replaced weapons, the ultimate rap battle that will decide the future of the nation is about to begin.” Is Par’s Debt-Laden WBD Takeover Another Ill-Starred Hollywood Sequel? David Zaslav Tries To Sell Par Deal To Shocked & Disappointed Staff At Town Hall ‘Scream 7’ Is Slaying: Pic Eyes Franchise-Best $59M In Opening Frame ‘Sinners’ ‘One Battle’ & ‘KPop Demon Hunters’ Take Top Film Prizes: Full List Read More About: Comments"
    }
  ]
}